[{
    "book_description": ["One choice can transform you—or it can destroy you. But every choice has consequences, and as unrest surges in the factions all around her, Tris Prior must continue trying to save those she loves—and herself—while grappling with haunting questions of grief and forgiveness, identity and loyalty, politics and love.", "Tris's initiation day should have been marked by celebration and victory with her chosen faction; instead, the day ended with unspeakable horrors. War now looms as conflict between the factions and their ideologies grows. And in times of war, sides must be chosen, secrets will emerge, and choices will become even more irrevocable—and even more powerful. Transformed by her own decisions but also by haunting grief and guilt, radical new discoveries, and shifting relationships, Tris must fully embrace her Divergence, even if she does not know what she may lose by doing so.", " bestselling author Veronica Roth's much-anticipated second book of the dystopian DIVERGENT series is another intoxicating thrill ride of a story, rich with hallmark twists, heartbreaks, romance, and powerful insights about human nature."],
    "info": {
        "ISBN": "(ISBN13: 9780007442911)",
        "Series": "Divergent #2",
        "setting": ["Chicago, Illinois"],
        "Original Title": "Insurgent",
        "Characters": ["Albert", "Drew Leighton (Divergent)", "Eric (Divergent)", "Beatrice Prior", "Peter", "...more", "Caleb Prior", "Natalie Prior", "Molly Atwood", "Christina", "Jeanine Matthews", "Marcus Eaton", "Tobias Eaton", "...less"],
        "Edition Language": "English",
        "Literary Awards": ["Romantic Times Reviewers' Choice Award (RT Award) for Young Adult Protagonist (2011)", "Goodreads Choice Award for Best Young Adult Fantasy and Best Goodreads Author (2012)"]
    },
    "book_format_type": "Hardcover",
    "book_cover_url": "https://images.gr-assets.com/books/1325667729l/11735983.jpg",
    "author": "Veronica Roth",
    "title": "\n      Insurgent\n      ",
    "number_of_pages": "525 pages",
    "publish_info": ", ",
    "genres_info": ["Young Adult", "12,289 users", "Science Fiction", "Dystopia", "9,074 users", "Fiction", "3,628 users", "Fantasy", "3,100 users"]
}, {
    "book_description": [".", "He doesn’t remember anything before waking up in a bus full of kids on a field trip. Apparently he has a girlfriend named Piper, and a best friend named Leo. They’re all students at a boarding school for “bad kids.” What did Jason do to end up here? And where is here, exactly?", ".", "Her father has been missing for three days, ever since she had that terrifying nightmare about his being in trouble. Piper doesn’t understand her dream, or why her boyfriend suddenly doesn’t recognize her. When a freak storm hits during the school trip, unleashing strange creatures and whisking her, Jason, and Leo away to someplace called Camp Half-Blood, she has a feeling she’s going to find out.", ".", "When he sees his cabin at Camp Half-Blood, filled with power tools and machine parts, he feels right at home. But there’s weird stuff, too—like the curse everyone keeps talking about, and some camper who's gone missing. Weirdest of all, his bunkmates insist that each of them—including Leo—is related to a ", ". Does this have anything to do with Jason's amnesia, or the fact that Leo keeps seeing ghosts?"],
    "info": {
        "ISBN": "(ISBN13: 9781423113393)",
        "Series": "The Heroes of Olympus #1",
        "setting": ["New York City, New York", "Detroit, Michigan", "San Francisco, California", "…more", "Quebec City, Quebec", "Chicago, Illinois", "Omaha, Nebraska", "Walnut Creek", "…less"],
        "Original Title": "The Lost Hero",
        "Characters": ["Leo Valdez", "Thalia Grace", "Annabeth Chase", "Rachel Elizabeth Dare", "Jason Grace", "...more", "Piper McLean", "Will Solace", "...less"],
        "Edition Language": "English",
        "Literary Awards": ["West Australian Young Readers' Book Award (WAYRBA) for Older Readers (2011)", "Evergreen Teen Book Award (2013)", "Goodreads Choice Award Nominee for Favorite Book, Young Adult Fantasy  (2010)"]
    },
    "book_format_type": "Paperback",
    "book_cover_url": "https://images.gr-assets.com/books/1464201003l/7736182.jpg",
    "author": "Rick Riordan",
    "title": "\n      The Lost Hero\n      ",
    "number_of_pages": "557 pages",
    "publish_info": ", ",
    "genres_info": ["Fantasy", "2,352 users", "Young Adult", "978 users", "Fantasy", "Mythology", "899 users", "Childrens", "Middle Grade", "618 users", "Fiction", "367 users", "Adventure", "325 users", "Childrens", "258 users", "Mythology", "Greek Mythology", "219 users", "Audiobook", "162 users", "Fantasy", "Urban Fantasy", "136 users"]
}, {
    "book_description": ["Sixteen-year-old Cinder is considered a technological mistake by most of society and a burden by her stepmother. Being cyborg does have its benefits, though: Cinder's brain interference has given her an uncanny ability to fix things (robots, hovers, her own malfunctioning parts), making her the best mechanic in New Beijing. This reputation brings Prince Kai himself to her weekly market booth, needing her to repair a broken android before the annual ball. He jokingly calls it \"a matter of national security,\" but Cinder suspects it's more serious than he's letting on.", "Although eager to impress the prince, Cinder's intentions are derailed when her younger stepsister, and only human friend, is infected with the fatal plague that's been devastating Earth for a decade. Blaming Cinder for her daughter's illness, Cinder's stepmother volunteers her body for plague research, an \"honor\" that no one has survived.", "But it doesn't take long for the scientists to discover something unusual about their new guinea pig. Something others would kill for."],
    "info": {
        "ISBN": "(ISBN13: 9780312641894)",
        "Series": "The Lunar Chronicles #1",
        "setting": ["New Beijing"],
        "Original Title": "Cinder",
        "Characters": ["Linh Cinder", "Queen Levana", "Emperor Kai", "Iko", "Crescent Moon \"Cress\" Darnel", "...more", "Dr. Dmitri Erland", "Sybil Mira", "Linh Adri", "Linh Peony", "Linh Pearl", "...less"],
        "Edition Language": "English",
        "Literary Awards": ["Kalbacher Klapperschlange for Altersgruppe 7. - 9. Klasse (2015)", "Pennsylvania Young Readers' Choice Award Nominee for Young Adults (2014)", "Lincoln Award Nominee (2014)", "Goodreads Choice Award Nominee for Best Young Adult Fantasy & Science Fiction (2012)", "Premio El Templo de las Mil Puertas Nominee for Mejor novela extranjera perteneciente a saga (2012)"]
    },
    "book_format_type": "Hardcover",
    "book_cover_url": "https://images.gr-assets.com/books/1470056948l/11235712.jpg",
    "author": "Marissa Meyer",
    "title": "\n      Cinder\n      ",
    "number_of_pages": "390 pages",
    "publish_info": ", ",
    "genres_info": ["Young Adult", "8,259 users", "Fantasy", "6,530 users", "Science Fiction", "4,442 users", "Science Fiction", "Dystopia", "2,718 users", "Romance", "2,420 users"]
}, {
    "book_description": ["For thirty-five girls, the Selection is the chance of a lifetime. The opportunity to escape the life laid out for them since birth. To be swept up in a world of glittering gowns and priceless jewels. To live in a palace and compete for the heart of gorgeous Prince Maxon.", "But for America Singer, being Selected is a nightmare. It means turning her back on her secret love with Aspen, who is a caste below her. Leaving her home to enter a fierce competition for a crown she doesn't want. Living in a palace that is constantly threatened by violent rebel attacks.", "Then America meets Prince Maxon. Gradually, she starts to question all the plans she's made for herself—and realizes that the life she's always dreamed of may not compare to a future she never imagined."],
    "info": {
        "ISBN": "(ISBN13: 9780062059932)",
        "Series": "The Selection #1",
        "Literary Awards": ["Lincoln Award Nominee (2015)"],
        "Characters": ["Aspen Leger", "America Singer", "Prince Maxon"],
        "Edition Language": "English",
        "Original Title": "The Selection"
    },
    "book_format_type": "Hardcover",
    "book_cover_url": "https://images.gr-assets.com/books/1322103400l/10507293.jpg",
    "author": "Kiera Cass",
    "title": "\n      The Selection\n      ",
    "number_of_pages": "336 pages",
    "publish_info": "\n            Published\n        April 24th 2012\n         by HarperTeen\n\n      ",
    "genres_info": ["Young Adult", "5,829 users", "Romance", "4,111 users", "Science Fiction", "Dystopia", "4,105 users", "Fantasy", "1,733 users"]
}, {
    "book_description": ["Louisa Clark is an ordinary young woman living an exceedingly ordinary life—steady boyfriend, close family—who has never been farther afield than their tiny village. She takes a badly needed job working for ex-Master of the Universe Will Traynor, who is wheelchair-bound after an accident. Will has always lived a huge life—big deals, extreme sports, worldwide travel—and now he’s pretty sure he cannot live the way he is.", " Will is acerbic, moody, bossy—but Lou refuses to treat him with kid gloves, and soon his happiness means more to her than she expected. When she learns that Will has shocking plans of his own, she sets out to show him that life is still worth living.", "A love story for this generation, ", " brings to life two people who couldn’t have less in common—a heartbreakingly romantic novel that asks, What do you do when making the person you love happy also means breaking your own heart?"],
    "info": {
        "ISBN": "(ISBN13: 9780670026609)",
        "Series": "Me Before You #1",
        "Literary Awards": ["Goodreads Choice Award Nominee for Fiction (2013)"],
        "Characters": ["Louisa \"Lou\" Clark", "Will Traynor"],
        "Edition Language": "English",
        "Original Title": "Me Before You"
    },
    "book_format_type": "Hardcover",
    "book_cover_url": "https://images.gr-assets.com/books/1357108762l/15507958.jpg",
    "author": "Jojo Moyes",
    "title": "\n      Me Before You\n      ",
    "number_of_pages": "369 pages",
    "publish_info": "\n            Published\n        December 31st 2012\n         by Pamela Dorman Books/Viking\n\n      ",
    "genres_info": ["Romance", "565 users", "Audiobook", "403 users", "Fiction", "344 users", "Love", "258 users", "Contemporary", "223 users", "European Literature", "British Literature", "199 users", "Death", "148 users", "Womens Fiction", "Chick Lit", "137 users", "Did Not Finish", "128 users", "Relationships", "127 users"]
}, {
    "book_description": ["In the year 2044, reality is an ugly place. The only time teenage Wade Watts really feels alive is when he's jacked into the virtual utopia known as the  OASIS. Wade's devoted his life to studying the puzzles hidden within this world's digital confines, puzzles that are based on their creator's obsession with the pop culture of decades past and that promise massive power and fortune to whoever can unlock them. When Wade stumbles upon the first clue, he finds himself beset by players willing to kill to take this ultimate prize. The race is on, and if Wade's going to survive, he'll have to win—and confront the real world he's always been so desperate to escape."],
    "info": {
        "Edition Language": "English",
        "setting": ["Columbus, Ohio", "Oklahoma City, Oklahoma"],
        "ISBN": "(ISBN13: 9780307887436)",
        "Literary Awards": ["Prometheus Award for Best Novel (2012)", "ALA Alex Award (2012)", "Lincoln Award Nominee (2014)", "Tähtivaeltaja Award Nominee (2013)", "Mary Shelley Award for Outstanding Fictional Work (2016)", "...more", "Green Mountain Book Award Nominee (2015)", "...less"],
        "Characters": ["Wade Owen Watts", "Ogden Morrow", "Parzival", "Aech", "James Donovan Halliday", "...more", "Art3mis", "Kira Morrow", "Daito", "Shoto", "Nolan Sorrento", "...less"]
    },
    "book_format_type": "Hardcover",
    "book_cover_url": "https://images.gr-assets.com/books/1500930947l/9969571.jpg",
    "author": "Ernest Cline",
    "title": "\n      Ready Player One\n",
    "number_of_pages": "374 pages",
    "publish_info": "\n            Published\n        August 16th 2011\n         by Crown Publishers\n\n            ",
    "genres_info": ["Science Fiction", "6,819 users", "Fiction", "4,537 users", "Science Fiction", "Dystopia", "2,158 users", "Young Adult", "2,109 users", "Fantasy", "1,963 users"]
}, {
    "book_description": ["From the highly acclaimed, multiple award-winning Anthony Doerr, the beautiful, stunningly ambitious instant ", " bestseller about a blind French girl and a German boy whose paths collide in occupied France as both try to survive the devastation of World War II.", "Marie-Laure lives with her father in Paris near the Museum of Natural History, where he works as the master of its thousands of locks. When she is six, Marie-Laure goes blind and her father builds a perfect miniature of their neighborhood so she can memorize it by touch and navigate her way home. When she is twelve, the Nazis occupy Paris and father and daughter flee to the walled citadel of Saint-Malo, where Marie-Laure’s reclusive great-uncle lives in a tall house by the sea. With them they carry what might be the museum’s most valuable and dangerous jewel.", "In a mining town in Germany, the orphan Werner grows up with his younger sister, enchanted by a crude radio they find. Werner becomes an expert at building and fixing these crucial new instruments, a talent that wins him a place at a brutal academy for Hitler Youth, then a special assignment to track the resistance. More and more aware of the human cost of his intelligence, Werner travels through the heart of the war and, finally, into Saint-Malo, where his story and Marie-Laure’s converge.", "Doerr’s “stunning sense of physical detail and gorgeous metaphors” (", ") are dazzling. Deftly interweaving the lives of Marie-Laure and Werner, he illuminates the ways, against all odds, people try to be good to one another. Ten years in the writing, a National Book Award finalist, All the Light We Cannot See is a magnificent, deeply moving novel from a writer “whose sentences never fail to thrill” (", ")."],
    "info": {
        "Edition Language": "English",
        "setting": ["Paris", "Saint Malo", "Zollverein"],
        "ISBN": "(ISBN13: 9781476746586)",
        "Literary Awards": ["Pulitzer Prize for Fiction (2015)", "Audie Award for Fiction (2015)", "ALA Alex Award (2015)", "Dayton Literary Peace Prize for Fiction (Runner-Up) (2015)", "Andrew Carnegie Medal for Fiction (2015)", "...more", "Idaho Book of the Year Award (2014)", "National Book Award Finalist for Fiction (2014)", "Goodreads Choice Award for Historical Fiction (2014)", "International DUBLIN Literary Award Nominee (2016)", "...less"],
        "Characters": ["Werner Pfennig", "Marie-Laure LeBlanc", "Frank Volkheimer", "Etienne LeBlanc", "Frederick", "...more", "Jutta Pfennig", "Madame Manec", "Reinhold von Rumpel", "Frau Elena", "Daniel LeBlanc", "Dr. Hauptmann", "Walter Bernd", "Bastian", "...less"]
    },
    "book_format_type": "Hardcover",
    "book_cover_url": "https://images.gr-assets.com/books/1451445646l/18143977.jpg",
    "author": "Anthony Doerr",
    "title": "\n      All the Light We Cannot See\n",
    "number_of_pages": "531 pages",
    "publish_info": "\n            Published\n        May 6th 2014\n         by Scribner\n\n      ",
    "genres_info": ["Historical", "8,601 users", "Fiction", "5,994 users", "War", "1,078 users", "War", "World War II", "975 users", "Adult", "736 users", "Cultural", "France", "670 users", "Book Club", "606 users", "Adult Fiction", "587 users", "Audiobook", "524 users", "Literary Fiction", "455 users"]
}, {
    "book_description": ["The circus arrives without warning. No announcements precede it, no paper notices plastered on lampposts and billboards. It is simply there, when yesterday it was not. ", "Within these nocturnal black-and-white striped tents awaits an utterly unique, a feast for the senses, where one can get lost in a maze of clouds, meander through a lush garden made of ice, stare in wonderment as the tattooed contortionist folds herself into a small glass box, and become deliciously tipsy from the scents of caramel and cinnamon that waft through the air. ", "Welcome to Le Cirque des Rêves. ", "Beyond the smoke and mirrors, however, a fierce competition is under way--a contest between two young illusionists, Celia and Marco, who have been trained since childhood to compete in a \"game\" to which they have been irrevocably bound by their mercurial masters. Unbeknownst to the players, this is a game in which only one can be left standing, and the circus is but the stage for a remarkable battle of imagination and will. ", "As the circus travels around the world, the feats of magic gain fantastical new heights with every stop. The game is well under way and the lives of all those involved--the eccentric circus owner, the elusive contortionist, the mystical fortune-teller, and a pair of red-headed twins born backstage among them--are swept up in a wake of spells and charms. ", "But when Celia discovers that Marco is her adversary, they begin to think of the game not as a competition but as a wonderful collaboration. With no knowledge of how the game must end, they innocently tumble headfirst into love. A deep, passionate, and magical love that makes the lights flicker and the room grow warm whenever they so much as brush hands. ", "Their masters still pull the strings, however, and this unforeseen occurrence forces them to intervene with dangerous consequences, leaving the lives of everyone from the performers to the patrons hanging in the balance. ", "Both playful and seductive, ", ", Erin Morgenstern's spell-casting debut, is a mesmerizing love story for the ages."],
    "info": {
        "ISBN": "(ISBN13: 9780385534635)",
        "setting": ["New York City, New York", "Concord, Massachusetts", "London, England", "…more", "Dublin", "Boston, Massachusetts", "Montreal, Quebec (Montréal, Québec)", "Paris", "Basel", "Munich (Münich or München)", "Glasgow, Scotland", "Lyon", "Cairo", "Vienna", "Constantinople", "…less"],
        "Original Title": "The Night Circus",
        "Characters": ["Celia Bowen", "Marco Alisdair", "Isobel Martin", "Penelope \"Poppet\" Aislin Murray", "Winston \"Widget\" Aidan Murray", "...more", "Bailey Clarke", "Alexander H.", "Hector Bowen", "Chandresh Christophe Lefevre", "Friedrick Stefan Thiessen", "Ethan Barris", "Tara Burgess", "Lainie Burgess", "Tante Padva", "Tsukiko", "...less"],
        "Edition Language": "English",
        "Literary Awards": ["Locus Award for Best First Novel (2012)", "Guardian First Book Award Nominee for Longlist (2011)", "Mythopoeic Fantasy Award Nominee for Adult Literature (2012)", "ALA Alex Award (2012)", "Lincoln Award Nominee (2014)", "...more", "The Kitschies Nominee for Golden Tentacle (Debut) (2011)", "Goodreads Choice Award Nominee for Best Fantasy (2011)", "International DUBLIN Literary Award Nominee (2013)", "...less"]
    },
    "book_format_type": "Hardcover",
    "book_cover_url": "https://images.gr-assets.com/books/1387124618l/9361589.jpg",
    "author": "Erin Morgenstern",
    "title": "\n      The Night Circus\n",
    "number_of_pages": "400 pages",
    "publish_info": ", ",
    "genres_info": ["Fantasy", "11,532 users", "Fiction", "5,244 users", "Romance", "2,610 users", "Historical", "1,708 users", "Fantasy", "Magic", "1,497 users"]
}, {
    "book_description": ["In a time when Shadowhunters are barely winning the fight against the forces of darkness, one battle will change the course of history forever. Welcome to the Infernal Devices trilogy, a stunning and dangerous prequel to the ", " bestselling Mortal Instruments series.", "The year is 1878. Tessa Gray descends into London’s dark supernatural underworld in search of her missing brother. She soon discovers that her only allies are the demon-slaying Shadowhunters—including Will and Jem, the mysterious boys she is attracted to. Soon they find themselves up against the Pandemonium Club, a secret organization of vampires, demons, warlocks, and humans. Equipped with a magical army of unstoppable clockwork creatures, the Club is out to rule the British Empire, and only Tessa and her allies can stop them..."],
    "info": {
        "ISBN": "(ISBN13: 9781416975861)",
        "Series": "The Infernal Devices #1",
        "setting": ["London, England"],
        "Original Title": "Clockwork Angel",
        "Characters": ["Theresa Gray", "Magnus Bane", "William Herondale", "James Carstairs", "Jessamine Lovelace", "...more", "Henry Branwell", "Charlotte Branwell", "Nathaniel Gray", "Camille Belcourt", "Sophie Collins", "...less"],
        "Edition Language": "English",
        "Literary Awards": ["RITA Award by Romance Writers of America Nominee for Young Adult Romance (2011)", "Romantic Times Reviewers' Choice Award (RT Award) Nominee for Best Young Adult Paranormal/Fantasy Novel (2010)", "The Inky Awards for Silver Inky (2011)", "Lincoln Award Nominee (2013)", "Goodreads Choice Award Nominee for Favorite Book, Favorite Heroine, Young Adult Fantasy, Goodreads Author (2010)", "...more", "The Inky Awards Shortlist for Silver Inky (2011)", "Oklahoma Sequoyah Award for High School (2013)", "Premio El Templo de las Mil Puertas for Mejor novela extranjera perteneciente a saga (2010)", "...less"]
    },
    "book_format_type": "Hardcover",
    "book_cover_url": "https://images.gr-assets.com/books/1454962884l/7171637.jpg",
    "author": "Cassandra Clare",
    "title": "\n      Clockwork Angel\n      ",
    "number_of_pages": "481 pages",
    "publish_info": ", ",
    "genres_info": ["Fantasy", "7,492 users", "Young Adult", "6,062 users", "Fantasy", "Paranormal", "2,404 users", "Science Fiction", "Steampunk", "2,329 users", "Romance", "2,052 users"]
}, {
    "book_description": ["Six days ago, astronaut Mark Watney became one of the first people to walk on Mars. ", "Now, he’s sure he’ll be the first person to die there.", "After a dust storm nearly kills him and forces his crew to evacuate while thinking him dead, Mark finds himself stranded and completely alone with no way to even signal Earth that he’s alive — and even if he could get word out, his supplies would be gone long before a rescue could arrive. ", "Chances are, though, he won’t have time to starve to death. The damaged machinery, unforgiving environment, or plain-old “human error” are much more likely to kill him first. ", "But Mark isn’t ready to give up yet. Drawing on his ingenuity, his engineering skills — and a relentless, dogged refusal to quit — he steadfastly confronts one seemingly insurmountable obstacle after the next. Will his resourcefulness be enough to overcome the impossible odds against him?"],
    "info": {
        "ISBN": "(ISBN13: 9780804139021)",
        "Series": "The Martian #1",
        "setting": ["Mars", "Houston, Texas"],
        "Original Title": "The Martian",
        "Characters": ["Mark Watney", "Venkat Kapoor", "Melissa Lewis", "Rick Martinez", "Beth Johanssen", "...more", "Alex Vogel", "Teddy Sanders", "Mindy Park", "Annie Montrose", "Bruce Ng", "Mitch Henderson", "Chris Beck", "Rich Purnell", "Brendan Hutch", "...less"],
        "Edition Language": "English",
        "Literary Awards": ["John W. Campbell Memorial Award Nominee for Best Novel (2015)", "Audie Award for Science Fiction (2015)", "ALA Alex Award (2015)", "本屋大賞 Nominee for Translated Fiction (2015)", "Goodreads Choice Award for Science Fiction & Nominee for Debut Goodreads Author (2014)", "...more", "Green Mountain Book Award Nominee (2016)", "Seiun Award 星雲賞 for Best Foreign Novel (2015)", "...less"]
    },
    "book_format_type": "Hardcover",
    "book_cover_url": "https://images.gr-assets.com/books/1413706054l/18007564.jpg",
    "author": "Andy Weir",
    "title": "\n      The Martian\n      ",
    "number_of_pages": "369 pages",
    "publish_info": "\n            Published\n        February 11th 2014\n         by Crown\n\n            ",
    "genres_info": ["Science Fiction", "7,831 users", "Adventure", "1,099 users", "Audiobook", "968 users"]
}, {
    "book_description": ["On a warm summer morning in North Carthage, Missouri, it is Nick and Amy Dunne’s fifth wedding anniversary. Presents are being wrapped and reservations are being made when Nick’s clever and beautiful wife disappears. Husband-of-the-Year Nick isn’t doing himself any favors with cringe-worthy daydreams about the slope and shape of his wife’s head, but passages from Amy's diary reveal the alpha-girl perfectionist could have put anyone dangerously on edge", " Under mounting pressure from the police and the media—as well as Amy’s fiercely doting parents—the town golden boy parades an endless series of lies, deceits, and inappropriate behavior. Nick is oddly evasive, and he’s definitely bitter—but is he really a killer? "],
    "info": {
        "ISBN": "(ISBN13: 9780307588371)",
        "setting": ["North Carthage, Missouri", "Missouri"],
        "Original Title": "Gone Girl",
        "Characters": ["Nick Dunne", "Amy Elliot Dunne", "Margo \"Go\" Dunne", "Rand Elliot", "Marybeth Elliot"],
        "Edition Language": "English",
        "Literary Awards": ["Barry Award Nominee for Best Novel (2013)", "Anthony Award Nominee for Best Novel (2013)", "Romantic Times Reviewers' Choice Award (RT Award) for Suspense/Thriller Novel (2012)", "Shirley Jackson Award Nominee for Novel (Finalist) (2012)", "Edgar Award Nominee for Best Novel (2013)", "...more", "Puddly Award for Fiction (2013)", "Women's Prize for Fiction Nominee for Longlist (2013)", "Grand Prix des lectrices de Elle for roman policier (2013)", "Goodreads Choice Award for Best Mystery & Thriller (2012)", "...less"]
    },
    "book_format_type": "Paperback",
    "book_cover_url": "https://images.gr-assets.com/books/1397056917l/19288043.jpg",
    "author": "Gillian Flynn",
    "title": "\n      Gone Girl\n",
    "number_of_pages": "415 pages",
    "publish_info": "\n            Published\n        April 22nd 2014\n         by Broadway Books\n\n            ",
    "genres_info": ["Mystery", "8,273 users", "Mystery", "Crime", "2,126 users", "Fiction", "1,753 users", "Contemporary", "1,631 users", "Thriller", "1,283 users"]
}, {
    "book_description": ["On a May afternoon in 1943, an Army Air Forces bomber crashed into the Pacific Ocean and disappeared, leaving only a spray of debris and a slick of oil, gasoline, and blood. Then, on the ocean surface, a face appeared. It was that of a young lieutenant, the plane’s bombardier, who was struggling to a life raft and pulling himself aboard. So began one of the most extraordinary odysseys of the Second World War.", "The lieutenant’s name was Louis Zamperini. In boyhood, he’d been a cunning and incorrigible delinquent, breaking into houses, brawling, and fleeing his home to ride the rails. As a teenager, he had channeled his defiance into running, discovering a prodigious talent that had carried him to the Berlin Olympics and within sight of the four-minute mile. But when war had come, the athlete had become an airman, embarking on a journey that led to his doomed flight, a tiny raft, and a drift into the unknown.", "Ahead of Zamperini lay thousands of miles of open ocean, leaping sharks, a foundering raft, thirst and starvation, enemy aircraft, and, beyond, a trial even greater. Driven to the limits of endurance, Zamperini would answer desperation with ingenuity; suffering with hope, resolve, and humor; brutality with rebellion. His fate, whether triumph or tragedy, would be suspended on the fraying wire of his will.", "In her long-awaited new book, Laura Hillenbrand writes with the same rich and vivid narrative voice she displayed in ", ". Telling an unforgettable story of a man’s journey into extremity, ", " is a testament to the resilience of the human mind, body, and spirit."],
    "info": {
        "Edition Language": "English",
        "ISBN": "(ISBN13: 9781400064168)",
        "Original Title": "Unbroken: A World War II Story of Survival, Resilience, and Redemption",
        "Characters": ["Louie Zamperini", "Russell Allen Phillips"],
        "Literary Awards": ["Los Angeles Times Book Prize for Biography (2010)", "Pennsylvania Young Readers' Choice Award Nominee for Young Adults (2014)", "Indies Choice Book Award for Nonfiction (2011)", "Dayton Literary Peace Prize Nominee for NonFiction (2011)", "Lincoln Award Nominee (2015)", "...more", "Goodreads Choice Award Nominee for History and Biography (2010)", "...less"]
    },
    "book_format_type": "Hardcover",
    "book_cover_url": "https://images.gr-assets.com/books/1327861115l/8664353.jpg",
    "author": "Laura Hillenbrand",
    "title": "\n      Unbroken: A World War II Story of Survival, Resilience, and Redemption\n",
    "number_of_pages": "473 pages",
    "publish_info": "\n            Published\n        November 16th 2010\n         by Random House\n\n      ",
    "genres_info": ["Nonfiction", "5,485 users", "History", "3,242 users", "Biography", "2,973 users", "War", "867 users", "War", "World War II", "820 users"]
}, {
    "book_description": ["Katniss Everdeen, girl on fire, has survived, even though her home has been destroyed. Gale has escaped. Katniss's family is safe. Peeta has been captured by the Capitol. District 13 really does exist. There are rebels. There are new leaders. A revolution is unfolding.", "It is by design that Katniss was rescued from the arena in the cruel and haunting Quarter Quell, and it is by design that she has long been part of the revolution without knowing it. District 13 has come out of the shadows and is plotting to overthrow the Capitol. Everyone, it seems, has had a hand in the carefully laid plans--except Katniss.", "The success of the rebellion hinges on Katniss's willingness to be a pawn, to accept responsibility for countless lives, and to change the course of the future of Panem. To do this, she must put aside her feelings of anger and distrust. She must become the rebels' Mockingjay--no matter what the personal cost."],
    "info": {
        "ISBN": "(ISBN13: 9780439023511)",
        "Series": "The Hunger Games #3",
        "setting": ["District 13, Panem", "District 12, Panem", "Capitol, Panem", "…more", "Panem", "…less"],
        "Original Title": "Mockingjay",
        "Characters": ["Katniss Everdeen", "Peeta Mellark", "Primrose Everdeen", "Gale Hawthorne", "Haymitch Abernathy", "...more", "Finnick Odair", "Johanna Mason", "President Coriolanus Snow", "President Coin", "...less"],
        "Edition Language": "English",
        "Literary Awards": ["Locus Award Nominee for Best Young Adult Book (2011)", "Children's Choice Book Award Nominee for Teen Choice Book of the Year (2011)", "Publishers Weekly's Best Children's Books of the Year for Fiction (2010)", "Andre Norton Award Nominee for Young Adult Science Fiction and Fantasy (2010)", "DABWAHA Romance Tournament for Best Young Adult Romance (2011)", "...more", "Goodreads Choice Award for Favorite Book, Young Adult Fantasy, Favorite Heroine, and Favorite Hero (2010)", "...less"]
    },
    "book_format_type": "Hardcover",
    "book_cover_url": "https://images.gr-assets.com/books/1358275419l/7260188.jpg",
    "author": "Suzanne Collins",
    "title": "\n      Mockingjay\n      ",
    "number_of_pages": "392 pages",
    "publish_info": ", ",
    "genres_info": ["Young Adult", "20,885 users", "Science Fiction", "Dystopia", "11,045 users", "Fiction", "10,169 users", "Fantasy", "7,999 users", "Science Fiction", "6,467 users"]
}, {
    "book_description": ["Paperback features over fifty pages of bonus materials, including a sneak peek of Insurgent, an author Q&A, a discussion guide, a ", " playlist, faction manifestos, and more!", "In Beatrice Prior's dystopian Chicago world, society is divided into five factions, each dedicated to the cultivation of a particular virtue—Candor (the honest), Abnegation (the selfless), Dauntless (the brave), Amity (the peaceful), and Erudite (the intelligent). On an appointed day of every year, all sixteen-year-olds must select the faction to which they will devote the rest of their lives. For Beatrice, the decision is between staying with her family and being who she really is—she can't have both. So she makes a choice that surprises everyone, including herself.", "During the highly competitive initiation that follows, Beatrice renames herself Tris and struggles alongside her fellow initiates to live out the choice they have made. Together they must undergo extreme physical tests of endurance and intense psychological simulations, some with devastating consequences. As initiation transforms them all, Tris must determine who her friends really are—and where, exactly, a romance with a sometimes fascinating, sometimes exasperating boy fits into the life she's chosen. But Tris also has a secret, one she's kept hidden from everyone because she's been warned it can mean death. And as she discovers unrest and growing conflict that threaten to unravel her seemingly perfect society, she also learns that her secret might help her save those she loves . . . or it might destroy her.", "Veronica Roth is the ", " bestselling author of ", ", the first in a trilogy of dystopian thrillers filled with electrifying decisions, heartbreaking betrayals, stunning consequences, and unexpected romance."],
    "info": {
        "ISBN": "(ISBN13: 9780062024039)",
        "Series": "Divergent #1",
        "setting": ["Chicago, Illinois"],
        "Original Title": "Divergent",
        "Characters": ["Albert", "Drew Leighton (Divergent)", "Eric (Divergent)", "Beatrice Prior", "Peter", "...more", "Caleb Prior", "Natalie Prior", "Molly Atwood", "Christina", "Jeanine Matthews", "Marcus Eaton", "翠丝", "老四", "Tobias Eaton", "...less"],
        "Edition Language": "English",
        "Literary Awards": ["Georgia Peach Book Award (2012)", "Evergreen Teen Book Award (2014)", "Soaring Eagle Book Award (2012)", "Milwaukee County Teen Book Award Nominee (2012)", "Children's Choice Book Award Nominee for Teen Choice Book of the Year (2012)", "...more", "Sakura Medal", "New Mexico Land of Enchantment Award for Young Adult (2014)", "Lincoln Award Nominee (2014)", "DABWAHA Romance Tournament for Best Young Adult Romance (2012)", "Goodreads Choice Award for Favorite Book and Best Young Adult Fantasy & Science Fiction (2011)", "Green Mountain Book Award (2013)", "The Magnolia Award for 6-8 (2014)", "Louisiana Teen Readers' Choice (2014)", "Missouri Gateway Readers Award (2014)", "Oklahoma Sequoyah Award for High Schol (2014)", "Premio El Templo de las Mil Puertas Nominee for Mejor novela extranjera perteneciente a saga (2011)", "...less"]
    },
    "book_format_type": "Paperback",
    "book_cover_url": "https://images.gr-assets.com/books/1328559506l/13335037.jpg",
    "author": "Veronica Roth",
    "title": "\n      Divergent\n      ",
    "number_of_pages": "487 pages",
    "publish_info": "\n            Published\n        February 28th 2012\n         by Katherine Tegen Books\n\n            ",
    "genres_info": ["Young Adult", "17,924 users", "Science Fiction", "Dystopia", "12,109 users", "Fiction", "5,622 users", "Fantasy", "5,118 users", "Science Fiction", "4,893 users"]
}, {
    "book_description": ["\"I fell in love the way you fall asleep: slowly, then all at once.\"", "Despite the tumor-shrinking medical miracle that has bought her a few years, Hazel has never been anything but terminal, her final chapter inscribed upon diagnosis. But when a gorgeous plot twist named Augustus Waters suddenly appears at Cancer Kid Support Group, Hazel's story is about to be completely rewritten.", "Insightful, bold, irreverent, and raw, The Fault in Our Stars is award-winning author John Green's most ambitious and heartbreaking work yet, brilliantly exploring the funny, thrilling, and tragic business of being alive and in love."],
    "info": {
        "ISBN": "(ISBN13: 9780525478812)",
        "setting": ["Indianapolis, Indiana", "Amsterdam"],
        "Original Title": "The Fault in Our Stars",
        "Characters": ["Hazel Grace Lancaster", "Augustus Waters", "Isaac"],
        "Edition Language": "English",
        "Literary Awards": ["Georgia Peach Book Award (2013)", "Buxtehuder Bulle (2012)", "Odyssey Award (2013)", "Audie Award for Teens (2013)", "West Australian Young Readers' Book Award (WAYRBA) for Older Readers (2013)", "...more", "Pennsylvania Young Readers' Choice Award for Young Adults (2013)", "Evergreen Teen Book Award (2015)", "Soaring Eagle Book Award (2014)", "Milwaukee County Teen Book Award (2013)", "Indies Choice Book Award for Young Adult (2013)", "Deutscher Jugendliteraturpreis for Preis der Jugendjury (2013)", "Amelia Elizabeth Walden Award (ALAN/NCTE) (2013)", "Dioraphte Jongerenliteratuurprijs for vertaald boek en publieksprijs (2013)", "The Inky Awards for Silver Inky (2012)", "Lincoln Award (2014)", "Luisterboek Award (2015)", "Goodreads Choice Award for Best Young Adult Fiction (2012)", "Green Mountain Book Award (2014)", "The Inky Awards Shortlist for Silver Inky (2012)", "Louisiana Teen Readers' Choice (2015)", "Missouri Gateway Readers Award (2015)", "Oklahoma Sequoyah Award for High School (2015)", "Alabama Author Award - Young Adult (2013)", "Premio El Templo de las Mil Puertas for Mejor novela extranjera independiente (2012)", "FAB Award Nominee (2014)", "...less"]
    },
    "book_format_type": "Hardcover",
    "book_cover_url": "https://images.gr-assets.com/books/1360206420l/11870085.jpg",
    "author": "John Green",
    "title": "\n      The Fault in Our Stars\n",
    "number_of_pages": "313 pages",
    "publish_info": "\n            Published\n        January 10th 2012\n         by Dutton Books\n\n      ",
    "genres_info": ["Young Adult", "17,093 users", "Fiction", "8,027 users", "Romance", "7,804 users", "Contemporary", "5,166 users", "Realistic Fiction", "2,232 users", "Young Adult", "Teen", "1,171 users", "Young Adult", "Coming Of Age", "856 users", "Death", "849 users", "Drama", "774 users", "Love", "760 users"]
}, {
    "book_description": ["The faction-based society that Tris Prior once believed in is shattered - fractured by violence and power struggles and scarred by loss and betrayal. So when offered a chance to explore the world past the limits she's known, Tris is ready. Perhaps beyond the fence, she and Tobias will find a simple new life together, free from complicated lies, tangled loyalties, and painful memories.", "But Tris's new reality is even more alarming than the one she left behind. Old discoveries are quickly rendered meaningliess. Explosive new truths change the hearts of those she loves. And once again, Tris must battle to comprehend to complexities of human nature - and of herself - while facing impossible choices about courage, allegiance, sacrifice, and love.", "Told from a riveting dual perspective, ALLEGIANT, by #1 ", " best-selling author Veronica Roth, brings the DIVERGENT series to a powerful conclusion while revealing the secrets of the dystopian world that has captivated millions of readers in DIVERGENT and INSURGENT."],
    "info": {
        "ISBN": "(ISBN13: 9780007524273)",
        "Series": "Divergent #3",
        "setting": ["Chicago, Illinois"],
        "Original Title": "Allegiant",
        "Characters": ["Beatrice Prior", "Peter", "Caleb Prior", "Christina", "Marcus Eaton", "...more", "Tobias Eaton", "...less"],
        "Edition Language": "English",
        "Literary Awards": ["Goodreads Choice Award for Best Young Adult Fantasy & Science Fiction (2013)"]
    },
    "book_format_type": "Hardcover",
    "book_cover_url": "https://images.gr-assets.com/books/1395582745l/18710190.jpg",
    "author": "Veronica Roth",
    "title": "\n      Allegiant\n      ",
    "number_of_pages": "526 pages",
    "publish_info": ", ",
    "genres_info": ["Young Adult", "9,335 users", "Science Fiction", "Dystopia", "6,949 users", "Fiction", "2,844 users", "Science Fiction", "2,384 users", "Fantasy", "2,167 users", "Romance", "1,904 users", "Adventure", "662 users", "Young Adult", "Teen", "563 users", "Apocalyptic", "Post Apocalyptic", "427 users", "Action", "402 users"]
}, {
    "book_description": ["You are about to travel to Edgecombe St. Mary, a small village in the English countryside filled with rolling hills, thatched cottages, and a cast of characters both hilariously original and as familiar as the members of your own family. Among them is Major Ernest Pettigrew (retired), the unlikely hero of Helen Simonson's wondrous debut. Wry, courtly, opinionated, and completely endearing, Major Pettigrew is one of the most indelible characters in contemporary fiction, and from the very first page of this remarkable novel he will steal your heart.", "The Major leads a quiet life valuing the proper things that Englishmen have lived by for generations: honor, duty, decorum, and a properly brewed cup of tea. But then his brother's death sparks an unexpected friendship with Mrs. Jasmina Ali, the Pakistani shopkeeper from the village. Drawn together by their shared love of literature and the loss of their respective spouses, the Major and Mrs. Ali soon find their friendship blossoming into something more. But village society insists on embracing him as the quintessential local and her as the permanent foreigner. Can their relationship survive the risks one takes when pursuing happiness in the face of culture and tradition?"],
    "info": {
        "Edition Language": "English",
        "ISBN": "(ISBN13: 9781400068937)",
        "Original Title": "Major Pettigrew's Last Stand",
        "Literary Awards": ["Goodreads Choice Award Nominee for Fiction, Debut Author  (2010)"]
    },
    "book_format_type": "Hardcover",
    "book_cover_url": "https://images.gr-assets.com/books/1320539020l/6643090.jpg",
    "author": "Helen Simonson",
    "title": "\n      Major Pettigrew's Last Stand\n",
    "number_of_pages": "359 pages",
    "publish_info": "\n            Published\n        March 2nd 2010\n         by Random House\n\n            ",
    "genres_info": ["Fiction", "1,826 users", "Romance", "446 users", "Contemporary", "218 users", "European Literature", "British Literature", "201 users", "Book Club", "175 users"]
}, {
    "book_description": ["The time is 1933, the place, Berlin, when William E. Dodd becomes America's first ambassador to Hitler's Germany in a year that proved to be a turning point in history."],
    "info": {
        "Edition Language": "English",
        "setting": ["Berlin"],
        "ISBN": "(ISBN13: 9780307408846)",
        "Original Title": "In the Garden of Beasts: Love, Terror, and an American Family in Hitler's Berlin",
        "Literary Awards": ["Washington State Book Award for History/General Nonfiction (2012)", "Chautauqua Prize Nominee (2012)"]
    },
    "book_format_type": "Hardcover",
    "book_cover_url": "https://images.gr-assets.com/books/1327864303l/9938498.jpg",
    "author": "Erik Larson",
    "title": "\n      In the Garden of Beasts: Love, Terror, and an American Family in Hitler's Berlin\n",
    "number_of_pages": "448 pages",
    "publish_info": "\n            Published\n        May 10th 2011\n         by Crown\n\n      ",
    "genres_info": ["History", "1,096 users", "Nonfiction", "1,048 users", "War", "World War II", "182 users"]
}, {
    "book_description": ["How many lives do you need to live before you find someone worth dying for?", "In the aftermath of what happened at Sword & Cross, Luce has been hidden away by her cursed angelic boyfriend, Daniel, in a new school filled with Nephilim, the offspring of fallen angels and humans. Daniel promises she will be safe here, protected from those who would kill her. At the school Luce discovers what the Shadows that have followed her all her life mean – and how to manipulate them to see into her other lives. Yet the more Luce learns about herself, the more she realizes that the past is her only key to unlocking her future . . . and that Daniel hasn't told her everything. What if his version of the past isn't actually the way things happened . . . what if Luce was really meant to be with someone else?", "The second novel in the addictive FALLEN series...where love never dies."],
    "info": {
        "ISBN": "(ISBN13: 9780385739146)",
        "Series": "Fallen #2",
        "setting": ["California", "Georgia"],
        "Original Title": "Torment",
        "Characters": ["Lucinda Price", "Daniel Grigori", "Arriane Alter", "Cameron Briel", "Shelby Sterris", "...more", "Miles Fisher", "Mary Margaret  Zane", "Roland Sparks", "Gabrielle Givens", "Dawn Casterly", "Lillith Clout", "...less"],
        "Edition Language": "English"
    },
    "book_format_type": "Hardcover",
    "book_cover_url": "https://images.gr-assets.com/books/1362339749l/7740152.jpg",
    "author": "Lauren Kate",
    "title": "\n      Torment\n      ",
    "number_of_pages": "452 pages",
    "publish_info": ", ",
    "genres_info": ["Young Adult", "2,008 users", "Paranormal", "Angels", "1,517 users", "Fantasy", "1,493 users", "Fantasy", "Paranormal", "1,137 users", "Romance", "1,018 users", "Romance", "Paranormal Romance", "452 users", "Fantasy", "Supernatural", "365 users", "Fiction", "248 users", "Fantasy", "Urban Fantasy", "181 users", "Young Adult", "Teen", "161 users"]
}, {
    "book_description": ["Winter of the World picks up right where the first book left off, as its five interrelated families—American, German, Russian, English, Welsh—enter a time of enormous social, political, and economic turmoil, beginning with the rise of the Third Reich, through the Spanish Civil War and the great dramas of World War II, up to the explosions of the American and Soviet atomic bombs."],
    "info": {
        "ISBN": "(ISBN13: 9780525952923)",
        "Series": "The Century Trilogy #2",
        "setting": ["Berlin", "London, England", "Moscow", "…more", "Washington, D.C.", "…less"],
        "Literary Awards": ["Goodreads Choice Award Nominee for Best Historical Fiction (2012)"],
        "Edition Language": "English",
        "Original Title": "Winter of the World"
    },
    "book_format_type": "Hardcover",
    "book_cover_url": "https://images.gr-assets.com/books/1369453743l/12959233.jpg",
    "author": "Ken Follett",
    "title": "\n      Winter of the World\n      ",
    "number_of_pages": "960 pages",
    "publish_info": "\n            Published\n        September 18th 2012\n         by Berkley\n\n      ",
    "genres_info": ["Historical", "2,021 users", "Fiction", "724 users", "War", "103 users", "War", "World War II", "80 users", "Novels", "58 users", "Adult", "48 users", "European Literature", "British Literature", "37 users", "Cultural", "Russia", "36 users", "Epic", "35 users", "Politics", "27 users"]
}, {
    "book_description": ["At Westish College, a small school on the shore of Lake Michigan, baseball star Henry Skrimshander seems destined for big league stardom. But when a routine throw goes disastrously off course, the fates of five people are upended.", "Henry’s fight against self-doubt threatens to ruin his future. College president Guert Affenlight, a longtime bachelor, has fallen unexpectedly and helplessly in love. Owen Dunne, Henry’s gay roommate and teammate, becomes caught up in a dangerous affair. Mike Schwartz, the Harpooners’ team captain and Henry's best friend, realizes he has guided Henry’s career at the expense of his own. And Pella Affenlight, Guert’s daughter, returns to Westish after escaping an ill-fated marriage, determined to start a new life.", "As the season counts down to its climactic final game, these five are forced to confront their deepest hopes, anxieties, and secrets. In the process they forge new bonds, and help one another find their true paths. Written with boundless intelligence and filled with the tenderness of youth, ", " is an expansive, warmhearted novel about ambition and its limits, about family and friendship and love, and about commitment—to oneself and to others."],
    "info": {
        "ISBN": "(ISBN13: 9780316126694)",
        "setting": ["Westish, Wisconsin", "Wisconsin"],
        "Original Title": "The Art of Fielding",
        "Characters": ["Henry Skrimshander", "Mike Schwartz", "Owen Dunne", "Guert Affenlight", "Pella Affenlight"],
        "Edition Language": "English",
        "Literary Awards": ["Guardian First Book Award Nominee (2012)", "PEN/Hemingway Foundation Award Nominee (2012)", "Library of Virginia Literary Award Nominee for Fiction (finalist) (2012)", "Los Angeles Times Book Prize Nominee for Art Seidenbaum Award for First Fiction (0)", "Bottari Lattes Grinzane Nominee", "...more", "Wisconsin Library Association Book of the Year", "Friends of American Writers Book of the Year", "Midwest Booksellers Choice Award", "...less"]
    },
    "book_format_type": "Hardcover",
    "book_cover_url": "https://images.gr-assets.com/books/1327882787l/10996342.jpg",
    "author": "Chad Harbach",
    "title": "\n      The Art of Fielding\n",
    "number_of_pages": "512 pages",
    "publish_info": "\n            Published\n        September 7th 2011\n         by Little, Brown and Company\n\n      ",
    "genres_info": ["Fiction", "1,813 users", "Sports and Games", "Sports", "439 users", "Sports", "Baseball", "351 users", "Contemporary", "181 users"]
}, {
    "book_description": ["As Dr. Marina Singh embarks upon an uncertain odyssey into the insect-infested Amazon, she will be forced to surrender herself to the lush but forbidding world that awaits within the jungle. Charged with finding her former mentor Dr. Annick Swenson, a researcher who has disappeared while working on a valuable new drug, she will have to confront her own memories of tragedy and sacrifice as she journeys into the unforgiving heart of darkness."],
    "info": {
        "ISBN": "(ISBN13: 9780062049803)",
        "setting": ["Amazon Rainforest", "Minneapolis-St. Paul, Minnesota"],
        "Original Title": "State of Wonder",
        "Characters": ["Dr. Marina Singh", "Dr. Annick Swenson", "Dr. Anders Eckman"],
        "Edition Language": "English",
        "Literary Awards": ["Orange Prize Nominee for Fiction Shortlist (2012)", "Audie Award for Literary Fiction (2012)", "Wellcome Book Prize Nominee for Shortlist (2011)"]
    },
    "book_format_type": "Hardcover",
    "book_cover_url": "https://images.gr-assets.com/books/1454428541l/9118135.jpg",
    "author": "Ann Patchett",
    "title": "\n      State of Wonder\n",
    "number_of_pages": "353 pages",
    "publish_info": "\n            Published\n        June 7th 2011\n         by HarperCollins Publishers\n\n            ",
    "genres_info": ["Fiction", "2,333 users", "Book Club", "223 users", "Contemporary", "222 users", "Adult Fiction", "185 users", "Literary Fiction", "174 users", "Adult", "146 users", "Novels", "143 users", "Mystery", "138 users", "Adventure", "126 users", "Audiobook", "122 users"]
}, {
    "book_description": ["Everyone Celaena Sardothien loves has been taken from her. But she’s at last returned to the empire—for vengeance, to rescue her once-glorious kingdom, and to confront the shadows of her past…", "She has embraced her identity as Aelin Galathynius, Queen of Terrasen. But before she can reclaim her throne, she must fight.", "She will fight for her cousin, a warrior prepared to die for her. She will fight for her friend, a young man trapped in an unspeakable prison. And she will fight for her people, enslaved to a brutal king and awaiting their lost queen’s triumphant return.", "The fourth volume in the ", " bestselling series continues Celaena’s epic journey and builds to a passionate, agonizing crescendo that might just shatter her world."],
    "info": {
        "ISBN": "(ISBN13: 9781619636040)",
        "Series": "Throne of Glass #4",
        "Literary Awards": ["Goodreads Choice Award for Young Adult Fantasy & Science Fiction (2015)"],
        "Characters": ["Celaena Sardothien", "Chaol Westfall", "Rowan Whitethorn", "Dorian Havilliard", "Aedion Ashryver", "...more", "Aelin Ashryver Galathynius", "...less"],
        "Edition Language": "English",
        "Original Title": "Queen of Shadows"
    },
    "book_format_type": "Hardcover",
    "book_cover_url": "https://images.gr-assets.com/books/1441230104l/18006496.jpg",
    "author": "Sarah J. Maas",
    "title": "\n      Queen of Shadows\n      ",
    "number_of_pages": "648 pages",
    "publish_info": "\n            Published\n        September 1st 2015\n         by Bloomsbury USA Childrens\n\n      ",
    "genres_info": ["Fantasy", "5,014 users", "Young Adult", "2,068 users", "Romance", "826 users", "Fantasy", "Magic", "708 users"]
}, {
    "book_description": [" ", "First, the unthinkable: a security breach at a secret U.S. government facility unleashes the monstrous product of a chilling military experiment. Then, the unspeakable: a night of chaos and carnage gives way to sunrise on a nation, and ultimately a world, forever altered. All that remains for the stunned survivors is the long fight ahead and a future ruled by fear—of darkness, of death, of a fate far worse.", "As civilization swiftly crumbles into a primal landscape of predators and prey, two people flee in search of sanctuary. FBI agent Brad Wolgast is a good man haunted by what he’s done in the line of duty. Six-year-old orphan Amy Harper Bellafonte is a refugee from the doomed scientific project that has triggered apocalypse. He is determined to protect her from the horror set loose by her captors. But for Amy, escaping the bloody fallout is only the beginning of a much longer odyssey—spanning miles and decades—towards the time and place where she must finish what should never have begun.", "With ", ", award-winning author Justin Cronin has written both a relentlessly suspenseful adventure and an epic chronicle of human endurance in the face of unprecedented catastrophe and unimaginable danger. Its inventive storytelling, masterful prose, and depth of human insight mark it as a crucial and transcendent work of modern fiction.' to '", "-- book jacket"],
    "info": {
        "ISBN": "(ISBN13: 9780345504968)",
        "Series": "The Passage #1",
        "setting": ["Telluride, Colorado", "Las Vegas, Nevada", "Roswell, New Mexico", "…more", "Nevada", "…less"],
        "Original Title": "The Passage",
        "Characters": ["Jonas Abbott Lear", "Brad Wolgast", "Lacey Antoinette Kudoto", "Phil Doyle", "Giles Babcock", "...more", "Olson Hand", "Theo Jaxon", "Ida Jaxon", "Sara Fisher", "Mausami Patal", "Caleb \"Hightop\" Jones", "Amy Harper Bellafonte", "Peter Jaxon", "Anthony Lloyd Carter", "Michael \"The Circuit\" Fisher", "Hollis Wilson", "Alicia Donadio", "...less"],
        "Edition Language": "English",
        "Literary Awards": ["Goodreads Choice Award Nominee for Favorite Book, Science Fiction (2010)"]
    },
    "book_format_type": "Hardcover",
    "book_cover_url": "https://images.gr-assets.com/books/1327874267l/6690798.jpg",
    "author": "Justin Cronin",
    "title": "\n      The Passage\n      ",
    "number_of_pages": "766 pages",
    "publish_info": ", ",
    "genres_info": ["Horror", "193 users", "Audiobook", "183 users", "Science Fiction", "163 users", "Fiction", "154 users"]
}, {
    "book_description": [" ", "Seventeen-year-old Amy joins her parents as frozen cargo aboard the vast spaceship Godspeed and expects to awaken on a new planet, three hundred years in the future. Never could she have known that her frozen slumber would come to an end fifty years too soon and that she would be thrust into the brave new world of a spaceship that lives by its own rules.", "Amy quickly realizes that her awakening was no mere computer malfunction. Someone—one of the few thousand inhabitants of the spaceship —tried to kill her. And if Amy doesn't do something soon, her parents will be next.", "Now Amy must race to unlock Godspeed's hidden secrets. But out of her list of murder suspects, there's only one who matters: Elder, the future leader of the ship and the love she could never have seen coming."],
    "info": {
        "ISBN": "(ISBN13: 9781595143976)",
        "Series": "Across the Universe #1",
        "setting": ["Godspeed", "United States", "Earth", "…more", "Outer Space", "…less"],
        "Original Title": "Across the Universe",
        "Characters": ["Harley", "\"Doc\" Bradley Stanwick", "Orion", "Amy Martin", "Elder", "...more", "Eldest", "...less"],
        "Edition Language": "English",
        "Literary Awards": ["Lincoln Award Nominee (2014)", "Goodreads Choice Award Nominee for Best Young Adult Fantasy & Science Fiction (2011)", "Carnegie Medal Nominee (2012)"]
    },
    "book_format_type": "Hardcover",
    "book_cover_url": "https://images.gr-assets.com/books/1401852218l/8235178.jpg",
    "author": "Beth Revis",
    "title": "\n      Across the Universe\n      ",
    "number_of_pages": "399 pages",
    "publish_info": "\n            Published\n        January 11th 2011\n         by Razorbill\n\n      ",
    "genres_info": ["Young Adult", "2,918 users", "Science Fiction", "2,143 users", "Science Fiction", "Dystopia", "1,432 users", "Romance", "1,095 users"]
}, {
    "book_description": ["Patty and Walter Berglund were the new pioneers of old St. Paul—the gentrifiers, the hands-on parents, the avant-garde of the Whole Foods generation. Patty was the ideal sort of neighbor, who could tell you where to recycle your batteries and how to get the local cops to actually do their job. She was an enviably perfect mother and the wife of Walter's dreams. Together with Walter—environmental lawyer, commuter cyclist, total family man—she was doing her small part to build a better world.", "But now, in the new millennium, the Berglunds have become a mystery. Why has their teenage son moved in with the aggressively Republican family next door? Why has Walter taken a job working with Big Coal? What exactly is Richard Katz—outré rocker and Walter's college best friend and rival—still doing in the picture? Most of all, what has happened to Patty? Why has the bright star of Barrier Street become \"a very different kind of neighbor,\" an implacable Fury coming unhinged before the street's attentive eyes?", "In his first novel since ", ", Jonathan Franzen has given us an epic of contemporary love and marriage. Freedom comically and tragically captures the temptations and burdens of liberty: the thrills of teenage lust, the shaken compromises of middle age, the wages of suburban sprawl, the heavy weight of empire. In charting the mistakes and joys of Freedom's characters as they struggle to learn how to live in an ever more confusing world, Franzen has produced an indelible and deeply moving portrait of our time."],
    "info": {
        "Edition Language": "English",
        "ISBN": "(ISBN13: 9780374158460)",
        "Original Title": "Freedom",
        "Characters": ["Walter Berglund", "Patty Berglund", "Joey Berglund", "Jessica Berglund", "Richard Katz"],
        "Literary Awards": ["Warwick Prize for Writing Nominee for Longlist (2013)", "Los Angeles Times Book Prize Nominee for Fiction (2010)", "Chicago Tribune Heartland Prize for Fiction (2011)", "National Book Critics Circle Award Nominee for Fiction (2011)", "Bad Sex in Fiction Award Nominee (2010)", "...more", "John Gardner Book Award for Fiction (2011)", "Goodreads Choice Award Nominee for Favorite Book, Fiction (2010)", "...less"]
    },
    "book_format_type": "Hardcover",
    "book_cover_url": "https://images.gr-assets.com/books/1316729686l/7905092.jpg",
    "author": "Jonathan Franzen",
    "title": "\n      Freedom\n",
    "number_of_pages": "562 pages",
    "publish_info": "\n            Published\n        August 31st 2010\n         by Farrar, Straus and Giroux\n\n            ",
    "genres_info": ["Fiction", "2,564 users", "Contemporary", "293 users", "Novels", "232 users"]
}, {
    "book_description": ["When the Taliban took control of the Swat Valley in Pakistan, one girl spoke out. Malala Yousafzai refused to be silenced and fought for her right to an education.", "On Tuesday, October 9, 2012, when she was fifteen, she almost paid the ultimate price. She was shot in the head at point-blank range while riding the bus home from school, and few expected her to survive. ", "Instead, Malala's miraculous recovery has taken her on an extraordinary journey from a remote valley in northern Pakistan to the halls of the United Nations in New York. At sixteen, she has become a global symbol of peaceful protest and the youngest-ever Nobel Peace Prize laureate.", " is the remarkable tale of a family uprooted by global terrorism, of the fight for girls' education, of a father who, himself a school owner, championed and encouraged his daughter to write and attend school, and of brave parents who have a fierce love for their daughter in a society that prizes sons."],
    "info": {
        "ISBN": "(ISBN13: 9780316322409)",
        "setting": ["Lembah Swat"],
        "Original Title": "I Am Malala: The Girl Who Stood Up for Education and Was Shot by the Taliban",
        "Characters": ["Malala Yousafzai"],
        "Edition Language": "English",
        "Literary Awards": ["Lincoln Award Nominee (2017)", "Goodreads Choice Award for Memoir & Autobiography (2013)"]
    },
    "book_format_type": "Hardcover",
    "book_cover_url": "https://images.gr-assets.com/books/1375414895l/17851885.jpg",
    "author": "Malala Yousafzai",
    "title": "\n      I Am Malala: The Story of the Girl Who Stood Up for Education and Was Shot by the Taliban\n",
    "number_of_pages": "327 pages",
    "publish_info": "\n            Published\n        October 8th 2013\n         by Little, Brown and Company\n\n            ",
    "genres_info": ["Nonfiction", "3,734 users", "Biography", "1,472 users", "Autobiography", "Memoir", "1,224 users", "Feminism", "703 users"]
}, {
    "book_description": [" is a bedtime book for parents who live in the real world, where a few snoozing kitties and cutesy rhymes don't always send a toddler sailing blissfully off to dreamland. Profane, affectionate, and radically honest, California Book Award-winning author Adam Mansbach's verses perfectly capture the familiar -- and unspoken -- tribulations of putting your little angel down for the night. In the process, he opens up a conversation about parenting, granting us permission to admit our frustrations and laugh at their absurdities."],
    "info": {
        "Edition Language": "English",
        "ISBN": "(ISBN13: 9781617750250)",
        "Original Title": "Go the Fuck to Sleep"
    },
    "book_format_type": "Hardcover",
    "book_cover_url": "https://images.gr-assets.com/books/1342861907l/11192642.jpg",
    "author": "Adam Mansbach",
    "title": "\n      Go the Fuck to Sleep\n",
    "number_of_pages": "32 pages",
    "publish_info": "\n            Published\n        June 14th 2011\n         by Akashic Books\n\n            ",
    "genres_info": ["Humor", "900 users", "Fiction", "312 users", "Childrens", "Picture Books", "212 users", "Humor", "Comedy", "166 users", "Childrens", "163 users", "Audiobook", "144 users", "Humor", "Funny", "144 users"]
}, {
    "book_description": [],
    "info": {
        "ISBN": "(ISBN13: 9780061978067)",
        "Series": "Delirium #2",
        "setting": ["New York City, New York"],
        "Original Title": "Pandemonium",
        "Characters": ["Magdalena \"Lena\" Ella Haloway-Tiddle", "Julian Fineman", "Tack", "Raven (Delirium)"],
        "Edition Language": "English",
        "Literary Awards": ["Goodreads Choice Award Nominee for Best Young Adult Fantasy & Science Fiction (2012)"]
    },
    "book_format_type": "Hardcover",
    "book_cover_url": "https://images.gr-assets.com/books/1310371414l/9593911.jpg",
    "author": "Lauren Oliver",
    "title": "\n      Pandemonium\n      ",
    "number_of_pages": "375 pages",
    "publish_info": "\n            Published\n        February 28th 2012\n         by HarperTeen\n\n      ",
    "genres_info": ["Science Fiction", "561 users", "Fantasy", "506 users", "Young Adult", "Teen", "175 users", "Adventure", "173 users", "Science Fiction", "Dystopia", "144 users", "Young Adult", "144 users", "Love", "119 users", "Audiobook", "111 users", "Apocalyptic", "Post Apocalyptic", "108 users", "Futuristic", "75 users"]
}, {
    "book_description": ["Nora Grey can't remember the past five months of her life. After the initial shock of waking up in a cemetery and being told that she has been missing for weeks - with no one knowing where she was or who she was with - she tried to get her life back on track. Go to school, hang out with her best friend, Vee, and dodge mom's creepy new boyfriend.", "But there is this voice in the back of her head, an idea that she can almost reach out and touch. Visions of angel wings and unearthly creatures that have nothing to do with the life she knows.", "And this unshakable feeling that a part of her is missing.", "Then Nora crosses paths with a sexy stranger, whom she feels a mesmerizing connection to. He seems to hold all the answers...and her heart. Every minute she spends with him grows more and more intense until she realizes she could be falling in love. Again."],
    "info": {
        "ISBN": "(ISBN13: 9781442426641)",
        "Series": "Hush, Hush #3",
        "setting": ["Coldwater, Maine"],
        "Original Title": "Silence ",
        "Characters": ["Nora Grey", "Patch Cipriano", "Vee Sky", "Marcie Millar", "Scott Parnell", "...more", "Hank Millar", "Blythe Gray", "Jev", "...less"],
        "Edition Language": "English"
    },
    "book_format_type": "Hardcover",
    "book_cover_url": "https://images.gr-assets.com/books/1362408152l/10637766.jpg",
    "author": "Becca Fitzpatrick",
    "title": "\n      Silence\n      ",
    "number_of_pages": "448 pages",
    "publish_info": "\n            Published\n        October 4th 2011\n         by Simon & Schuster Books for Young Readers\n\n      ",
    "genres_info": ["Young Adult", "1,836 users", "Fantasy", "Paranormal", "1,174 users", "Romance", "1,016 users", "Fantasy", "571 users", "Romance", "Paranormal Romance", "472 users", "Fantasy", "Supernatural", "307 users", "Paranormal", "Angels", "238 users", "Fiction", "214 users", "Fantasy", "Urban Fantasy", "186 users", "Mystery", "86 users"]
}, {
    "book_description": ["The sequel to Hilary Mantel's 2009 Man Booker Prize winner and New York Times bestseller, ", ", delves into the heart of Tudor history with the downfall of Anne Boleyn.", "Though he battled for seven years to marry her, Henry is disenchanted with Anne Boleyn. She has failed to give him a son and her sharp intelligence and audacious will alienate his old friends and the noble families of England. When the discarded Katherine dies in exile from the court, Anne stands starkly exposed, the focus of gossip and malice.", "At a word from Henry, Thomas Cromwell is ready to bring her down. Over three terrifying weeks, Anne is ensnared in a web of conspiracy, while the demure Jane Seymour stands waiting her turn for the poisoned wedding ring. But Anne and her powerful family will not yield without a ferocious struggle. Hilary Mantel's ", " follows the dramatic trial of the queen and her suitors for adultery and treason. To defeat the Boleyns, Cromwell must ally with his natural enemies, the papist aristocracy. What price will he pay for Anne's head? "],
    "info": {
        "ISBN": "(ISBN13: 9780805090031)",
        "Series": "Thomas Cromwell Trilogy #2",
        "setting": ["England"],
        "Original Title": "Bring Up the Bodies",
        "Characters": ["Anne Boleyn", "Katherine of Aragon", "Jane Seymour", "Thomas Howard", "Charles Brandon, 1st Duke of Suffolk", "...more", "Thomas Wyatt", "Thomas Cromwell", "Thomas Seymour", "Edward Seymour, Duke of Somerset", "Thomas Cranmer", "Rafe Sadler", "Stephen Gardiner", "Thomas Boleyn", "Henry VIII of England", "George Boleyn", "Jane Boleyn", "Richard Riche", "...less"],
        "Edition Language": "English",
        "Literary Awards": ["Man Booker Prize (2012)", "Costa Book Award for Novel (2012)", "Audie Award for Literary Fiction (2013)", "Women's Prize for Fiction Nominee (2013)", "Walter Scott Prize Nominee (2013)", "...more", "Waterstones Book of the Year Nominee (2012)", "Costa Book of the Year (2012)", "...less"]
    },
    "book_format_type": "Hardcover",
    "book_cover_url": "https://images.gr-assets.com/books/1330649655l/13507212.jpg",
    "author": "Hilary Mantel",
    "title": "\n      Bring Up the Bodies\n      ",
    "number_of_pages": "407 pages",
    "publish_info": ", ",
    "genres_info": ["Historical", "2,439 users", "Fiction", "1,161 users", "European Literature", "British Literature", "167 users"]
}, {
    "book_description": ["Criminal prodigy Kaz Brekker has been offered wealth beyond his wildest dreams. But to claim it, he'll have to pull off a seemingly impossible heist:", "Break into the notorious Ice Court", "(a military stronghold that has never been breached)", "Retrieve a hostage", "(who could unleash magical havoc on the world)", "Survive long enough to collect his reward", "(and spend it)", "Kaz needs a crew desperate enough to take on this suicide mission and dangerous enough to get the job done - and he knows exactly who: six of the deadliest outcasts the city has to offer. Together, they just might be unstoppable - if they don't kill each other first."],
    "info": {
        "ISBN": "(ISBN13: 9781627792127)",
        "Series": "Six of Crows #1",
        "setting": ["Ketterdam"],
        "Original Title": "Six of Crows",
        "Characters": ["Inej Ghafa", "Kaz Brekker", "Jesper Fahey", "Wylan Van Eck", "Matthias Helvar", "...more", "Nina Zenik", "...less"],
        "Edition Language": "English",
        "Literary Awards": ["Pennsylvania Young Readers' Choice Award Nominee for Young Adults (2017)", "Evergreen Teen Book Award Nominee (2018)", "Milwaukee County Teen Book Award Nominee (2017)", "Lincoln Award Nominee (2018)", "Goodreads Choice Award Nominee for Young Adult Fantasy & Science Fiction (2015)", "...more", "Missouri Gateway Readers Award Nominee (2017)", "Premio El Templo de las Mil Puertas for Mejor novela extranjera perteneciente a saga (2016)", "...less"]
    },
    "book_format_type": "Hardcover",
    "book_cover_url": "https://images.gr-assets.com/books/1500689111l/23437156.jpg",
    "author": "Leigh Bardugo",
    "title": "\n      Six of Crows\n      ",
    "number_of_pages": "462 pages",
    "publish_info": "\n            Published\n        September 29th 2015\n         by Henry Holt and Company\n\n      ",
    "genres_info": ["Fantasy", "7,038 users", "Young Adult", "3,393 users"]
}, {
    "book_description": ["Something has always felt slightly off in Meghan's life, ever since her father disappeared before her eyes when she was six. She has never quite fit in at school or at home.", "When a dark stranger begins watching her from afar, and her prankster best friend becomes strangely protective of her, Meghan senses that everything she's known is about to change.", "But she could never have guessed the truth - that she is the daughter of a mythical faery king and is a pawn in a deadly war. Now Meghan will learn just how far she'll go to save someone she cares about, to stop a mysterious evil, no faery creature dare face; and to find love with a young prince who might rather see her dead than let her touch his icy heart."],
    "info": {
        "ISBN": "(ISBN13: 9780373210084)",
        "Series": "The Iron Fey #1",
        "setting": ["New Orleans, Louisiana", "Nevernever"],
        "Original Title": "The Iron King (The Iron Fey, #1) ",
        "Characters": ["Meghan Chase", "Puck", "Grimalkin", "Ash - Ashallayn' Darkmyr Tallyn", "Ethan Chase", "...more", "Machina The Iron King", "...less"],
        "Edition Language": "English",
        "Literary Awards": ["RITA Award by Romance Writers of America for Best Young Adult Romance & Nominee for First Book (2011)", "Goodreads Choice Award Nominee for Young Adult Fantasy, Debut Author, Goodreads Author (2010)"]
    },
    "book_format_type": "Paperback",
    "book_cover_url": "https://images.gr-assets.com/books/1327877670l/6644117.jpg",
    "author": "Julie Kagawa",
    "title": "\n      The Iron King\n      ",
    "number_of_pages": "363 pages",
    "publish_info": "\n            Published\n        February 1st 2010\n         by Harlequin Teen\n\n      ",
    "genres_info": ["Fantasy", "4,674 users", "Young Adult", "3,420 users", "Romance", "1,293 users", "Fantasy", "Paranormal", "1,147 users"]
}, {
    "book_description": ["Celaena has survived deadly contests and shattering heartbreak―but at an unspeakable cost. Now, she must travel to a new land to confront her darkest truth . . . a truth about her heritage that could change her life―and her future―forever. Meanwhile, brutal and monstrous forces are gathering on the horizon, intent on enslaving her world. Will Celaena find the strength to not only fight her inner demons, but to take on the evil that is about to be unleashed?", "The bestselling series that has captured readers all over the world reaches new heights in this sequel to the ", " best-selling ", ". Packed with heart-pounding action, fierce new characters, and swoon-worthy romance, this third book will enthrall readers from start to finish."],
    "info": {
        "ISBN": "(ISBN13: 9781619630659)",
        "Series": "Throne of Glass #3",
        "setting": ["Rifthold, Adarlan", "Wendlyn"],
        "Original Title": "Heir of Fire",
        "Characters": ["Celaena Sardothien", "Chaol Westfall", "Prince Dorian Havilliard", "Manon Blackbeak", "Rowan Whitethorn"],
        "Edition Language": "English",
        "Literary Awards": ["Goodreads Choice Award Nominee for Young Adult Fantasy & Science Fiction (2014)"]
    },
    "book_format_type": "Hardcover",
    "book_cover_url": "https://images.gr-assets.com/books/1460846511l/20613470.jpg",
    "author": "Sarah J. Maas",
    "title": "\n      Heir of Fire\n      ",
    "number_of_pages": "565 pages",
    "publish_info": "\n            Published\n        September 2nd 2014\n         by Bloomsbury USA Childrens\n\n      ",
    "genres_info": ["Fantasy", "6,096 users", "Young Adult", "2,582 users", "Fantasy", "Magic", "842 users", "Romance", "801 users", "Fantasy", "High Fantasy", "512 users", "Fairies", "Fae", "398 users", "Young Adult", "Young Adult Fantasy", "378 users", "Fiction", "367 users", "Adventure", "312 users", "Fantasy", "Paranormal", "220 users"]
}, {
    "book_description": ["Tony Webster and his clique first met Adrian Finn at school. Sex-hungry and book-hungry, they would navigate the girl-less sixth form together, trading in affectations, in-jokes, rumour and wit. Maybe Adrian was a little more serious than the others, certainly more intelligent, but they all swore to stay friends for life.", "Now Tony is retired. He's had a career and a single marriage, a calm divorce. He's certainly never tried to hurt anybody. Memory, though, is imperfect. It can always throw up surprises, as a lawyer's letter is about to prove."],
    "info": {
        "ISBN": "(ISBN13: 9780224094153)",
        "setting": ["Bristol, England", "Chislehurst, Kent, England", "London, England"],
        "Original Title": "The Sense of an Ending",
        "Characters": ["Anthony \"Tony\" Webster", "Veronica Mary Ford", "Adrian Finn", "Colin Simpson", "Joe Hunt", "...more", "Phil Dixon", "Sarah Ford", "...less"],
        "Edition Language": "English",
        "Literary Awards": ["Man Booker Prize (2011)", "Warwick Prize for Writing Nominee for Longlist (2013)", "Costa Book Award Nominee for Novel (2011)", "Andrew Carnegie Medal Nominee for Fiction (2012)", "International DUBLIN Literary Award Nominee (2013)", "...more", "Europese Literatuurprijs (2012)", "...less"]
    },
    "book_format_type": "Hardcover",
    "book_cover_url": "https://images.gr-assets.com/books/1311704453l/10746542.jpg",
    "author": "Julian Barnes",
    "title": "\n      The Sense of an Ending\n",
    "number_of_pages": "150 pages",
    "publish_info": "\n            Published\n        August 4th 2011\n         by Jonathan Cape\n\n      ",
    "genres_info": ["Fiction", "2,554 users", "Literary Fiction", "315 users", "Contemporary", "261 users", "Literature", "246 users", "European Literature", "British Literature", "233 users"]
}, {
    "book_description": ["As I sleep, my mind will erase everything I did today. I will wake up tomorrow as I did this morning. Thinking I'm still a child, thinking I have a whole lifetime of choice ahead of me... ", "Memories define us. So what if you lost yours every time you went to sleep? Your name, your identity, your past, even the people you love--all forgotten overnight. And the one person you trust may only be telling you half the story. ", "Welcome to Christine's life."],
    "info": {
        "ISBN": "(ISBN13: 9780062060556)",
        "setting": ["Crouch End"],
        "Original Title": "Before I Go to Sleep",
        "Characters": ["Ben", "Christine Lucas", "Dr. Nash", "Clare"],
        "Edition Language": "English",
        "Literary Awards": ["Macavity Award Nominee for Best First Mystery Novel (2012)", "Anthony Award Nominee for Best First Novel (2012)", "CWA New Blood Dagger (2011)", "CWA Ian Fleming Steel Dagger Nominee (2011)", "Galaxy National Book Award for Crime & Thriller of the Year (2011)"]
    },
    "book_format_type": "Hardcover",
    "book_cover_url": "https://images.gr-assets.com/books/1358353512l/9736930.jpg",
    "author": "S.J. Watson",
    "title": "\n      Before I Go to Sleep\n",
    "number_of_pages": "359 pages",
    "publish_info": "\n            Published\n        June 14th 2011\n         by HarperCollins Publishers\n\n            ",
    "genres_info": ["Fiction", "1,839 users", "Mystery", "1,674 users", "Thriller", "1,558 users", "Suspense", "558 users", "Thriller", "Mystery Thriller", "382 users", "Adult", "321 users", "Contemporary", "315 users", "Mystery", "Crime", "262 users", "Adult Fiction", "239 users", "Thriller", "Psychological Thriller", "208 users"]
}, {
    "book_description": ["I wasn't free of my past, not yet.", " Sydney's blood is special. That's because she's an alchemist - one of a group of humans who dabble in magic and serve to bridge the worlds of humans and vampires. They protect vampire secrets - and human lives. But the last encounter Sydney had with vampires got her in deep trouble with the other alchemists. And now with her allegiences in question, her future is on the line.", " When Sydney is torn from her bed in the middle of the night, at first she thinks she's still being punished for her complicated alliance with dhampir Rose Hathaway. But what unfolds is far worse. Jill Dragomir - the sister of Moroi Queen Lissa Dragomir - is in mortal danger, and the Moroi must send her into hiding. To avoid a civil war, Sydney is called upon to act as Jill's guardian and protector, posing as her roommate in the unlikeliest of places: a human boarding school in Palm Springs, California. The last thing Sydney wants is to be accused of sympathizing with vampires. And now she has to live with one.", " The Moroi court believe Jill and Sydney will be safe at Amberwood Prep, but threats, distractions, and forbidden romance lurk both outside - and within - the school grounds. Now that they're in hiding, the drama is only just beginning."],
    "info": {
        "ISBN": "(ISBN13: 9781595143174)",
        "Series": "Bloodlines #1",
        "setting": ["Palm Springs, California"],
        "Original Title": "Bloodlines",
        "Characters": ["Sydney Sage", "Dimitri Belikov", "Adrian Ivashkov", "Jillian Mastrano", "Abe Mazur", "...more", "Edison \"Eddie\" Castile", "Zoe Sage", "...less"],
        "Edition Language": "English",
        "Literary Awards": ["Goodreads Choice Award Nominee for Best Young Adult Fantasy & Science Fiction (2011)"]
    },
    "book_format_type": "Hardcover",
    "book_cover_url": "https://images.gr-assets.com/books/1297199431l/8709527.jpg",
    "author": "Richelle Mead",
    "title": "\n      Bloodlines\n      ",
    "number_of_pages": "421 pages",
    "publish_info": "\n            Published\n        August 23rd 2011\n         by Penguin Group\n\n      ",
    "genres_info": ["Young Adult", "2,183 users", "Paranormal", "Vampires", "2,022 users", "Fantasy", "1,525 users", "Fantasy", "Paranormal", "1,476 users"]
}, {
    "book_description": ["Nora Grey's life is still far from perfect. Surviving an attempt on her life wasn't pleasant, but at least she got a guardian angel out of it. A mysterious, magnetic, gorgeous guardian angel. But despite his role in her life, Patch has been acting anything but angelic. He's more elusive than ever (if that's possible) and what's worse, he seems to be spending time with Nora's archenemy, Marcie Millar.", "Nora would have hardly noticed Scott Parnell, an old family friend who has moved back to town, if Patch hadn't been acting so distant. Even with Scott's totally infuriating attitude, Nora finds herself drawn to him - despite her lingering feelings that he is hiding something.", "If that weren't enough, Nora is haunted by images of her murdered father, and comes to question whether her Nephilim bloodline has anything to do with his death. Desperate to figure out what happened, she puts herself in increasingly dangerous situations to get the answer. But maybe some things are better left buried, because the truth could destroy everything - and everyone - she trusts."],
    "info": {
        "ISBN": "(ISBN13: 9781416989431)",
        "Series": "Hush, Hush #2",
        "setting": ["Coldwater, Maine"],
        "Original Title": "Crescendo",
        "Characters": ["Nora Grey", "Patch Cipriano", "Vee Sky", "Marcie Millar", "Rixon", "...more", "Scott Parnell", "...less"],
        "Edition Language": "English",
        "Literary Awards": ["Goodreads Choice Award Nominee for Goodreads Author (2010)"]
    },
    "book_format_type": "Hardcover",
    "book_cover_url": "https://images.gr-assets.com/books/1362408146l/7791997.jpg",
    "author": "Becca Fitzpatrick",
    "title": "\n      Crescendo\n      ",
    "number_of_pages": "427 pages",
    "publish_info": ", ",
    "genres_info": ["Young Adult", "2,468 users", "Paranormal", "Angels", "1,867 users", "Fantasy", "1,779 users", "Fantasy", "Paranormal", "1,439 users", "Romance", "1,232 users"]
}, {
    "book_description": ["Ever since the gods of Ancient Egypt were unleashed in the modern world, Carter Kane and his sister Sadie have been in trouble. As descendants of the House of Life, the Kanes have some powers at their command, but the devious gods haven't given them much time to master their skills at Brooklyn House, which has become a training ground for young magicians. ", "And now their most threatening enemy yet - the chaos snake Apophis - is rising. If they don't prevent him from breaking free in a few days' time, the world will come to an end. In other words, it's a typical week for the Kane family. ", "To have any chance of battling the Forces of Chaos, the Kanes must revive the sun god Ra. But that would be a feat more powerful than any magician has ever accomplished. ", "First they have to search the world for the three sections of the Book of Ra, then they have to learn how to chant its spells. Oh, and did we mention that no one knows where Ra is exactly? ", "Narrated in two different wisecracking voices, featuring a large cast of new and unforgettable characters, and with adventures spanning the globe, this second installment in the Kane Chronicles is nothing short of a thrill ride."],
    "info": {
        "ISBN": "(ISBN13: 9781423140566)",
        "Series": "Kane Chronicles #2",
        "setting": ["Brooklyn, New York City, New York", "Duat", "Alexandria", "…more", "London, England", "Saint Petersburg", "…less"],
        "Original Title": "The Throne of Fire",
        "Characters": ["Bast", "Bes", "Isis", "Anubis", "Osiris", "...more", "Horus", "Carter Kane", "Sadie Kane", "Zia Rashid", "Thoth", "Khufu", "Babi", "Ra", "Set", "Nephthys", "Sobek", "Taweret", "Nekhbet", "Apophis", "Vladimir Menshikov", "Walt Stone", "Khepri", "Khnum", "Khonsu", "Ptah", "...less"],
        "Edition Language": "English"
    },
    "book_format_type": "Hardcover",
    "book_cover_url": "https://images.gr-assets.com/books/1366227973l/9067850.jpg",
    "author": "Rick Riordan",
    "title": "\n      The Throne of Fire\n      ",
    "number_of_pages": "452 pages",
    "publish_info": "\n            Published\n        May 3rd 2011\n         by Hyperion Books for Children\n\n      ",
    "genres_info": ["Fantasy", "2,659 users", "Fantasy", "Mythology", "1,273 users", "Young Adult", "1,153 users", "Adventure", "498 users"]
}, {
    "book_description": ["It is freezing in the churchyard, even before the dead arrive.", "Every year, Blue Sargent stands next to her clairvoyant mother as the soon-to-be dead walk past. Blue herself never sees them—not until this year, when a boy emerges from the dark and speaks directly to her.", "His name is Gansey, and Blue soon discovers that he is a rich student at Aglionby, the local private school. Blue has a policy of staying away from Aglionby boys. Known as Raven Boys, they can only mean trouble.", "But Blue is drawn to Gansey, in a way she can’t entirely explain. He has it all—family money, good looks, devoted friends—but he’s looking for much more than that. He is on a quest that has encompassed three other Raven Boys: Adam, the scholarship student who resents all the privilege around him; Ronan, the fierce soul who ranges from anger to despair; and Noah, the taciturn watcher of the four, who notices many things but says very little.", "For as long as she can remember, Blue has been warned that she will cause her true love to die. She never thought this would be a problem. But now, as her life becomes caught up in the strange and sinister world of the Raven Boys, she’s not so sure anymore.", "From Maggie Stiefvater, the bestselling and acclaimed author of the ", " trilogy and ", ", comes a spellbinding new series where the inevitability of death and the nature of love lead us to a place we’ve never been before."],
    "info": {
        "ISBN": "(ISBN13: 9780545424929)",
        "Series": "The Raven Cycle #1",
        "setting": ["Henrietta, Virginia"],
        "Original Title": "The Raven Boys",
        "Characters": ["Blue Sargent", "Richard \"Dick\" Campbell Gansey III", "Adam Parrish", "Ronan Lynch", "Noah (The Raven Cycle)"],
        "Edition Language": "English",
        "Literary Awards": ["Bram Stoker Award Nominee for Best Young Adult Novel (2012)", "Mythopoeic Fantasy Award Nominee for Adult Literature (2017)", "Milwaukee County Teen Book Award Nominee (2014)", "The Inky Awards for Silver Inky (2013)", "Lincoln Award Nominee (2015)", "...more", "Carnegie Medal Nominee (2014)", "The Inky Awards Shortlist for Silver Inky (2013)", "Premio El Templo de las Mil Puertas Nominee for Mejor novela extranjera perteneciente a saga (2013)", "...less"]
    },
    "book_format_type": "Hardcover",
    "book_cover_url": "https://images.gr-assets.com/books/1477103737l/17675462.jpg",
    "author": "Maggie Stiefvater",
    "title": "\n      The Raven Boys\n      ",
    "number_of_pages": "409 pages",
    "publish_info": "\n            Published\n        September 18th 2012\n         by Scholastic Press\n\n      ",
    "genres_info": ["Fantasy", "5,857 users", "Young Adult", "5,090 users", "Fantasy", "Paranormal", "2,400 users", "Romance", "1,075 users"]
}, {
    "book_description": [" ", " Deep in the stacks of Oxford's Bodleian Library, young scholar Diana Bishop unwittingly calls up a bewitched alchemical manuscript in the course of her research. Descended from an old and distinguished line of witches, Diana wants nothing to do with sorcery; so after a furtive glance and a few notes, she banishes the book to the stacks. But her discovery sets a fantastical underworld stirring, and a horde of daemons, witches, and vampires soon descends upon the library. Diana has stumbled upon a coveted treasure lost for centuries-and she is the only creature who can break its spell. "],
    "info": {
        "ISBN": "(ISBN13: 9780670022410)",
        "Series": "All Souls Trilogy #1",
        "setting": ["Oxford, England", "Saint Lucien", "Madison, New York"],
        "Original Title": "A Discovery of Witches",
        "Characters": ["Sarah Bishop", "Sean Ryder", "Diana Bishop", "Matthew Clairmont", "Emily Mather", "...more", "Dr. Miriam Shephard", "Hamish Osbourne", "Dr. Marcus Whitmore", "Ysabeau de Clairmont", "Baldwin de Clairmont", "Elias Ashmole", "Peter Knox", "Stephen Proctor", "Rebecca Bishop", "Marthe", "Juliette Durand", "Agatha Wilson", "Nathaniel Wilson", "Gillian Chamberlain", "...less"],
        "Edition Language": "English",
        "Literary Awards": ["SCIBA Award for fiction", "Goodreads Choice Award Nominee for Best Paranormal Fantasy (2011)"]
    },
    "book_format_type": "Hardcover",
    "book_cover_url": "https://images.gr-assets.com/books/1322168805l/8667848.jpg",
    "author": "Deborah Harkness",
    "title": "\n      A Discovery of Witches\n      ",
    "number_of_pages": "579 pages",
    "publish_info": "\n            Published\n        February 2011\n         by Viking Penguin\n\n      ",
    "genres_info": ["Fantasy", "5,766 users", "Fiction", "2,003 users", "Fantasy", "Paranormal", "1,847 users", "Romance", "1,718 users", "Paranormal", "Vampires", "1,363 users", "Paranormal", "Witches", "1,051 users", "Fantasy", "Magic", "800 users"]
}, {
    "book_description": ["Aristotle is an angry teen with a brother in prison. Dante is a know-it-all who has an unusual way of looking at the world. When the two meet at the swimming pool, they seem to have nothing in common. But as the loners start spending time together, they discover that they share a special friendship—the kind that changes lives and lasts a lifetime. And it is through this friendship that Ari and Dante will learn the most important truths about themselves and the kind of people they want to be."],
    "info": {
        "ISBN": "(ISBN13: 9781442408920)",
        "Series": "Aristotle and Dante Discover the Secrets of the Universe #1",
        "setting": ["El Paso, Texas", "Texas"],
        "Original Title": "Aristotle and Dante Discover the Secrets of the Universe",
        "Characters": ["Aristotle \"Ari\" Mendoza", "Dante Quintana"],
        "Edition Language": "English",
        "Literary Awards": ["Stonewall Book Award for Children’s and Young Adult Literature (2013)", "Michael L. Printz Award Nominee (2013)", "Pennsylvania Young Readers' Choice Award Nominee for Young Adults (2015)", "Lambda Literary Award for LGBT Children's/Young Adult (2013)", "Deutscher Jugendliteraturpreis Nominee for Jugendbuch (2015)", "...more", "Amelia Elizabeth Walden Award (ALAN/NCTE) Nominee (2013)", "Lincoln Award Nominee (2016)", "Pura Belpré Medal for Narrative (2013)", "...less"]
    },
    "book_format_type": "Hardcover",
    "book_cover_url": "https://images.gr-assets.com/books/1328320260l/12000020.jpg",
    "author": "Benjamin Alire Sáenz",
    "title": "\n      Aristotle and Dante Discover the Secrets of the Universe\n      ",
    "number_of_pages": "359 pages",
    "publish_info": "\n            Published\n        February 21st 2012\n         by Simon & Schuster Books for Young Readers\n\n      ",
    "genres_info": ["Young Adult", "2,276 users", "Glbt", "2,024 users", "Contemporary", "1,911 users", "Romance", "1,173 users", "Fiction", "1,097 users", "Realistic Fiction", "645 users"]
}, {
    "book_description": ["When Barry Fairbrother dies in his early forties, the town of Pagford is left in shock.", "Pagford is, seemingly, an English idyll, with a cobbled market square and an ancient abbey, but what lies behind the pretty façade is a town at war.", "Rich at war with poor, teenagers at war with their parents, wives at war with their husbands, teachers at war with their pupils ... Pagford is not what it first seems.", "And the empty seat left by Barry on the parish council soon becomes the catalyst for the biggest war the town has yet seen. Who will triumph in an election fraught with passion, duplicity and unexpected revelations?"],
    "info": {
        "ISBN": "(ISBN13: 9780316228534)",
        "setting": ["Pagford"],
        "Original Title": "The Casual Vacancy",
        "Characters": ["Barry Fairbrother", "Mary Fairbrother", "Howard Mollison", "Shirley Mollison", "Samantha Mollison", "...more", "Miles Mollison", "Krystal Weedon", "Terri Weedon", "Colin \"Cubby\" Wall", "Tessa Wall", "Stuart \"Fats\" Wall", "Andrew Price", "Ruth Price", "Simon Price", "Gavin Hughes", "Kay Bawden", "Gaia Bawden", "Parminder Jawanda", "Sukhvinder Jawanda", "Vikram Jawanda", "Robbie Weedon", "Barry Fairbrother, Mary Fairbrother, Howard Mollison, Shirley Mollison, Samantha Mollison", "...less"],
        "Edition Language": "English",
        "Literary Awards": ["Goodreads Choice Award for Best Fiction (2012)"]
    },
    "book_format_type": "Hardcover",
    "book_cover_url": "https://images.gr-assets.com/books/1358266832l/13497818.jpg",
    "author": "J.K. Rowling",
    "title": "\n      The Casual Vacancy\n",
    "number_of_pages": "503 pages",
    "publish_info": ", ",
    "genres_info": ["Audiobook", "204 users", "Fiction", "136 users", "Book Club", "128 users"]
}, {
    "book_description": ["One snowy night a famous Hollywood actor slumps over and dies onstage during a production of King Lear. Hours later, the world as we know it begins to dissolve. Moving back and forth in time—from the actor's early days as a film star to fifteen years in the future, when a theater troupe known as The Travelling Symphony roams the wasteland of what remains—this suspenseful, elegiac, spellbinding novel charts the strange twists of fate that connect five people: the actor, the man who tried to save him, the actor's first wife, his oldest friend, and a young actress with the Traveling Symphony, caught in the crosshairs of a dangerous self-proclaimed prophet. Sometimes terrifying, sometimes tender, Station Eleven tells a story about the relationships that sustain us, the ephemeral nature of fame, and the beauty of the world as we know it.\""],
    "info": {
        "ISBN": "(ISBN13: 9780385353304)",
        "setting": ["Toronto, Ontario", "Michigan"],
        "Original Title": "Station Eleven",
        "Characters": ["Miranda Carroll", "Clark Thompson", "Kirsten Raymonde", "Jeevan Chaudhary", "Arthur Leander", "...more", "Sayid", "Elizabeth Colton", "Dieter", "August", "Gil Harris", "Tyler Leander", "Frank Chaudhary", "...less"],
        "Edition Language": "English",
        "Literary Awards": ["Arthur C. Clarke Award for Best Novel (2015)", "PEN/Faulkner Award for Fiction Nominee (2015)", "Sunburst Award Nominee for Adult (2015)", "John W. Campbell Memorial Award Nominee for Best Novel (2015)", "British Fantasy Award Nominee for August Derleth Award (best horror novel) (2015)", "...more", "The Rooster - The Morning News Tournament of Books (2015)", "Toronto Book Award Nominee (2015)", "The Great Michigan Read (2015)", "Women's Prize for Fiction Nominee for Longlist (2015)", "National Book Award Finalist for Fiction (2014)", "Goodreads Choice Award Nominee for Fiction (2014)", "...less"]
    },
    "book_format_type": "Hardcover",
    "book_cover_url": "https://images.gr-assets.com/books/1451446835l/20170404.jpg",
    "author": "Emily St. John Mandel",
    "title": "\n      Station Eleven\n",
    "number_of_pages": "336 pages",
    "publish_info": "\n            Published\n        September 9th 2014\n         by Knopf\n\n      ",
    "genres_info": ["Fiction", "3,738 users", "Science Fiction", "1,991 users", "Science Fiction", "Dystopia", "1,393 users", "Apocalyptic", "Post Apocalyptic", "971 users"]
}, {
    "book_description": ["In his international blockbusters ", ", ", ", and ", ", Dan Brown masterfully fused history, art, codes, and symbols. In this riveting new thriller, Brown returns to his element and has crafted his highest-stakes novel to date."],
    "info": {
        "ISBN": "(ISBN13: 9780385537858)",
        "Series": "Robert Langdon #4",
        "setting": ["Istanbul", "Florence", "Venice"],
        "Original Title": "Inferno",
        "Characters": ["Robert Langdon", "Sienna Brooks"],
        "Edition Language": "English",
        "Literary Awards": ["Goodreads Choice Award for Mystery & Thriller (2013)"]
    },
    "book_format_type": "Hardcover",
    "book_cover_url": "https://images.gr-assets.com/books/1397093185l/17212231.jpg",
    "author": "Dan Brown",
    "title": "\n      Inferno\n      ",
    "number_of_pages": "461 pages",
    "publish_info": ", ",
    "genres_info": ["Fiction", "3,626 users", "Mystery", "2,286 users", "Thriller", "2,218 users", "Historical", "579 users"]
}, {
    "book_description": ["Lina is just like any other fifteen-year-old Lithuanian girl in 1941. She paints, she draws, she gets crushes on boys. Until one night when Soviet officers barge into her home, tearing her family from the comfortable life they've known. Separated from her father, forced onto a crowded and dirty train car, Lina, her mother, and her young brother slowly make their way north, crossing the Arctic Circle, to a work camp in the coldest reaches of Siberia. Here they are forced, under Stalin's orders, to dig for beets and fight for their lives under the cruelest of conditions.", " Lina finds solace in her art, meticulously--and at great risk--documenting events by drawing, hoping these messages will make their way to her father's prison camp to let him know they are still alive. It is a long and harrowing journey, spanning years and covering 6,500 miles, but it is through incredible strength, love, and hope that Lina ultimately survives. ", " is a novel that will steal your breath and capture your heart."],
    "info": {
        "Edition Language": "English",
        "setting": ["Siberia", "Lithuania"],
        "ISBN": "(ISBN13: 9780399254123)",
        "Original Title": "Between Shades of Gray",
        "Literary Awards": ["Georgia Peach Book Award Nominee for Honor book (2012)", "SCBWI Golden Kite Award for Fiction (2012)", "William C. Morris YA Debut Award Nominee (2012)", "Milwaukee County Teen Book Award Nominee (2012)", "Indies Choice Book Award for Young Adult (2012)", "...more", "Amelia Elizabeth Walden Award (ALAN/NCTE) Nominee (2012)", "Lincoln Award Nominee (2016)", "Cybils Award Nominee for Young Adult Fiction (2011)", "Carnegie Medal Nominee (2012)", "Missouri Gateway Readers Award Nominee (2014)", "...less"]
    },
    "book_format_type": "Hardcover",
    "book_cover_url": "https://images.gr-assets.com/books/1327873479l/7824322.jpg",
    "author": "Ruta Sepetys",
    "title": "\n      Between Shades of Gray\n",
    "number_of_pages": "344 pages",
    "publish_info": "\n            Published\n        March 22nd 2011\n         by Philomel Books\n\n      ",
    "genres_info": ["Young Adult", "2,438 users", "Historical", "944 users", "War", "401 users", "War", "World War II", "351 users", "Young Adult", "Teen", "214 users", "Cultural", "Russia", "184 users", "Romance", "166 users", "World War II", "Holocaust", "165 users", "Adventure", "Survival", "152 users", "Realistic Fiction", "139 users"]
}, {
    "book_description": ["Bernadette Fox is notorious. To her Microsoft-guru husband, she's a fearlessly opinionated partner; to fellow private-school mothers in Seattle, she's a disgrace; to design mavens, she's a revolutionary architect, and to 15-year-old Bee, she is a best friend and, simply, Mom.", "Then Bernadette disappears. It began when Bee aced her report card and claimed her promised reward: a family trip to Antarctica. But Bernadette's intensifying allergy to Seattle—and people in general—has made her so agoraphobic that a virtual assistant in India now runs her most basic errands. A trip to the end of the earth is problematic.", "To find her mother, Bee compiles email messages, official documents, secret correspondence—creating a compulsively readable and touching novel about misplaced genius and a mother and daughter's role in an absurd world."],
    "info": {
        "ISBN": "(ISBN13: 9780316204279)",
        "setting": ["Seattle, Washington", "Antarctica"],
        "Original Title": "Where'd You Go, Bernadette",
        "Characters": ["Bee Branch", "Bernadette Fox", "Elgin Branch", "Manjula Kapoor", "Audrey Griffin (Where'd You Go, Bernadette?)", "...more", "Soo-Lin Lee-Segal", "Gwen Goodyear", "Ollie Ordway", "Kyle Griffin", "Kennedy, Bee's friend", "Dr. Janelle Kurtz", "Warren Griffin", "...less"],
        "Edition Language": "English",
        "Literary Awards": ["ALA Alex Award (2013)", "Women's Prize for Fiction Nominee (2013)"]
    },
    "book_format_type": "Hardcover",
    "book_cover_url": "https://images.gr-assets.com/books/1338822317l/13526165.jpg",
    "author": "Maria Semple",
    "title": "\n      Where'd You Go, Bernadette\n",
    "number_of_pages": "330 pages",
    "publish_info": "\n            Published\n        August 14th 2012\n         by Little, Brown and Company\n\n            ",
    "genres_info": ["Fiction", "3,758 users", "Humor", "1,055 users", "Contemporary", "737 users", "Mystery", "632 users", "Womens Fiction", "Chick Lit", "543 users"]
}, {
    "book_description": ["Expected by his enemies to die the miserable death of a military slave, Kaladin survived to be given command of the royal bodyguards, a controversial first for a low-status \"darkeyes.\" Now he must protect the king and Dalinar from every common peril as well as the distinctly uncommon threat of the Assassin, all while secretly struggling to master remarkable new powers that are somehow linked to his honorspren, Syl.", "The Assassin, Szeth, is active again, murdering rulers all over the world of Roshar, using his baffling powers to thwart every bodyguard and elude all pursuers. Among his prime targets is Highprince Dalinar, widely considered the power behind the Alethi throne. His leading role in the war would seem reason enough, but the Assassin's master has much deeper motives.", "Brilliant but troubled Shallan strives along a parallel path. Despite being broken in ways she refuses to acknowledge, she bears a terrible burden: to somehow prevent the return of the legendary Voidbringers and the civilization-ending Desolation that will follow. The secrets she needs can be found at the Shattered Plains, but just arriving there proves more difficult than she could have imagined.", "Meanwhile, at the heart of the Shattered Plains, the Parshendi are making an epochal decision. Hard pressed by years of Alethi attacks, their numbers ever shrinking, they are convinced by their war leader, Eshonai, to risk everything on a desperate gamble with the very supernatural forces they once fled. The possible consequences for Parshendi and humans alike, indeed, for Roshar itself, are as dangerous as they are incalculable."],
    "info": {
        "ISBN": "(ISBN13: 9780765326362)",
        "Series": "The Stormlight Archive #2",
        "setting": ["Roshar"],
        "Original Title": "Words of Radiance",
        "Characters": ["Kaladin Stormblessed", "Dalinar Kholin", "Shallan Davar", "Jasnah Kholin", "Eshonai", "...more", "Adolin Kholin", "...less"],
        "Edition Language": "English",
        "Literary Awards": ["David Gemmell Legend Award (2015)", "David Gemmell Ravenheart Award (2015)", "Goodreads Choice Award Nominee for Fantasy (2014)"]
    },
    "book_format_type": "Hardcover",
    "book_cover_url": "https://images.gr-assets.com/books/1391535251l/17332218.jpg",
    "author": "Brandon Sanderson",
    "title": "\n      Words of Radiance\n      ",
    "number_of_pages": "1087 pages",
    "publish_info": "\n            Published\n        March 4th 2014\n         by Tor Books\n\n      ",
    "genres_info": ["Fantasy", "5,164 users", "Fiction", "528 users", "Fantasy", "Epic Fantasy", "506 users", "Fantasy", "High Fantasy", "259 users"]
}, {
    "book_description": [],
    "info": {
        "Series": "Mara Dyer #1",
        "setting": ["Miami, Florida"],
        "Edition Language": "English",
        "Original Title": "The Unbecoming of Mara Dyer",
        "Characters": ["Mara Dyer", "Noah Shaw"]
    },
    "book_format_type": "Kindle Edition",
    "book_cover_url": "https://images.gr-assets.com/books/1336655755l/11408650.jpg",
    "author": "Michelle Hodkin",
    "title": "\n      The Unbecoming of Mara Dyer\n      ",
    "number_of_pages": "456 pages",
    "publish_info": "\n            Published\n        September 27th 2011\n         by Simon & Schuster Books for Young Readers\n\n      ",
    "genres_info": ["Young Adult", "2,781 users", "Fantasy", "Paranormal", "1,849 users", "Fantasy", "1,355 users", "Romance", "1,330 users", "Mystery", "802 users", "Fiction", "397 users", "Fantasy", "Supernatural", "361 users", "Horror", "261 users", "Romance", "Paranormal Romance", "244 users", "Contemporary", "236 users"]
}, {
    "book_description": ["Bennie is an aging former punk rocker and record executive. Sasha is the passionate, troubled young woman he employs. Here Jennifer Egan brilliantly reveals their pasts, along with the inner lives of a host of other characters whose paths intersect with theirs. With music pulsing on every page, ", "is a startling, exhilarating novel of self-destruction and redemption."],
    "info": {
        "ISBN": "(ISBN13: 9780307592835)",
        "setting": ["San Francisco, California", "New York City, New York", "Crandale, New York", "…more", "Naples", "Pompeii", "Los Angeles, California", "Times Square, New York City, New York", "…less"],
        "Original Title": "A Visit From the Goon Squad",
        "Characters": ["Bennie Salazar", "Lou Kline", "Scotty Hausmann", "Bill Duff", "Jules Jones", "...more", "Dolly Peale", "Kitty Jackson", "Ted Hollander", "Sasha Blake", "Andy Grady", "Mark Avery", "Rachel Costanza", "Beth Grady", "Alison Blake", "...less"],
        "Edition Language": "English",
        "Literary Awards": ["Pulitzer Prize for Fiction (2011)", "PEN/Faulkner Award for Fiction Nominee (2011)", "Los Angeles Times Book Prize for Fiction (2010)", "National Book Critics Circle Award for Fiction (2010)", "Galaxy National Book Award for International Author of the Year (2011)", "...more", "The Rooster - The Morning News Tournament of Books (2011)", "Goodreads Choice Award Nominee for Fiction (2010)", "The International DUBLIN Literary Award for Shortlist (2012)", "...less"]
    },
    "book_format_type": "Hardcover",
    "book_cover_url": "https://images.gr-assets.com/books/1356844046l/7331435.jpg",
    "author": "Jennifer Egan",
    "title": "\n      A Visit from the Goon Squad\n",
    "number_of_pages": "288 pages",
    "publish_info": "\n            Published\n        June 8th 2010\n         by Knopf\n\n      ",
    "genres_info": ["Fiction", "3,069 users", "Contemporary", "438 users", "Music", "409 users", "Short Stories", "376 users"]
}, {
    "book_description": ["Since their mother's death, Carter and Sadie have become near strangers. While Sadie has lived with her grandparents in London, her brother has traveled the world with their father, the brilliant Egyptologist, Dr. Julius Kane. ", "One night, Dr. Kane brings the siblings together for a \"research experiment\" at the British Museum, where he hopes to set things right for his family. Instead, he unleashes the Egyptian god Set, who banishes him to oblivion and forces the children to flee for their lives. ", "Soon, Sadie and Carter discover that the gods of Egypt are waking, and the worst of them —Set— has his sights on the Kanes. To stop him, the siblings embark on a dangerous journey across the globe - a quest that brings them ever closer to the truth about their family and their links to a secret order that has existed since the time of the pharaohs."],
    "info": {
        "ISBN": "(ISBN13: 9781423113386)",
        "Series": "Kane Chronicles #1",
        "setting": ["London, England", "Cairo", "Phoenix, Arizona", "…more", "Duat", "…less"],
        "Original Title": "The Red Pyramid",
        "Characters": ["Bast", "Isis", "Anubis", "Osiris", "Horus", "...more", "Carter Kane", "Sadie Kane", "Zia Rashid", "Thoth", "Khufu", "Sekhmet", "Julius Kane", "Geb", "Nut", "Set", "Nephthys", "Serket", "Sobek", "Shu", "Nekhbet", "Apophis", "Philip II of Macedon (The albino crocodile)", "...less"],
        "Edition Language": "English",
        "Literary Awards": ["Pennsylvania Young Readers' Choice Award for Grades 6-8 (2012)", "New Mexico Land of Enchantment Award for Young Adult (2012)", "Goodreads Choice Award Nominee for Favorite Book, Young Adult Fantasy (2010)", "Carnegie Medal Nominee (2011)", "Premio El Templo de las Mil Puertas for Mejor novela extranjera perteneciente a saga (2011)"]
    },
    "book_format_type": "Hardcover",
    "book_cover_url": "https://images.gr-assets.com/books/1366227978l/7090447.jpg",
    "author": "Rick Riordan",
    "title": "\n      The Red Pyramid\n      ",
    "number_of_pages": "516 pages",
    "publish_info": "\n            Published\n        May 4th 2010\n         by Disney-Hyperion\n\n      ",
    "genres_info": ["Fantasy", "906 users", "Young Adult", "816 users", "Fiction", "708 users", "Childrens", "Middle Grade", "490 users", "Fantasy", "Mythology", "420 users"]
}, {
    "book_description": ["At least one-third of the people we know are introverts. They are the ones who prefer listening to speaking, reading to partying; who innovate and create but dislike self-promotion; who favor working on their own over brainstorming in teams. Although they are often labeled \"quiet,\" it is to introverts that we owe many of the great contributions to society--from van Gogh’s sunflowers to the invention of the personal computer.", "Passionately argued, impressively researched, and filled with indelible stories of real people, ", "shows how dramatically we undervalue introverts, and how much we lose in doing so. Taking the reader on a journey from Dale Carnegie’s birthplace to Harvard Business School, from a Tony Robbins seminar to an evangelical megachurch, Susan Cain charts the rise of the Extrovert Ideal in the twentieth century and explores its far-reaching effects. She talks to Asian-American students who feel alienated from the brash, backslapping atmosphere of American schools. She questions the dominant values of American business culture, where forced collaboration can stand in the way of innovation, and where the leadership potential of introverts is often overlooked. And she draws on cutting-edge research in psychology and neuroscience to reveal the surprising differences between extroverts and introverts.", "Perhaps most inspiring, she introduces us to successful introverts--from a witty, high-octane public speaker who recharges in solitude after his talks, to a record-breaking salesman who quietly taps into the power of questions. Finally, she offers invaluable advice on everything from how to better negotiate differences in introvert-extrovert relationships to how to empower an introverted child to when it makes sense to be a \"pretend extrovert.\"", "This extraordinary book has the power to permanently change how we see introverts and, equally important, how introverts see themselves."],
    "info": {
        "Edition Language": "English",
        "ISBN": "(ISBN13: 9780307352149)",
        "Original Title": "Quiet: The Power of Introverts in a World that Can't Stop Talking",
        "Literary Awards": ["Guardian First Book Award Nominee for Longlist (2012)", "Goodreads Choice Award for Best Nonfiction (2012)"]
    },
    "book_format_type": "Hardcover",
    "book_cover_url": "https://images.gr-assets.com/books/1328562861l/8520610.jpg",
    "author": "Susan Cain",
    "title": "\n      Quiet: The Power of Introverts in a World That Can't Stop Talking\n",
    "number_of_pages": "337 pages",
    "publish_info": ", ",
    "genres_info": ["Nonfiction", "589 users", "Psychology", "532 users", "Self Help", "240 users"]
}, {
    "book_description": ["The Cuckoo's Calling is a 2013 crime fiction novel by J. K. Rowling, published under the pseudonym Robert Galbraith.", "A brilliant mystery in a classic vein: Detective Cormoran Strike investigates a supermodel's suicide.", "After losing his leg to a land mine in Afghanistan, Cormoran Strike is barely scraping by as a private investigator. Strike is down to one client, and creditors are calling. He has also just broken up with his longtime girlfriend and is living in his office.", "Then John Bristow walks through his door with an amazing story: His sister, the legendary supermodel Lula Landry, known to her friends as the Cuckoo, famously fell to her death a few months earlier. The police ruled it a suicide, but John refuses to believe that. The case plunges Strike into the world of multimillionaire beauties, rock-star boyfriends, and desperate designers, and it introduces him to every variety of pleasure, enticement, seduction, and delusion known to man.", "You may think you know detectives, but you've never met one quite like Strike. You may think you know about the wealthy and famous, but you've never seen them under an investigation like this."],
    "info": {
        "ISBN": "(ISBN13: 9780316206846)",
        "Series": "Cormoran Strike #1",
        "setting": ["London, England"],
        "Original Title": "The Cuckoo's Calling",
        "Characters": ["Cormoran Strike", "Robin Ellacott", "Matthew Cunliffe", "Lula Landry", "John Bristow", "...more", "Tony Landry", "Lady Yvette Landry Bristow", "Sir Alec Bristow", "Evan Duffield", "Freddy Bestigui", "Marlene Higson", "Jonny Rokeby", "Charlotte Campbell", "Leda Strike", "Eric Wardle", "Graham \"Hardy\" Hardacre", "Linda Ellacott", "Detective Inspector Roy Carver", "...less"],
        "Edition Language": "English",
        "Literary Awards": ["Anthony Award for Best Audio Book (2014)", "Los Angeles Times Book Prize for Mystery / Thriller (2013)", "Goodreads Choice Award Nominee (2013)"]
    },
    "book_format_type": "Hardcover",
    "book_cover_url": "https://images.gr-assets.com/books/1358716559l/16160797.jpg",
    "author": "Robert Galbraith",
    "title": "\n      The Cuckoo's Calling\n      ",
    "number_of_pages": "455 pages",
    "publish_info": "\n            Published\n        April 30th 2013\n         by Mulholland Books / Little, Brown and Company\n\n            ",
    "genres_info": ["Mystery", "5,875 users", "Fiction", "2,910 users", "Mystery", "Crime", "1,650 users", "Thriller", "715 users"]
}, {
    "book_description": ["On a cold and snowy night in 1910, Ursula Todd is born, the third child of a wealthy English banker and his wife. Sadly, she dies before she can draw her first breath. On that same cold and snowy night, Ursula Todd is born, lets out a lusty wail, and embarks upon a life that will be, to say the least, unusual. ", "For as she grows, she also dies, repeatedly, in any number of ways. Clearly history (and Kate Atkinson) have plans for her: In Ursula rests nothing less than the fate of civilization.", "Wildly inventive, darkly comic, startlingly poignant — this is Kate Atkinson at her absolute best, playing with time and history, telling a story that is breathtaking for both its audacity and its endless satisfactions."],
    "info": {
        "ISBN": "(ISBN13: 9780316176484)",
        "Series": "Todd #1",
        "Literary Awards": ["Costa Book Award for Novel (2013)", "Tähtifantasia Award Nominee (2015)", "Women's Prize for Fiction Nominee (2013)", "Walter Scott Prize Nominee (2014)", "Waterstones Book of the Year Nominee (2013)"],
        "Characters": ["Ursula Todd"],
        "Edition Language": "English",
        "Original Title": "Life After Life"
    },
    "book_format_type": "Hardcover",
    "book_cover_url": "https://images.gr-assets.com/books/1358173808l/15790842.jpg",
    "author": "Kate Atkinson",
    "title": "\n      Life After Life\n      ",
    "number_of_pages": "531 pages",
    "publish_info": "\n            Published\n        April 2nd 2013\n         by Reagan Arthur Books\n\n            ",
    "genres_info": ["Fiction", "761 users", "Historical", "736 users", "Science Fiction", "Time Travel", "347 users", "Literary Fiction", "293 users"]
}, {
    "book_description": ["With this stunning debut novel, ", " bestselling author Lauren Oliver emerged as one of today's foremost authors of young adult fiction. Like Jay Asher's ", " and Gayle Forman's ", ", ", " raises thought-provoking questions about love, death, and how one person's life can affect so many others.", "For popular high school senior Samantha Kingston, February 12—\"Cupid Day\"—should be one big party, a day of valentines and roses and the privileges that come with being at the top of the social pyramid. And it is…until she dies in a terrible accident that night.", "However, she still wakes up the next morning. In fact, Sam lives the last day of her life seven times, until she realizes that by making even the slightest changes, she may hold more power than she ever imagined.", "Named to numerous state reading lists, this novel was also recognized as a Best Book of the Year by Amazon.com, Barnes & Noble, ", ", NPR, and ", ". It has been optioned for film by Fox 2000 Pictures.", "Supports the Common Core State Standards."],
    "info": {
        "ISBN": "(ISBN13: 9780061726811)",
        "setting": ["Connecticut"],
        "Original Title": "Before I Fall",
        "Characters": ["Kent McFuller", "Ally Harris", "Samantha Kingston", "Lindsay Edgecombe", "Elody", "...more", "Juliet Sykes", "Izzy Kingston", "Rob Cokran", "...less"],
        "Edition Language": "English",
        "Literary Awards": ["Romantic Times Reviewers' Choice Award (RT Award) Nominee for Best Young Adult Paranormal/Fantasy Novel (2010)", "Milwaukee County Teen Book Award Nominee (2011)", "Deutscher Jugendliteraturpreis Nominee for Preis der Jugendjury (2011)", "Publishers Weekly's Best Children's Books of the Year for Fiction (2010)", "Literaturpreis der Jury der jungen Leser for Cover (2011)", "...more", "Goodreads Choice Award for Young Adult Fiction, Debut Author, Nominee for Goodreads Author, Favorite Heroine (2010)", "Missouri Gateway Readers Award Nominee (2013)", "Premio El Templo de las Mil Puertas Nominee for Mejor novela extranjera independiente (2010)", "...less"]
    },
    "book_format_type": "Paperback",
    "book_cover_url": "https://images.gr-assets.com/books/1361044695l/6482837.jpg",
    "author": "Lauren Oliver",
    "title": "\n      Before I Fall\n",
    "number_of_pages": "470 pages",
    "publish_info": ", ",
    "genres_info": ["Young Adult", "4,063 users", "Contemporary", "1,440 users", "Romance", "926 users", "Fiction", "895 users", "Fantasy", "646 users", "Realistic Fiction", "338 users", "Young Adult", "Teen", "326 users", "Death", "318 users", "Fantasy", "Paranormal", "305 users", "Womens Fiction", "Chick Lit", "230 users"]
}, {
    "book_description": [],
    "info": {
        "ISBN": "(ISBN13: 9781595142504)",
        "Series": "Vampire Academy #5",
        "setting": ["Montana", "Las Vegas, Nevada", "Alaska", "…more", "Pennsylvania", "…less"],
        "Original Title": "Spirit Bound",
        "Characters": ["Vasilisa \"Lissa\" Dragomir", "Dimitri Belikov", "Christian Ozera", "Adrian Ivashkov", "Victor Dashkov", "...more", "Mia Rinaldi", "Jillian Mastrano", "Abe Mazur", "Natasha Ozera", "Rosemarie \"Rose\" Hathaway", "...less"],
        "Edition Language": "English",
        "Literary Awards": ["Children's Choice Book Award Nominee for Teen Choice Book of the Year (2011)", "Teen Read Award Nominee for Best Series (2010)", "Goodreads Choice Award for Goodreads Author, Nominee for Favorite Heroine, Nominee for Favorite Book (2010)"]
    },
    "book_format_type": "Hardcover",
    "book_cover_url": "https://images.gr-assets.com/books/1291168967l/6479259.jpg",
    "author": "Richelle Mead",
    "title": "\n      Spirit Bound\n      ",
    "number_of_pages": "489 pages",
    "publish_info": ", ",
    "genres_info": ["Young Adult", "1,920 users", "Fantasy", "Paranormal", "1,840 users", "Paranormal", "Vampires", "1,659 users", "Fantasy", "1,518 users", "Romance", "1,345 users"]
}, {
    "book_description": ["It is 1911. The Coronation Day of King George V. The Williams, a Welsh coal-mining family is linked by romance and enmity to the Fitzherberts, aristocratic coal-mine owners. Lady Maud Fitzherbert falls in love with Walter von Ulrich, a spy at the German Embassy in London. Their destiny is entangled with that of an ambitious young aide to U.S. President Woodrow Wilson and to two orphaned Russian brothers, whose plans to emigrate to America fall foul of war, conscription and revolution. In a plot of unfolding drama and intriguing complexity, \"Fall Of Giants\" moves seamlessly from Washington to St Petersburg, from the dirt and danger of a coal mine to the glittering chandeliers of a palace, from the corridors of power to the bedrooms of the mighty."],
    "info": {
        "ISBN": "(ISBN13: 9780525951650)",
        "Series": "The Century Trilogy #1",
        "setting": ["Saint Petersburg", "London, England", "Aberowen, Wales", "…more", "Berlin", "…less"],
        "Original Title": "Fall of Giants",
        "Characters": ["Billy Williams", "Ethel Williams", "Earl Fitzherbert", "Grigori Peshkov", "Gus Dewar", "...more", "Lady Maud Fitzherbert", "Lev Peshkov", "Walter von Ulrich", "Grigori Sergeivich Peshkov", "Maud Fitzherbert", "Johnny Ponti", "Teddy Williams", "Michail Pinsky", "Bea Fitzherbert", "Natty Rothschild", "Suzanne von Ulrich", "Spirya", "Khabalov", "Madame Caillaux", "Nikolai Sokolov", "Owen Bevin", "William Tyrrell", "Boldyrev", "Father Gapon", "Duke Mikhail", "David Crampton", "Brusilov", "...less"],
        "Edition Language": "English",
        "Literary Awards": ["Goodreads Choice Award for Historical Fiction (2010)"]
    },
    "book_format_type": "Hardcover",
    "book_cover_url": "https://images.gr-assets.com/books/1470384630l/7315573.jpg",
    "author": "Ken Follett",
    "title": "\n      Fall of Giants\n      ",
    "number_of_pages": "985 pages",
    "publish_info": "\n            Published\n        September 28th 2010\n         by Berkley\n\n      ",
    "genres_info": ["Historical", "3,610 users", "Fiction", "1,452 users"]
}, {
    "book_description": ["After four harrowing years on the Western Front, Tom Sherbourne returns to Australia and takes a job as the lighthouse keeper on Janus Rock, nearly half a day’s journey from the coast. To this isolated island, where the supply boat comes once a season and shore leaves are granted every other year at best, Tom brings a young, bold, and loving wife, Isabel. Years later, after two miscarriages and one stillbirth, the grieving Isabel hears a baby’s cries on the wind. A boat has washed up onshore carrying a dead man and a living baby. ", "Tom, whose records as a lighthouse keeper are meticulous and whose moral principles have withstood a horrific war, wants to report the man and infant immediately. But Isabel has taken the tiny baby to her breast. Against Tom’s judgment, they claim her as their own and name her Lucy. When she is two, Tom and Isabel return to the mainland and are reminded that there are other people in the world. Their choice has devastated one of them. ", "M. L. Stedman’s mesmerizing, beautifully written novel seduces us into accommodating Isabel’s decision to keep this “gift from God.” And we are swept into a story about extraordinarily compelling characters seeking to find their North Star in a world where there is no right answer, where justice for one person is another’s tragic loss. ", " is exquisite and unforgettable, a deeply moving novel."],
    "info": {
        "Edition Language": "English",
        "setting": ["Australia"],
        "ISBN": "(ISBN13: 9781451681734)",
        "Original Title": "The Light Between Oceans",
        "Literary Awards": ["Australian Independent Booksellers Indie Book Award for Book of the Year (2013)", "Australian Book Industry Award (ABIA) for Literary Fiction and Newcomer (2013)", "Women's Prize for Fiction Nominee for Longlist (2013)", "Goodreads Choice Award for Best Historical Fiction (2012)", "HWA Debut Crown (2013)"]
    },
    "book_format_type": "Hardcover",
    "book_cover_url": "https://images.gr-assets.com/books/1336683021l/13158800.jpg",
    "author": "M.L. Stedman",
    "title": "\n      The Light Between Oceans\n",
    "number_of_pages": "343 pages",
    "publish_info": "\n            Published\n        July 31st 2012\n         by Scribner\n\n            ",
    "genres_info": ["Fiction", "2,989 users", "Historical", "2,495 users", "Cultural", "Australia", "532 users", "Book Club", "448 users", "Adult Fiction", "343 users", "Adult", "335 users", "Romance", "273 users", "Contemporary", "190 users", "Literary Fiction", "164 users", "Drama", "161 users"]
}, {
    "book_description": ["After the 1st wave, only darkness remains. After the 2nd, only the lucky escape. And after the 3rd, only the ", "lucky survive. After the 4th wave, only one rule applies: trust no one.", "Now, it's the dawn of the 5th wave, and on a lonely stretch of highway, Cassie runs from Them. The beings who only look human, who roam the countryside killing anyone they see. Who have scattered Earth's last survivors. To stay alone is to stay alive, Cassie believes, until she meets Evan Walker. Beguiling and mysterious, Evan Walker may be Cassie's only hope for rescuing her brother-or even saving herself. But Cassie must choose: between trust and despair, between defiance and surrender, between life and death. To give up or to get up."],
    "info": {
        "ISBN": "(ISBN13: 9780399162411)",
        "Series": "The 5th Wave #1",
        "setting": ["Ohio"],
        "Original Title": "The 5th Wave",
        "Characters": ["Evan Walker", "Cassie Sullivan", "Sammy Sullivan", "Ben Parish", "Colonel Alexander"],
        "Edition Language": "English",
        "Literary Awards": ["Georgia Peach Book Award Nominee for Honor book (2014)", "Keystone to Reading Book Award Nominee for High School (2015)", "Evergreen Teen Book Award (2016)", "Milwaukee County Teen Book Award Nominee (2014)", "The Inky Awards Nominee for Silver Inky (2013)", "...more", "Lincoln Award Nominee (2015)", "Goodreads Choice Award Nominee for Best Young Adult Fantasy & Science Fiction (2013)", "Carnegie Medal Nominee (2014)", "Green Mountain Book Award Nominee (2015)", "Louisiana Teen Readers' Choice (2016)", "Missouri Gateway Readers Award (2016)", "Oklahoma Sequoyah Award for High School (2016)", "Premio El Templo de las Mil Puertas Nominee for Mejor novela extranjera perteneciente a saga (2013)", "...less"]
    },
    "book_format_type": "Hardcover",
    "book_cover_url": "https://images.gr-assets.com/books/1359853842l/16101128.jpg",
    "author": "Rick Yancey",
    "title": "\n      The 5th Wave\n      ",
    "number_of_pages": "457 pages",
    "publish_info": "\n            Published\n        May 7th 2013\n         by G.P. Putnam's Sons Books for Young Readers\n\n      ",
    "genres_info": ["Young Adult", "4,524 users", "Science Fiction", "2,721 users", "Science Fiction", "Dystopia", "2,492 users"]
}, {
    "book_description": ["An international sensation, this hilarious, feel-good novel is narrated by an oddly charming and socially challenged genetics professor on an unusual quest: to find out if he is capable of true love.", "Don Tillman, professor of genetics, has never been on a second date. He is a man who can count all his friends on the fingers of one hand, whose lifelong difficulty with social rituals has convinced him that he is simply not wired for romance. So when an acquaintance informs him that he would make a “wonderful” husband, his first reaction is shock. Yet he must concede to the statistical probability that there is someone for everyone, and he embarks upon The Wife Project. In the orderly, evidence-based manner with which he approaches all things, Don sets out to find the perfect partner. She will be punctual and logical—most definitely not a barmaid, a smoker, a drinker, or a late-arriver.", "Yet Rosie Jarman is all these things. She is also beguiling, fiery, intelligent—and on a quest of her own. She is looking for her biological father, a search that a certain DNA expert might be able to help her with. Don's Wife Project takes a back burner to the Father Project and an unlikely relationship blooms, forcing the scientifically minded geneticist to confront the spontaneous whirlwind that is Rosie—and the realization that love is not always what looks good on paper.", " is a moving and hilarious novel for anyone who has ever tenaciously gone after life or love in the face of overwhelming challenges."],
    "info": {
        "ISBN": "(ISBN13: 9781476729084)",
        "Series": "Don Tillman #1",
        "setting": ["Australia"],
        "Original Title": "The Rosie Project",
        "Characters": ["Don Tillman", "Rosie Jarman"],
        "Edition Language": "English",
        "Literary Awards": ["All About Romance (AAR) Annual Reader Poll for Best Novel with Strong Romantic Elements (2014)", "Australian Book Industry Award (ABIA) for General Fiction (2014)", "UC Book of the Year (2015)", "Goodreads Choice Award Nominee for Fiction (2013)"]
    },
    "book_format_type": "Hardcover",
    "book_cover_url": "https://images.gr-assets.com/books/1371651741l/16181775.jpg",
    "author": "Graeme Simsion",
    "title": "\n      The Rosie Project\n      ",
    "number_of_pages": "297 pages",
    "publish_info": "\n            Published\n        October 1st 2013\n         by Simon & Schuster\n\n            ",
    "genres_info": ["Contemporary", "1,260 users", "Humor", "1,075 users", "Fiction", "802 users", "Womens Fiction", "Chick Lit", "752 users", "Adult", "563 users"]
}, {
    "book_description": ["Before Liz Lemon, before \"Weekend Update,\" before \"Sarah Palin,\" Tina Fey was just a young girl with a dream: a recurring stress dream that she was being chased through a local airport by her middle-school gym teacher. She also had a dream that one day she would be a comedian on TV.", "She has seen both these dreams come true.", "At last, Tina Fey's story can be told. From her youthful days as a vicious nerd to her tour of duty on ", "; from her passionately halfhearted pursuit of physical beauty to her life as a mother eating things off the floor; from her one-sided college romance to her nearly fatal honeymoon—from the beginning of this paragraph to this final sentence.", "Tina Fey reveals all, and proves what we've all suspected: you're no one until someone calls you bossy."],
    "info": {
        "Edition Language": "English",
        "Original Title": "Bossypants",
        "Characters": ["Tina Fey"],
        "Literary Awards": ["Audie Award for Audiobook of the Year (2012)", "Grammy Award Nominee for Best Spoken Word Album (2012)", "Goodreads Choice Award for Best Humor (2011)"]
    },
    "book_format_type": "Kindle Edition",
    "book_cover_url": "https://images.gr-assets.com/books/1481509554l/9418327.jpg",
    "author": "Tina Fey",
    "title": "\n      Bossypants\n",
    "number_of_pages": "283 pages",
    "publish_info": "\n            Published\n        April 5th 2011\n         by Reagan Arthur Books\n\n      ",
    "genres_info": ["Nonfiction", "6,644 users", "Humor", "3,748 users", "Autobiography", "Memoir", "3,617 users", "Biography", "2,330 users", "Audiobook", "1,377 users"]
}, {
    "book_description": ["A young woman named Aomame follows a taxi driver’s enigmatic suggestion and begins to notice puzzling discrepancies in the world around her. She has entered, she realizes, a parallel existence, which she calls 1Q84 —“Q is for ‘question mark.’ A world that bears a question.” Meanwhile, an aspiring writer named Tengo takes on a suspect ghostwriting project. He becomes so wrapped up with the work and its unusual author that, soon, his previously placid life begins to come unraveled. ", "As Aomame’s and Tengo’s narratives converge over the course of this single year, we learn of the profound and tangled connections that bind them ever closer: a beautiful, dyslexic teenage girl with a unique vision; a mysterious religious cult that instigated a shoot-out with the metropolitan police; a reclusive, wealthy dowager who runs a shelter for abused women; a hideously ugly private investigator; a mild-mannered yet ruthlessly efficient bodyguard; and a peculiarly insistent television-fee collector.", "A love story, a mystery, a fantasy, a novel of self-discovery, a dystopia to rival George Orwell’s — ", " is Haruki Murakami’s most ambitious undertaking yet: an instant best seller in his native Japan, and a tremendous feat of imagination from one of our most revered contemporary writers."],
    "info": {
        "ISBN": "(ISBN13: 9780307593313)",
        "Series": "1Q84 #1-3",
        "setting": ["Tokyo"],
        "Original Title": "いちきゅうはちよん [Ichi-Kyū-Hachi-Yon]",
        "Characters": ["Aomame Masami", "Tengo Kawana", "Fuka-Eri", "Komatsu"],
        "Edition Language": "English",
        "Literary Awards": ["Goodreads Choice Award for Best Fiction (2011)", "International DUBLIN Literary Award Nominee for Shortlist (2013)"]
    },
    "book_format_type": "Hardcover",
    "book_cover_url": "https://images.gr-assets.com/books/1483103331l/10357575.jpg",
    "author": "Haruki Murakami",
    "title": "\n      1Q84\n      ",
    "number_of_pages": "925 pages",
    "publish_info": "\n            Published\n        October 25th 2011\n         by Knopf\n\n            ",
    "genres_info": ["Fiction", "2,898 users", "Fantasy", "1,179 users", "Cultural", "Japan", "602 users", "Magical Realism", "578 users", "Science Fiction", "559 users", "Asian Literature", "Japanese Literature", "456 users"]
}, {
    "book_description": ["From the throne of glass rules a king with a fist of iron and a soul as black as pitch. Assassin Celaena Sardothien won a brutal contest to become his Champion. Yet Celaena is far from loyal to the crown. She hides her secret vigilantly; she knows that the man she serves is bent on evil.", "Keeping up the deadly charade becomes increasingly difficult when Celaena realizes she is not the only one seeking justice. As she tries to untangle the mysteries buried deep within the glass castle, her closest relationships suffer. It seems no one is above questioning her allegiances—not the Crown Prince Dorian; not Chaol, the Captain of the Guard; not even her best friend, Nehemia, a foreign princess with a rebel heart.", "Then one terrible night, the secrets they have all been keeping lead to an unspeakable tragedy. As Celaena's world shatters, she will be forced to give up the very thing most precious to her and decide once and for all where her true loyalties lie... and whom she is ultimately willing to fight for."],
    "info": {
        "ISBN": "(ISBN13: 9781619630628)",
        "Series": "Throne of Glass #2",
        "setting": ["Rifthold, Adarlan"],
        "Original Title": "Crown of Midnight",
        "Characters": ["Celaena Sardothien", "Chaol Westfall", "Prince Dorian Havilliard", "Princess Nehemia Ytger", "Archer Finn", "...more", "Kaltain Rompier", "...less"],
        "Edition Language": "English"
    },
    "book_format_type": "Hardcover",
    "book_cover_url": "https://images.gr-assets.com/books/1391580481l/17167166.jpg",
    "author": "Sarah J. Maas",
    "title": "\n      Crown of Midnight\n      ",
    "number_of_pages": "418 pages",
    "publish_info": "\n            Published\n        August 27th 2013\n         by Bloomsbury USA Childrens\n\n            ",
    "genres_info": ["Young Adult", "1,668 users", "Romance", "1,403 users", "Fantasy", "1,286 users", "Fiction", "497 users", "Young Adult", "Young Adult Fantasy", "450 users", "Adventure", "391 users", "Fairies", "Fae", "380 users", "Fantasy", "Paranormal", "300 users", "Action", "212 users", "Mystery", "203 users"]
}, {
    "book_description": ["My vision was growing dimmer, the blackness and ghosts closing in. I swore it was like I could hear Robert whispering in my ear: ", " Just before the light completely vanished, I saw Dimitri's face join Lissa's. I wanted to smile. I decided then that if the two people I loved most were safe, I could leave this world.", " She broke the law when she ran away from St. Vladimir's Academy with her best friend and last surviving Dragomir princess, Lissa. She broke the law when she fell in love with her gorgeous, off-limits instructor, Dimitri. And she dared to defy Queen Tatiana, leader of the Moroi world, risking her life and reputation to protect generations of dhampir guardians to come.", "Now the law has finally caught up with Rose - for a crime she didn't even commit. She's in prison for the highest offense imaginable: the assassination of a monarch. She'll need help from both Dimitri and Adrian to find the one living person who can stall her execution and force the Moroi elite to acknowledge a shocking new candidate for the royal throne: Vasilisa Dragomir.", "But the clock on Rose's life is running out. Rose knows in her heart the world of the dead wants her back...and this time she is truly out of second chances. The big question is, when your whole life is about saving others, who will save you?", "Join Rose, Dimitri, Adrian, and Lissa in ", ", the epic, unforgettable finale to Richelle Mead's international #1 bestselling ", " series."],
    "info": {
        "ISBN": "(ISBN13: 9781595143068)",
        "Series": "Vampire Academy #6",
        "setting": ["Pennsylvania", "West Virginia", "Ann Arbor, Michigan"],
        "Original Title": "Last Sacrifice ",
        "Characters": ["Sydney Sage", "Vasilisa \"Lissa\" Dragomir", "Dimitri Belikov", "Christian Ozera", "Adrian Ivashkov", "...more", "Victor Dashkov", "Janine Hathaway", "Jillian Mastrano", "Abe Mazur", "Natasha Ozera", "Rosemarie \"Rose\" Hathaway", "...less"],
        "Edition Language": "English",
        "Literary Awards": ["Goodreads Choice Award Nominee for Young Adult Fantasy (2010)"]
    },
    "book_format_type": "Hardcover",
    "book_cover_url": "https://images.gr-assets.com/books/1319850978l/6527740.jpg",
    "author": "Richelle Mead",
    "title": "\n      Last Sacrifice\n      ",
    "number_of_pages": "608 pages",
    "publish_info": ", ",
    "genres_info": ["Young Adult", "3,063 users", "Paranormal", "Vampires", "2,924 users", "Fantasy", "Paranormal", "1,787 users", "Fantasy", "873 users"]
}, {
    "book_description": ["Anna is looking forward to her senior year in Atlanta, where she has a great job, a loyal best friend, and a crush on the verge of becoming more. Which is why she is less than thrilled about being shipped off to boarding school in Paris--until she meets Étienne St. Clair. Smart, charming, ", ", Étienne has it all...including a serious girlfriend. ", "But in the City of Light, wishes have a way of coming true. Will a year of romantic near-misses end with their long-awaited French kiss?"],
    "info": {
        "ISBN": "(ISBN13: 9780525423270)",
        "Series": "Anna and the French Kiss #1",
        "setting": ["Paris", "Atlanta, Georgia"],
        "Original Title": "Anna and the French Kiss",
        "Characters": ["Anna Oliphant", "Étienne St. Clair", "Meredith Chevalier", "Rashmi", "Joshua Wasserstein", "...more", "Ellie", "Bridgette Saunderwick", "Christopher", "Dave Higgenbottom", "Sean Oliphant", "Kevin Quiggley", "Amanda Spitterton-Watts", "Matt", "Isla Martin", "...less"],
        "Edition Language": "English",
        "Literary Awards": ["Georgia Peach Book Award Nominee for Honor book (2012)", "Pennsylvania Young Readers' Choice Award Nominee for Young Adults (2013)", "Milwaukee County Teen Book Award Nominee (2012)", "The Inky Awards Nominee for Silver Inky (2011)", "Lincoln Award Nominee (2013)", "...more", "Cybils Award Nominee for Young Adult Fiction (2011)", "Goodreads Choice Award Nominee for Goodreads Author, Young Adult Fiction  (2010)", "...less"]
    },
    "book_format_type": "Hardcover",
    "book_cover_url": "https://images.gr-assets.com/books/1358271931l/6936382.jpg",
    "author": "Stephanie Perkins",
    "title": "\n      Anna and the French Kiss\n      ",
    "number_of_pages": "372 pages",
    "publish_info": "\n            Published\n        December 2nd 2010\n         by Dutton Juvenile\n\n      ",
    "genres_info": ["Young Adult", "5,330 users", "Romance", "4,393 users", "Contemporary", "3,260 users", "Womens Fiction", "Chick Lit", "1,093 users"]
}, {
    "book_description": ["Though the Greek and Roman crewmembers of the ", " have made progress in their many quests, they still seem no closer to defeating the earth mother, Gaea. Her giants have risen—all of them—and they're stronger than ever. They must be stopped before the Feast of Spes, when Gaea plans to have two demigods sacrificed in Athens. She needs their blood—the blood of Olympus—in order to wake.", "The demigods are having more frequent visions of a terrible battle at Camp Half-Blood. The Roman legion from Camp Jupiter, led by Octavian, is almost within striking distance. Though it is tempting to take the Athena Parthenos to Athens to use as a secret weapon, the friends know that the huge statue belongs back on Long Island, where it \"might\" be able to stop a war between the two camps.", "The Athena Parthenos will go west; the ", " will go east. The gods, still suffering from multiple personality disorder, are useless. How can a handful of young demigods hope to persevere against Gaea's army of powerful giants? As dangerous as it is to head to Athens, they have no other option. They have sacrificed too much already. And if Gaea wakes, it is game over."],
    "info": {
        "ISBN": "(ISBN13: 9781423146735)",
        "Series": "The Heroes of Olympus #5",
        "setting": ["Ithaca", "Pompeii", "Olympus", "…more", "Évora", "Long Island, New York", "Pylos", "Sparta", "San Juan", "Buford, South Carolina", "Delos, Cyclades", "Athens", "…less"],
        "Original Title": "The Blood of Olympus",
        "Characters": ["Leo Valdez", "Nico di Angelo", "Thalia Grace", "Annabeth Chase", "Grover Underwood", "...more", "Reyna", "Rachel Elizabeth Dare", "Jason Grace", "Piper McLean", "Hazel Levesque", "Frank Zhang", "Will Solace", "Percy Jackson", "...less"],
        "Edition Language": "English",
        "Literary Awards": ["Goodreads Choice Award for Middle Grade & Children's (2014)"]
    },
    "book_format_type": "Hardcover",
    "book_cover_url": "https://images.gr-assets.com/books/1464201441l/18705209.jpg",
    "author": "Rick Riordan",
    "title": "\n      The Blood of Olympus\n      ",
    "number_of_pages": "516 pages",
    "publish_info": "\n            Published\n        October 7th 2014\n         by Disney-Hyperion Books\n\n      ",
    "genres_info": ["Fantasy", "3,199 users", "Fantasy", "Mythology", "1,529 users", "Young Adult", "1,512 users", "Adventure", "540 users"]
}, {
    "book_description": ["In an alternate United States, love has been declared a dangerous disease, and the government forces everyone who reaches eighteen to have a procedure called the Cure. Living with her aunt, uncle, and cousins in Portland, Maine, Lena Haloway is very much looking forward to being cured and living a safe, predictable life. She watched love destroy her mother and isn't about to make the same mistake.", "But with ninety-five days left until her treatment, Lena meets enigmatic Alex, a boy from the \"Wilds\" who lives under the government's radar. What will happen if they do the unthinkable and fall in love?"],
    "info": {
        "ISBN": "(ISBN13: 9780061726835)",
        "Series": "Delirium #1",
        "setting": ["Portland, Maine"],
        "Original Title": "Delirium",
        "Characters": ["Hana Tate", "Magdalena \"Lena\" Ella Haloway-Tiddle", "Alex Sheathes", "Carol Tiddle", "Grace Tiddle"],
        "Edition Language": "English",
        "Literary Awards": ["Buxtehuder Bulle (2011)", "Pennsylvania Young Readers' Choice Award Nominee for Young Adults (2013)", "Goodreads Choice Award Nominee for Best Young Adult Fantasy & Science Fiction (2011)", "Missouri Gateway Readers Award Nominee (2014)"]
    },
    "book_format_type": "Paperback",
    "book_cover_url": "https://images.gr-assets.com/books/1327890411l/11614718.jpg",
    "author": "Lauren Oliver",
    "title": "\n      Delirium\n      ",
    "number_of_pages": "441 pages",
    "publish_info": "\n            Published\n        February 7th 2012\n         by HarperCollins\n\n            ",
    "genres_info": ["Romance", "2,759 users", "Fantasy", "1,068 users", "Fiction", "1,037 users", "Young Adult", "Teen", "416 users"]
}, {
    "book_description": ["Cinder, the cyborg mechanic, returns in the second thrilling installment of the bestselling Lunar Chronicles. She’s trying to break out of prison—even though if she succeeds, she’ll be the Commonwealth’s most wanted fugitive. ", "Halfway around the world, Scarlet Benoit’s grandmother is missing. When Scarlet encounters Wolf, a street fighter who may have information as to her grandmother’s whereabouts, she is loath to trust this stranger, but is inexplicably drawn to him, and he to her. As Scarlet and Wolf unravel one mystery, they encounter another when they meet Cinder. Now, all of them must stay one step ahead of the vicious Lunar Queen Levana, who will do anything for the handsome Prince Kai to become her husband, her king, her ", "."],
    "info": {
        "ISBN": "(ISBN13: 9780312642969)",
        "Series": "The Lunar Chronicles #2",
        "setting": ["Toulouse", "Paris", "New Beijing", "…more", "Rieux", "…less"],
        "Original Title": "Scarlet",
        "Characters": ["Linh Cinder", "Queen Levana", "Scarlet Benoit", "Ze’ev \"Wolf\" Kesley", "Emperor Kai", "...more", "Ran Kesley", "Carswell Thorne", "Iko", "Aimery Park", "Linh Adri", "Linh Pearl", "Michelle Benoit", "...less"],
        "Edition Language": "English",
        "Literary Awards": ["Goodreads Choice Award Nominee for Best Young Adult Fantasy & Science Fiction (2013)", "Premio El Templo de las Mil Puertas Nominee for Mejor novela extranjera perteneciente a saga (2013)"]
    },
    "book_format_type": "Hardcover",
    "book_cover_url": "https://images.gr-assets.com/books/1470056982l/13206760.jpg",
    "author": "Marissa Meyer",
    "title": "\n      Scarlet\n      ",
    "number_of_pages": "454 pages",
    "publish_info": ", ",
    "genres_info": ["Fantasy", "518 users", "Young Adult", "418 users", "Young Adult", "Teen", "335 users", "Science Fiction", "297 users", "Fantasy", "Fairy Tales", "287 users"]
}, {
    "book_description": ["Despite their differences, sisters Vianne and Isabelle have always been close. Younger, bolder Isabelle lives in Paris while Vianne is content with life in the French countryside with her husband Antoine and their daughter. But when the Second World War strikes, Antoine is sent off to fight and Vianne finds herself isolated so Isabelle is sent by their father to help her. ", "As the war progresses, the sisters' relationship and strength are tested. With life changing in unbelievably horrific ways, Vianne and Isabelle will find themselves facing frightening situations and responding in ways they never thought possible as bravery and resistance take different forms in each of their actions."],
    "info": {
        "ISBN": "(ISBN13: 9780312577223)",
        "setting": ["France"],
        "Original Title": "The Nightingale",
        "Characters": ["Vianne Mauriac", "Isabelle Rossignol"],
        "Edition Language": "English",
        "Literary Awards": ["Audie Award for Fiction (2016)", "Goodreads Choice Award for Historical Fiction (2015)", "International DUBLIN Literary Award Nominee (2017)"]
    },
    "book_format_type": "Hardcover",
    "book_cover_url": "https://images.gr-assets.com/books/1451446316l/21853621.jpg",
    "author": "Kristin Hannah",
    "title": "\n      The Nightingale\n",
    "number_of_pages": "440 pages",
    "publish_info": ", ",
    "genres_info": ["Historical", "5,348 users", "Fiction", "2,312 users", "War", "World War II", "637 users", "War", "554 users"]
}, {
    "book_description": ["Khaled Hosseini, the #1 ", "–bestselling author of ", " and ", ", has written a new novel about how we love, how we take care of one another, and how the choices we make resonate through generations. ", "In this tale revolving around not just parents and children but brothers and sisters, cousins and caretakers, Hosseini explores the many ways in which families nurture, wound, betray, honor, and sacrifice for one another; and how often we are surprised by the actions of those closest to us, at the times that matter most. ", "Following its characters and the ramifications of their lives and choices and loves around the globe—from Kabul to Paris to San Francisco to the Greek island of Tinos—the story expands gradually outward, becoming more emotionally complex and powerful with each turning page."],
    "info": {
        "ISBN": "(ISBN13: 9781594631764)",
        "setting": ["Kabul", "California", "Paris", "…more", "Tinos", "…less"],
        "Original Title": "And The Mountains Echoed",
        "Characters": ["Julien", "Abdullah", "Pari", "Suleiman Wahdati", "Nila Wahdati", "...more", "Nabi", "Parwana", "Saboor", "Timur Bashiri", "Idris Bashiri", "Masooma", "Eric Lacombe", "Markos Varvaris", "Thalia", "...less"],
        "Edition Language": "English",
        "Literary Awards": ["Goodreads Choice Award for Fiction (2013)", "DSC Prize Nominee for South Asian Literature  for Longlist (2015)"]
    },
    "book_format_type": "Hardcover",
    "book_cover_url": "https://images.gr-assets.com/books/1358190204l/16115612.jpg",
    "author": "Khaled Hosseini",
    "title": "\n      And the Mountains Echoed\n",
    "number_of_pages": "404 pages",
    "publish_info": "\n            Published\n        May 21st 2013\n         by Riverhead Books\n\n            ",
    "genres_info": ["Historical", "1,003 users", "Contemporary", "374 users", "Adult Fiction", "243 users", "Adult", "233 users"]
}, {
    "book_description": ["Speak again the ancient oaths,", "And return to men the Shards they once bore.", "Roshar is a world of stone swept by tempests that shape ecology and civilization. Animals and plants retract; cities are built in shelter. In centuries since ten orders of Knights fell, their Shardblade swords and Shardplate armor still transform men into near-invincible warriors. Wars are fought for them, and won by them.", "In one such war on the ruined Shattered Plains, slave Kaladin struggles to save his men and fathom leaders who deem them expendable, in senseless wars where ten armies fight separately against one foe. ", "Brightlord Dalinar Kholin commands one of those other armies. Fascinated by the ancient text named", " and troubled by visions of ancient times, he doubts his sanity.", "Across the ocean, Shallan trains under eminent scholar and notorious heretic, Dalinar’s niece Jasnah. Though Shallan genuinely loves learning, she plans a daring theft. Her research hints at secrets of the Knights Radiant and the true cause of the war."],
    "info": {
        "ISBN": "(ISBN13: 9780765326355)",
        "Series": "The Stormlight Archive #1",
        "setting": ["Roshar"],
        "Original Title": "The Way of Kings",
        "Characters": ["Kaladin Stormblessed", "Dalinar Kholin", "Shallan Davar"],
        "Edition Language": "English",
        "Literary Awards": ["David Gemmell Legend Award for Best Fantasy Novel (2011)", "Whitney Award for Best Novel (2010)", "Goodreads Choice Award Nominee for Goodreads Author, Favorite Book, Fantasy  (2010)"]
    },
    "book_format_type": "Hardcover",
    "book_cover_url": "https://images.gr-assets.com/books/1388184640l/7235533.jpg",
    "author": "Brandon Sanderson",
    "title": "\n      The Way of Kings\n      ",
    "number_of_pages": "1007 pages",
    "publish_info": "\n            Published\n        August 31st 2010\n         by Tor Books\n\n      ",
    "genres_info": ["Fantasy", "8,927 users", "Fiction", "892 users", "Fantasy", "Epic Fantasy", "801 users", "Fantasy", "High Fantasy", "430 users"]
}, {
    "book_description": ["In the Society, officials decide. Who you love. Where you work. When you die.", "Cassia has always trusted their choices. It’s hardly any price to pay for a long life, the perfect job, the ideal mate. So when her best friend appears on the Matching screen, Cassia knows with complete certainty that he is the one…until she sees another face flash for an instant before the screen fades to black. Now Cassia is faced with impossible choices: between Xander and Ky, between the only life she’s known and a path no one else has ever dared follow—between perfection and passion.", " is a story for right now and storytelling with the resonance of a classic."],
    "info": {
        "ISBN": "(ISBN13: 9780525423645)",
        "Series": "Matched #1",
        "Literary Awards": ["Teen Buckeye Book Award (2012)", "Pennsylvania Young Readers' Choice Award for Young Adults (2012)", "Publishers Weekly's Best Children's Books of the Year for Fiction (2010)", "Lincoln Award Nominee (2013)", "Literaturpreis der Jury der jungen Leser for Jugendbuch (2011)", "...more", "Carnegie Medal Nominee (2012)", "Missouri Gateway Readers Award Nominee (2013)", "...less"],
        "Characters": ["Cassia Reyes", "Ky Markham", "Xander Carrow"],
        "Edition Language": "English",
        "Original Title": "Matched"
    },
    "book_format_type": "Hardcover",
    "book_cover_url": "https://images.gr-assets.com/books/1367706191l/7735333.jpg",
    "author": "Ally Condie",
    "title": "\n      Matched\n      ",
    "number_of_pages": "369 pages",
    "publish_info": "\n            Published\n        November 30th 2010\n         by Dutton Books for Young Readers\n\n      ",
    "genres_info": ["Young Adult", "6,900 users", "Science Fiction", "Dystopia", "5,475 users", "Romance", "2,805 users"]
}, {
    "book_description": ["Feyre's survival rests upon her ability to hunt and kill – the forest where she lives is a cold, bleak place in the long winter months. So when she spots a deer in the forest being pursued by a wolf, she cannot resist fighting it for the flesh. But to do so, she must kill the predator and killing something so precious comes at a price ...", "Dragged to a magical kingdom for the murder of a faerie, Feyre discovers that her captor, his face obscured by a jewelled mask, is hiding far more than his piercing green eyes would suggest. Feyre's presence at the court is closely guarded, and as she begins to learn why, her feelings for him turn from hostility to passion and the faerie lands become an even more dangerous place. Feyre must fight to break an ancient curse, or she will lose him forever."],
    "info": {
        "ISBN": "(ISBN13: 9781619634442)",
        "Series": "A Court of Thorns and Roses #1",
        "Literary Awards": ["Lincoln Award Nominee (2017)", "Goodreads Choice Award Nominee for Young Adult Fantasy & Science Fiction (2015)"],
        "Characters": ["Feyre", "Tamlin", "Lucien", "Rhysand"],
        "Edition Language": "English",
        "Original Title": "A Court of Thorns and Roses"
    },
    "book_format_type": "Hardcover",
    "book_cover_url": "https://images.gr-assets.com/books/1491595796l/16096824.jpg",
    "author": "Sarah J. Maas",
    "title": "\n      A Court of Thorns and Roses\n      ",
    "number_of_pages": "421 pages",
    "publish_info": ", ",
    "genres_info": ["Fantasy", "7,993 users", "Young Adult", "2,829 users", "Romance", "2,564 users", "New Adult", "1,438 users", "Retellings", "915 users", "Fantasy", "Magic", "871 users", "Fairies", "Fae", "627 users", "Fiction", "572 users", "Fantasy", "Fairy Tales", "485 users", "Fantasy", "Paranormal", "484 users"]
}, {
    "book_description": ["Henrietta Lacks, as HeLa, is known to present-day scientists for her cells from cervical cancer. She was a poor Southern tobacco farmer who worked the same land as her slave ancestors, yet her cells were taken without her knowledge and still live decades after her death. Cells descended from her may weigh more than 50M metric tons. ", "HeLa cells were vital for developing the polio vaccine; uncovered secrets of cancer, viruses, and the atom bomb’s effects; helped lead to important advances like in vitro fertilization, cloning, and gene mapping; and have been bought and sold by the billions. Yet Henrietta Lacks was buried in an unmarked grave.", "The journey starts in the “colored” ward of Johns Hopkins Hospital in the 1950s, her small, dying hometown of Clover, Virginia — wooden slave quarters, faith healings, and voodoo. Today are stark white laboratories with freezers full of HeLa cells, East Baltimore children and grandchildren live in obscurity, see no profits, and feel violated. The dark history of experimentation on African Americans helped lead to the birth of bioethics, and legal battles over whether we control the stuff we are made of."],
    "info": {
        "ISBN": "(ISBN13: 9781400052172)",
        "setting": ["Baltimore, Maryland", "Clover, Virginia"],
        "Original Title": "The Immortal Life of Henrietta Lacks",
        "Characters": ["Henrietta Lacks"],
        "Edition Language": "English",
        "Literary Awards": ["Ambassador Book Award for American Studies (2011)", "Audie Award for Nonfiction (2011)", "Chicago Tribune Heartland Prize for Nonfiction (2010)", "Wellcome Book Prize (2010)", "Puddly Award for Nonfiction (2011)", "...more", "Goodreads Choice Award for  Nonfiction and Debut Author, Nominee for Favorite Book, Favorite Heroine (2010)", "...less"]
    },
    "book_format_type": "Hardcover",
    "book_cover_url": "https://images.gr-assets.com/books/1327878144l/6493208.jpg",
    "author": "Rebecca Skloot",
    "title": "\n      The Immortal Life of Henrietta Lacks\n",
    "number_of_pages": "370 pages",
    "publish_info": "\n            Published\n        February 2nd 2010\n         by Crown Publishing Group\n\n      ",
    "genres_info": ["Nonfiction", "7,831 users", "Science", "3,264 users", "Biography", "2,056 users", "History", "1,970 users", "Health", "Medicine", "526 users", "Book Club", "502 users"]
}, {
    "book_description": ["I have a gift", "I'm more than human", "My touch is power", "I will fight back", "Juliette hasn’t touched anyone in exactly 264 days.", "The last time she did, it was an accident, but The Reestablishment locked her up for murder. No one knows why Juliette’s touch is fatal. As long as she doesn’t hurt anyone else, no one really cares. The world is too busy crumbling to pieces to pay attention to a 17-year-old girl. Diseases are destroying the population, food is hard to find, birds don’t fly anymore, and the clouds are the wrong color.", "The Reestablishment said their way was the only way to fix things, so they threw Juliette in a cell. Now so many people are dead that the survivors are whispering war – and The Reestablishment has changed its mind. Maybe Juliette is more than a tortured soul stuffed into a poisonous body. Maybe she’s exactly what they need right now.", "Juliette has to make a choice: Be a weapon. Or be a warrior."],
    "info": {
        "ISBN": "(ISBN13: 9780062085481)",
        "Series": "Shatter Me #1",
        "Literary Awards": ["Arab American Book Award Nominee for Children's/Young Adult (2013)"],
        "Characters": ["Adam Kent", "Juliette Ferrars", "Aaron Warner Anderson", "Kenji Kishimoto", "Castle"],
        "Edition Language": "English",
        "Original Title": "Shatter Me (Shatter Me, #1)"
    },
    "book_format_type": "Hardcover",
    "book_cover_url": "https://images.gr-assets.com/books/1310649047l/10429045.jpg",
    "author": "Tahereh Mafi",
    "title": "\n      Shatter Me\n      ",
    "number_of_pages": "338 pages",
    "publish_info": "\n            Published\n        November 15th 2011\n         by Harper\n\n      ",
    "genres_info": ["Young Adult", "3,725 users", "Science Fiction", "Dystopia", "3,267 users", "Romance", "1,785 users", "Fantasy", "1,653 users", "Fantasy", "Paranormal", "896 users", "Science Fiction", "749 users", "Fiction", "520 users", "Did Not Finish", "316 users", "Fantasy", "Supernatural", "274 users", "Apocalyptic", "Post Apocalyptic", "230 users"]
}, {
    "book_description": ["Around the world, black hand prints are appearing on doorways, scorched there by winged strangers who have crept through a slit in the sky.", "In a dark and dusty shop, a devil’s supply of human teeth grows dangerously low.", "And in the tangled lanes of Prague, a young art student is about to be caught up in a brutal otherworldly war.", "Meet Karou. She fills her sketchbooks with monsters that may or may not be real, she’s prone to disappearing on mysterious \"errands\", she speaks many languages - not all of them human - and her bright blue hair ", " grows out of her head that color. Who is she? That is the question that haunts her, and she’s about to find out.", "When beautiful, haunted Akiva fixes fiery eyes on her in an alley in Marrakesh, the result is blood and starlight, secrets unveiled, and a star-crossed love whose roots drink deep of a violent past. But will Karou live to regret learning the truth about herself?"],
    "info": {
        "ISBN": "(ISBN13: 9780316134026)",
        "Series": "Daughter of Smoke & Bone #1",
        "setting": ["Prague (Praha)", "Marrakech (Marrakesh)", "Eretz"],
        "Original Title": "Daughter of Smoke & Bone",
        "Characters": ["Madrigal", "Karou", "Akiva", "Kazimir", "Zuzana", "...more", "Issa", "Brimstone", "Thiago", "Mik", "Ziri", "...less"],
        "Edition Language": "English",
        "Literary Awards": ["Audie Award for Fantasy (2012)", "Milwaukee County Teen Book Award Nominee (2013)", "Children's Choice Book Award Nominee for Teen Choice Book of the Year (2012)", "The Inky Awards Nominee for Silver Inky (2012)", "Oregon Spirit Book Award for Young Adult (2011)", "...more", "Lincoln Award Nominee (2014)", "Andre Norton Award Nominee for Young Adult Science Fiction and Fantasy (2011)", "Goodreads Choice Award Nominee for Favorite Book of 2011 and Best Young Adult Fantasy & Science Fiction (2011)", "The Inky Awards Shortlist for Silver Inky (2012)", "Missouri Gateway Readers Award Nominee (2014)", "Premio El Templo de las Mil Puertas Nominee for Mejor novela extranjera perteneciente a saga (2012)", "...less"]
    },
    "book_format_type": "Hardcover",
    "book_cover_url": "https://images.gr-assets.com/books/1461353773l/8490112.jpg",
    "author": "Laini Taylor",
    "title": "\n      Daughter of Smoke & Bone\n      ",
    "number_of_pages": "422 pages",
    "publish_info": ", ",
    "genres_info": ["Fantasy", "9,076 users", "Young Adult", "6,012 users", "Romance", "2,534 users", "Fantasy", "Paranormal", "2,170 users", "Paranormal", "Angels", "1,746 users"]
}, {
    "book_description": ["In this dazzling and long-awaited conclusion to the acclaimed Mortal Instruments series, Clary and her friends fight the greatest evil they have ever faced: Clary's own brother.", "Sebastian Morgenstern is on the move, systematically turning Shadowhunter against Shadowhunter. Bearing the Infernal Cup, he transforms Shadowhunters into creatures out of nightmare, tearing apart families and lovers as the ranks of his Endarkened army swell.", "The embattled Shadowhunters withdraw to Idris - but not even the famed demon towers of Alicante can keep Sebastian at bay. And with the Nephilim trapped in Idris, who will guard the world against demons?", "When one of the greatest betrayals the Nephilim have ever known is revealed, Clary, Jace, Isabelle, Simon, and Alec must flee - even if their journey takes them deep into the demon realms, where no Shadowhunter has set foot before, and from which no human being has ever returned...", "Love will be sacrificed and lives lost in the terrible battle for the fate of the word in the thrilling final installment of the classic urban fantasy series The Mortal Instruments!"],
    "info": {
        "ISBN": "(ISBN13: 9781481426305)",
        "Series": "The Mortal Instruments #6",
        "setting": ["New York City, New York", "Alicante, Idris"],
        "Original Title": "City of Heavenly Fire",
        "Characters": ["Alec Lightwood", "Jonathan \"Jace\" Wayland", "Isabelle Lightwood", "Theresa Gray", "Magnus Bane", "...more", "Simon Lewis", "Jordan Kyle", "Maia Roberts", "Jocelyn Fray", "Luke Garroway", "Sebastian Morgenstern", "Clarissa \"Clary\" Fray", "...less"],
        "Edition Language": "English",
        "Literary Awards": ["Goodreads Choice Award for Young Adult Fantasy (2014)", "Premio El Templo de las Mil Puertas Nominee for Mejor novela extranjera perteneciente a saga (2014)"]
    },
    "book_format_type": "Hardcover",
    "book_cover_url": "https://images.gr-assets.com/books/1460477794l/8755785.jpg",
    "author": "Cassandra Clare",
    "title": "\n      City of Heavenly Fire\n      ",
    "number_of_pages": "725 pages",
    "publish_info": "\n            Published\n        May 27th 2014\n         by Margaret K. McElderry\n\n      ",
    "genres_info": ["Fantasy", "4,103 users", "Young Adult", "3,188 users", "Fantasy", "Paranormal", "1,308 users", "Romance", "1,198 users"]
}, {
    "book_description": ["This is a world divided by blood - red or silver.", "The Reds are commoners, ruled by a Silver elite in possession of god-like superpowers. And to Mare Barrow, a seventeen-year-old Red girl from the poverty-stricken Stilts, it seems like nothing will ever change.", "That is, until she finds herself working in the Silver Palace. Here, surrounded by the people she hates the most, Mare discovers that, despite her red blood, she possesses a deadly power of her own. One that threatens to destroy the balance of power.", "Fearful of Mare's potential, the Silvers hide her in plain view, declaring her a long-lost Silver princess, now engaged to a Silver prince. Despite knowing that one misstep would mean her death, Mare works silently to help the Red Guard, a militant resistance group, and bring down the Silver regime.", "But this is a world of betrayal and lies, and Mare has entered a dangerous dance - Reds against Silvers, prince against prince, and Mare against her own heart..."],
    "info": {
        "ISBN": "(ISBN13: 9781409151173)",
        "Series": "Red Queen #1",
        "Literary Awards": ["South Carolina Book Award for Young Adult (2017)", "Lincoln Award (2017)", "Goodreads Choice Award for Debut Goodreads Author, and Nominee for Young Adult Fantasy & Science Fiction (2015)"],
        "Characters": ["Kilorn Warren", "Gisa Barrow", "Tiberias Calore \"Cal\" VII", "Mare Molly Barrow", "Maven Calore", "...more", "Evangeline Samos", "Diana Farley", "Tiberias Calore VI", "Elara Merandus", "Julian Jacos", "Lucas Samos", "...less"],
        "Edition Language": "English",
        "Original Title": "Red Queen"
    },
    "book_format_type": "Hardcover",
    "book_cover_url": "https://images.gr-assets.com/books/1411472322l/17878931.jpg",
    "author": "Victoria Aveyard",
    "title": "\n      Red Queen\n      ",
    "number_of_pages": "383 pages",
    "publish_info": "\n            Published\n        February 10th 2015\n         by Orion\n\n      ",
    "genres_info": ["Fantasy", "3,994 users", "Young Adult", "2,557 users", "Science Fiction", "Dystopia", "1,096 users", "Fiction", "915 users"]
}, {
    "book_description": ["Feyre survived Amarantha's clutches to return to the Spring Court—but at a steep cost. Though she now has the powers of the High Fae, her heart remains human, and it can't forget the terrible deeds she performed to save Tamlin's people.", "Nor has Feyre forgotten her bargain with Rhysand, High Lord of the feared Night Court. As Feyre navigates its dark web of politics, passion, and dazzling power, a greater evil looms—and she might be key to stopping it. But only if she can harness her harrowing gifts, heal her fractured soul, and decide how she wishes to shape her future—and the future of a world cleaved in two.", "With more than a million copies sold of her beloved Throne of Glass series, Sarah J. Maas's masterful storytelling brings this second book in her seductive and action-packed series to new heights."],
    "info": {
        "Series": "A Court of Thorns and Roses #2",
        "Edition Language": "English",
        "Original Title": "A Court of Mist and Fury",
        "Literary Awards": ["Goodreads Choice Award for Young Adult Fantasy & Science Fiction (2016)"]
    },
    "book_format_type": "Kindle Edition",
    "book_cover_url": "https://images.gr-assets.com/books/1485259138l/17927395.jpg",
    "author": "Sarah J. Maas",
    "title": "\n      A Court of Mist and Fury\n      ",
    "number_of_pages": "626 pages",
    "publish_info": "\n            Published\n        May 3rd 2016\n         by Bloomsbury USA Childrens\n\n      ",
    "genres_info": ["Fantasy", "5,284 users", "Romance", "1,757 users", "Young Adult", "1,563 users", "New Adult", "1,182 users", "Fantasy", "Magic", "640 users", "Fairies", "Fae", "484 users", "Fantasy", "High Fantasy", "382 users", "Retellings", "363 users", "Fiction", "344 users", "Fantasy", "Paranormal", "286 users"]
}, {
    "book_description": ["Sussex, England. A middle-aged man returns to his childhood home to attend a funeral. Although the house he lived in is long gone, he is drawn to the farm at the end of the road, where, when he was seven, he encountered a most remarkable girl, Lettie Hempstock, and her mother and grandmother. He hasn't thought of Lettie in decades, and yet as he sits by the pond (a pond that she'd claimed was an ocean) behind the ramshackle old farmhouse, the unremembered past comes flooding back. And it is a past too strange, too frightening, too dangerous to have happened to anyone, let alone a small boy.", "Forty years earlier, a man committed suicide in a stolen car at this farm at the end of the road. Like a fuse on a firework, his death lit a touchpaper and resonated in unimaginable ways. The darkness was unleashed, something scary and thoroughly incomprehensible to a little boy. And Lettie—magical, comforting, wise beyond her years—promised to protect him, no matter what.", "A groundbreaking work from a master, ", " is told with a rare understanding of all that makes us human, and shows the power of stories to reveal and shelter us from the darkness inside and out. It is a stirring, terrifying, and elegiac fable as delicate as a butterfly's wing and as menacing as a knife in the dark."],
    "info": {
        "ISBN": "(ISBN13: 9780062255655)",
        "setting": ["Sussex, England"],
        "Original Title": "The Ocean at the End of the Lane",
        "Characters": ["Lettie Hempstock", "Ursula Monkton", "The Nameless Boy", "Ginnie Hempstock", "Old Mrs. Hempstock"],
        "Edition Language": "English",
        "Literary Awards": ["Nebula Award Nominee for Best Novel (2013)", "Locus Award for Best Fantasy Novel (2014)", "World Fantasy Award Nominee for Best Novel (2014)", "Mythopoeic Fantasy Award Nominee for Adult Literature (2014)", "Specsavers National Book Award for Book of the Year (2013)", "...more", "Goodreads Choice Award for Best Fantasy (2013)", "...less"]
    },
    "book_format_type": "Hardcover",
    "book_cover_url": "https://images.gr-assets.com/books/1497098563l/15783514.jpg",
    "author": "Neil Gaiman",
    "title": "\n      The Ocean at the End of the Lane\n",
    "number_of_pages": "181 pages",
    "publish_info": "\n            Published\n        June 18th 2013\n         by William Morrow Books\n\n      ",
    "genres_info": ["Fiction", "4,924 users", "Fantasy", "2,332 users", "Horror", "1,055 users", "Magical Realism", "964 users", "Adult", "783 users"]
}, {
    "book_description": ["At the conclusion of The Mark of Athena, Annabeth and Percy tumble into a pit leading straight to the Underworld. The other five demigods have to put aside their grief and follow Percy’s instructions to find the mortal side of the Doors of Death. If they can fight their way through the Gaea’s forces, and Percy and Annabeth can survive the House of Hades, then the Seven will be able to seal the Doors both sides and prevent the giants from raising Gaea. But, Leo wonders, if the Doors are sealed, how will Percy and Annabeth be able to escape?", "They have no choice. If the demigods don’t succeed, Gaea’s armies will never die. They have no time. In about a month, the Romans will march on Camp Half-Blood. The stakes are higher than ever in this adventure that dives into the depths of Tartarus."],
    "info": {
        "ISBN": "(ISBN13: 9781423146728)",
        "Series": "The Heroes of Olympus #4",
        "setting": ["Rome", "Venice", "Split", "…more", "Bologna", "Valletta", "Epirus", "…less"],
        "Original Title": "The House of Hades",
        "Characters": ["Nico di Angelo"],
        "Edition Language": "English",
        "Literary Awards": ["Goodreads Choice Award for Middle Grade & Children's (2013)"]
    },
    "book_format_type": "Hardcover",
    "book_cover_url": "https://images.gr-assets.com/books/1464201430l/12127810.jpg",
    "author": "Rick Riordan",
    "title": "\n      The House of Hades\n      ",
    "number_of_pages": "597 pages",
    "publish_info": "\n            Published\n        October 8th 2013\n         by Disney-Hyperion Books\n\n      ",
    "genres_info": ["Fantasy", "3,951 users", "Young Adult", "1,874 users", "Fantasy", "Mythology", "1,833 users"]
}, {
    "book_description": ["What was once the western United States is now home to the Republic, a nation perpetually at war with its neighbors. Born into an elite family in one of the Republic's wealthiest districts, fifteen-year-old June is a prodigy being groomed for success in the Republic's highest military circles. Born into the slums, fifteen-year-old Day is the country's most wanted criminal. But his motives may not be as malicious as they seem.", "From very different worlds, June and Day have no reason to cross paths—until the day June's brother, Metias, is murdered and Day becomes the prime suspect. Caught in the ultimate game of cat and mouse, Day is in a race for his family's survival, while June seeks to avenge Metias's death. But in a shocking turn of events, the two uncover the truth of what has really brought them together, and the sinister lengths their country will go to keep its secrets."],
    "info": {
        "ISBN": "(ISBN13: 9780399256752)",
        "Series": "Legend #1",
        "setting": ["Los Angeles, The Republic of America"],
        "Original Title": "Legend",
        "Characters": ["June Iparis", "Daniel Altan Wing", "Metias Iparis", "Commander Jameson", "Thomas Bryant", "...more", "Tess", "Kaede", "...less"],
        "Edition Language": "English",
        "Literary Awards": ["Rebecca Caudill Young Reader's Book Award Nominee (2015)", "Milwaukee County Teen Book Award Nominee (2013)", "The Inky Awards Nominee for Silver Inky (2012)", "Lincoln Award Nominee (2014)", "Goodreads Choice Award Nominee for Young Adult Fantasy and Science Fiction (2012)"]
    },
    "book_format_type": "Hardcover",
    "book_cover_url": "https://images.gr-assets.com/books/1501368160l/9275658.jpg",
    "author": "Marie Lu",
    "title": "\n      Legend\n      ",
    "number_of_pages": "305 pages",
    "publish_info": "\n            Published\n        November 29th 2011\n         by Putnam Juvenile\n\n      ",
    "genres_info": ["Young Adult", "2,753 users", "Romance", "1,474 users", "Fantasy", "1,133 users", "Science Fiction", "1,043 users", "Fiction", "958 users", "Adventure", "546 users"]
}, {
    "book_description": ["Annabeth returns in the third installment of the biggest series yet from Rick Riordan, author of the #1 ", " best-selling Heroes of Olympus, Kane Chronicles, and Percy Jackson and the Olympians series.", "In ", ", Percy, Hazel, and Frank met in Camp Jupiter, the Roman equivalent of Camp Half-blood, and traveled to the land beyond the gods to complete a dangerous quest. The third book in the Heroes of Olympus series will unite them with Jason, Piper, and Leo. But they number only six—who will complete the Prophecy of Seven?", "The Greek and Roman demigods will have to cooperate in order to defeat the giants released by the Earth Mother, Gaea. Then they will have to sail together to the ancient land—Greece itself—to find the Doors of Death. What exactly are the Doors of Death? Much of the prophecy remains a mystery...", "With old friends and new friends joining forces, a marvelous ship, fearsome foes, and an exotic setting, ", " promises to be another unforgettable adventure by master storyteller Rick Riordan."],
    "info": {
        "ISBN": "(ISBN13: 9781423140603)",
        "Series": "The Heroes of Olympus #3",
        "setting": ["Oakland Hills, California", "Atlanta, Georgia", "Rome", "…more", "Kansas", "Charleston, South Carolina", "Salt Lake City, Utah", "…less"],
        "Original Title": "The Mark of Athena",
        "Characters": ["Leo Valdez", "Nico di Angelo", "Annabeth Chase", "Jason Grace", "Piper McLean", "...more", "Hazel Levesque", "Frank Zhang", "Percy Jackson", "...less"],
        "Edition Language": "English",
        "Literary Awards": ["Goodreads Choice Award for Best Middle Grade & Children's (2012)"]
    },
    "book_format_type": "Hardcover",
    "book_cover_url": "https://images.gr-assets.com/books/1464201354l/12127750.jpg",
    "author": "Rick Riordan",
    "title": "\n      The Mark of Athena\n      ",
    "number_of_pages": "586 pages",
    "publish_info": "\n            Published\n        October 2nd 2012\n         by Disney-Hyperion\n\n      ",
    "genres_info": ["Fantasy", "3,767 users", "Young Adult", "2,136 users", "Fantasy", "Mythology", "2,053 users"]
}, {
    "book_description": ["From the author of the", " bestseller ", ". ", "Cath is a Simon Snow fan.", "Okay, the whole world is a Simon Snow fan...", "But for Cath, being a fan is her life—and she’s really good at it. She and her twin sister, Wren, ensconced themselves in the Simon Snow series when they were just kids; it’s what got them through their mother leaving. Reading. Rereading. Hanging out in Simon Snow forums, writing Simon Snow fan fiction, dressing up like the characters for every movie premiere.", "Cath’s sister has mostly grown away from fandom, but Cath can’t let go. She doesn’t want to.", "Now that they’re going to college, Wren has told Cath she doesn’t want to be roommates. Cath is on her own, completely outside of her comfort zone. She’s got a surly roommate with a charming, always-around boyfriend, a fiction-writing professor who thinks fan fiction is the end of the civilized world, a handsome classmate who only wants to talk about words... And she can’t stop worrying about her dad, who’s loving and fragile and has never really been alone.", "For Cath, the question is: Can she do this? Can she make it without Wren holding her hand? Is she ready to start living her own life? Writing her own stories?", "And does she even want to move on if it means leaving Simon Snow behind?"],
    "info": {
        "setting": ["Lincoln, Nebraska", "Omaha, Nebraska"],
        "Edition Language": "English",
        "Literary Awards": ["Milwaukee County Teen Book Award Nominee (2015)", "The Inky Awards Nominee for Silver Inky (2015)", "Lincoln Award Nominee (2016)", "Goodreads Choice Award Nominee for Young Adult Fiction (2013)", "Premio El Templo de las Mil Puertas Nominee for Mejor novela extranjera independiente (2014)"],
        "Characters": ["Wren", "Levi", "Cath Avery"]
    },
    "book_format_type": "Kindle Edition",
    "book_cover_url": "https://images.gr-assets.com/books/1499565420l/16068905.jpg",
    "author": "Rainbow Rowell",
    "title": "\n      Fangirl\n",
    "number_of_pages": "481 pages",
    "publish_info": "\n            Published\n        September 10th 2013\n         by St. Martin's Press\n\n      ",
    "genres_info": ["Young Adult", "7,026 users", "Contemporary", "4,047 users", "Romance", "3,557 users", "Fiction", "2,135 users", "Realistic Fiction", "940 users", "New Adult", "786 users", "Womens Fiction", "Chick Lit", "629 users", "Young Adult", "Coming Of Age", "517 users", "Young Adult", "Teen", "459 users", "Audiobook", "390 users"]
}, {
    "book_description": ["In this third book in the Lunar Chronicles, Cinder and Captain Thorne are fugitives on the run, now with Scarlet and Wolf in tow. Together, they're plotting to overthrow Queen Levana and her army.", "Their best hope lies with Cress, a girl imprisoned on a satellite since childhood who's only ever had her netscreens as company. All that screen time has made Cress an excellent hacker. Unfortunately, she's just received orders from Levana to track down Cinder and her handsome accomplice.", "When a daring rescue of Cress goes awry, the group is separated. Cress finally has her freedom, but it comes at a higher price. Meanwhile, Queen Levana will let nothing prevent her marriage to Emperor Kai. Cress, Scarlet, and Cinder may not have signed up to save the world, but they may be the only hope the world has."],
    "info": {
        "ISBN": "(ISBN13: 9780312642976)",
        "Series": "The Lunar Chronicles #3",
        "setting": ["New Beijing", "Luna"],
        "Original Title": "Cress",
        "Characters": ["Princess Winter", "Linh Cinder", "Queen Levana", "Scarlet Benoit", "Ze’ev \"Wolf\" Kesley", "...more", "Emperor Kai", "Carswell Thorne", "Iko", "Crescent Moon \"Cress\" Darnel", "Jacin Clay", "Dr. Dmitri Erland", "Sybil Mira", "Aimery Park", "Linh Adri", "...less"],
        "Edition Language": "English",
        "Literary Awards": ["Goodreads Choice Award Nominee for Young Adult Fantasy & Science Fiction (2014)"]
    },
    "book_format_type": "Hardcover",
    "book_cover_url": "https://images.gr-assets.com/books/1470057005l/13206828.jpg",
    "author": "Marissa Meyer",
    "title": "\n      Cress\n      ",
    "number_of_pages": "552 pages",
    "publish_info": "\n            Published\n        February 4th 2014\n         by Feiwel & Friends\n\n      ",
    "genres_info": ["Young Adult", "4,393 users", "Fantasy", "3,818 users", "Science Fiction", "2,545 users", "Romance", "1,550 users"]
}, {
    "book_description": ["The Mortal War is over, and sixteen-year-old Clary Fray is back home in New York, excited about all the possibilities before her. She’s training to become a Shadowhunter and to use her unique power. Her mother is getting married to the love of her life. Downworlders and Shadowhunters are at peace at last. And—most importantly of all—she can finally call Jace her boyfriend.", "But nothing comes without a price.", "Someone is murdering Shadowhunters, provoking tensions between Downworlders and Shadowhunters that could lead to a second, bloody war. Clary’s best friend, Simon, can’t help her—his mother just found out that he’s a vampire, and now he’s homeless. When Jace begins to pull away from her without explaining why, Clary is forced to delve into the heart of a mystery whose solution reveals her worst nightmare: she herself has set in motion a terrible chain of events that could lead to her losing everything she loves. Even Jace."],
    "info": {
        "ISBN": "(ISBN13: 9781442403543)",
        "Series": "The Mortal Instruments #4",
        "setting": ["New York City, New York"],
        "Original Title": "City of Fallen Angels",
        "Characters": ["Alec Lightwood", "Jonathan \"Jace\" Wayland", "Isabelle Lightwood", "Magnus Bane", "Simon Lewis", "...more", "Jordan Kyle", "Maia Roberts", "Jocelyn Fray", "Luke Garroway", "Camille Belcourt", "Clarissa \"Clary\" Fray", "...less"],
        "Edition Language": "English"
    },
    "book_format_type": "Hardcover",
    "book_cover_url": "https://images.gr-assets.com/books/1369452302l/6752378.jpg",
    "author": "Cassandra Clare",
    "title": "\n      City of Fallen Angels\n      ",
    "number_of_pages": "424 pages",
    "publish_info": ", ",
    "genres_info": ["Fantasy", "6,395 users", "Young Adult", "5,281 users", "Fantasy", "Paranormal", "2,145 users", "Romance", "1,813 users", "Fantasy", "Urban Fantasy", "1,386 users", "Paranormal", "Vampires", "1,378 users", "Paranormal", "Angels", "1,136 users", "Fiction", "839 users", "Fantasy", "Supernatural", "836 users", "Fantasy", "Magic", "638 users"]
}, {
    "book_description": [" When he awoke from his long sleep, he didn't know much more than his name. His brain fuzz is lingering, even after the wolf Lupa told him he is a demigod and trained him to fight with the pen/sword in his pocket. Somehow Percy manages to make it to a camp for half-bloods, despite the fact that he has to keep killing monsters along the way. But the camp doesn't ring any bells with him. The only thing he can recall from his past is another name: Annabeth ", " When she lived before, she didn't do a very good job of it. Sure, she was an obedient daughter, even when her mother was possessed by greed. But that was the problem — when the Voice took over her mother and commanded Hazel to use her \"gift\" for an evil purpose, Hazel couldn't say no. Now because of her mistake, the future of the world is at risk. Hazel wished she could ride away from it all on the stallion that appears in her dreams. ", " His grandmother says he is descended from heroes and can be anything he wants to be, but he doesn't see it. He doesn't even know who his father is. He keeps hoping Apollo will claim him, because the only thing he is good at is archery — although not good enough to win camp war games. His bulky physique makes him feel like an ox, especially infront of Hazel, his closest friend at camp. He trusts her completely — enough to share the secret he holds close to his heart. ", "Beginning at the \"other\" camp for half-bloods and extending as far as the land beyond the gods, this breathtaking second installment of the Heroes of Olympus series introduces new demigods, revives fearsome monsters, and features other remarkable creatures, all destined to play a part in the Prophesy of Seven."],
    "info": {
        "ISBN": "(ISBN13: 9781423140597)",
        "Series": "The Heroes of Olympus #2",
        "setting": ["Oakland, California", "Alaska", "Portland, Oregon", "…more", "Seattle, Washington", "Berkeley, California", "North Vancouver, British Columbia", "Anchorage, Alaska", "Seward, Alaska", "…less"],
        "Original Title": "The Son of Neptune ",
        "Characters": ["Nico di Angelo", "Octavian", "Reyna", "Hazel Levesque", "Frank Zhang", "...more", "Ella the Harpy", "Percy Jackson", "...less"],
        "Edition Language": "English",
        "Literary Awards": ["Buckeye Children's Book Award for 6-8 (2012)"]
    },
    "book_format_type": "Hardcover",
    "book_cover_url": "https://images.gr-assets.com/books/1464201114l/9520360.jpg",
    "author": "Rick Riordan",
    "title": "\n      The Son of Neptune\n      ",
    "number_of_pages": "521 pages",
    "publish_info": "\n            Published\n        October 4th 2011\n         by Disney-Hyperion Books\n\n      ",
    "genres_info": ["Fantasy", "5,309 users", "Young Adult", "2,503 users", "Fantasy", "Mythology", "2,321 users"]
}, {
    "book_description": ["The ", " bestselling Mortal Instruments continues—and so do the thrills and danger for Jace, Clary, and Simon.", "What price is too high to pay, even for love? When Jace and Clary meet again, Clary is horrified to discover that the demon Lilith’s magic has bound her beloved Jace together with her evil brother Sebastian, and that Jace has become a servant of evil. The Clave is out to destroy Sebastian, but there is no way to harm one boy without destroying the other. As Alec, Magnus, Simon, and Isabelle wheedle and bargain with Seelies, demons, and the merciless Iron Sisters to try to save Jace, Clary plays a dangerous game of her own. The price of losing is not just her own life, but Jace’s soul. She’s willing to do anything for Jace, but can she still trust him? Or is he truly lost?", "Love. Blood. Betrayal. Revenge. Darkness threatens to claim the Shadowhunters in the harrowing fifth book of the Mortal Instruments series."],
    "info": {
        "ISBN": "(ISBN13: 9781442416864)",
        "Series": "The Mortal Instruments #5",
        "setting": ["New York City, New York", "Venice", "Prague (Praha)", "…more", "Paris", "Ireland", "…less"],
        "Original Title": "City of Lost Souls",
        "Characters": ["Alec Lightwood", "Jonathan \"Jace\" Wayland", "Isabelle Lightwood", "Magnus Bane", "Simon Lewis", "...more", "Jordan Kyle", "Maia Roberts", "Jocelyn Fray", "Luke Garroway", "Sebastian Morgenstern", "Aline Penhallow", "Camille Belcourt", "Clarissa \"Clary\" Fray", "Jonathan Morgenstern", "...less"],
        "Edition Language": "English"
    },
    "book_format_type": "Hardcover",
    "book_cover_url": "https://images.gr-assets.com/books/1460477703l/8755776.jpg",
    "author": "Cassandra Clare",
    "title": "\n      City of Lost Souls\n      ",
    "number_of_pages": "436 pages",
    "publish_info": "\n            Published\n        May 8th 2012\n         by Margaret K. McElderry\n\n      ",
    "genres_info": ["Fantasy", "5,224 users", "Young Adult", "1,934 users", "Fantasy", "Paranormal", "1,804 users", "Romance", "1,614 users"]
}, {
    "book_description": ["EVERY DAY THE SAME", "Rachel takes the same commuter train every morning and night. Every day she rattles down the track, flashes past a stretch of cozy suburban homes, and stops at the signal that allows her to daily watch the same couple breakfasting on their deck. She’s even started to feel like she knows them. Jess and Jason, she calls them. Their life—as she sees it—is perfect. Not unlike the life she recently lost.", "UNTIL TODAY", "And then she sees something shocking. It’s only a minute until the train moves on, but it’s enough. Now everything’s changed. Unable to keep it to herself, Rachel goes to the police. But is she really as unreliable as they say? Soon she is deeply entangled not only in the investigation but in the lives of everyone involved. Has she done more harm than good?"],
    "info": {
        "ISBN": "(ISBN13: 9781594633669)",
        "setting": ["London, England"],
        "Original Title": "The Girl on the Train",
        "Characters": ["Rachel Watson", "Anna Watson", "Tom Watson", "Megan Hipwell", "Scott Hipwell", "...more", "Kamal Abdic", "...less"],
        "Edition Language": "English",
        "Literary Awards": ["Audie Award for Audiobook of the Year (2016)", "Goodreads Choice Award for Mystery & Thriller (2015)", "Waterstones Book of the Year Nominee (2015)", "Woman & Home Reader's Choice Award for Best Thriller Of The Year (2016)"]
    },
    "book_format_type": "Hardcover",
    "book_cover_url": "https://images.gr-assets.com/books/1490903702l/22557272.jpg",
    "author": "Paula Hawkins",
    "title": "\n      The Girl on the Train\n",
    "number_of_pages": "325 pages",
    "publish_info": "\n            Published\n        January 13th 2015\n         by Riverhead Books\n\n      ",
    "genres_info": ["Mystery", "7,030 users", "Fiction", "6,888 users", "Thriller", "4,602 users", "Mystery", "Crime", "1,610 users", "Suspense", "1,503 users", "Thriller", "Mystery Thriller", "1,250 users", "Contemporary", "1,162 users", "Adult", "1,125 users", "Audiobook", "995 users", "Adult Fiction", "843 users"]
}, {
    "book_description": ["August Pullman wants to be an ordinary ten-year-old. He does ordinary things. He eats ice cream. He plays on his Xbox. He feels ordinary - inside.", "But Auggie is far from ordinary. Ordinary kids don't make other ordinary kids run away screaming in playgrounds. Ordinary kids don't get stared at wherever they go.", "Born with a terrible facial abnormality, Auggie has been home-schooled by his parents his whole life, in an attempt to protect him from the cruelty of the outside world. Now, for the first time, he's being sent to a real school - and he's dreading it. All he wants is to be accepted - but can he convince his new classmates that he's just like them, underneath it all?", "Narrated by Auggie and the people around him whose lives he touches forever, ", " is a funny, frank, astonishingly moving debut to read in one sitting, pass on to others, and remember long after the final page."],
    "info": {
        "Series": "Wonder #1",
        "setting": ["Upper Manhattan, New York"],
        "Original Title": "Wonder",
        "Characters": ["August Pullman", "Olivia Pullman", "Jackalope Will", "Julian Albans", "Summer Dawson"],
        "Edition Language": "English",
        "Literary Awards": ["Josette Frank Award (2013)", "Texas Bluebonnet Award Nominee (2013)", "West Australian Young Readers' Book Award (WAYRBA) for Younger Readers (2013)", "Dorothy Canfield Fisher Children's Book Award (2014)", "Charlie May Simon Children's Book Award (2014)", "...more", "Deutscher Jugendliteraturpreis for Preis der Jugendjury (2014)", "New Mexico Land of Enchantment Award for Children (2014)", "Judy Lopez Memorial Award for Children's Literature (2013)", "Louisiana Young Readers' Choice for Grades 3-5 (2015)", "NAIBA Book of the Year for Middle Readers (2012)", "Waterstones Children's Book Prize (2013)", "Washington State Sasquatch Award Nominee (2015)", "Bluestem Book Award (2014)", "Goodreads Choice Award Nominee for Best Middle Grade & Children's (2012)", "Carnegie Medal Nominee (2013)", "James Cook Book Award Honorable Book (2013)", "North Carolina Children's Book Award (2014)", "Premio El Templo de las Mil Puertas Nominee for Mejor novela extranjera independiente (2012)", "Rhode Island Children’s Book Award (2014)", "FAB Award Nominee (2014)", "...less"]
    },
    "book_format_type": "Paperback",
    "book_cover_url": "https://images.gr-assets.com/books/1412358842l/23302416.jpg",
    "author": "R.J. Palacio",
    "title": "\n      Wonder\n      ",
    "number_of_pages": "410 pages",
    "publish_info": ", ",
    "genres_info": ["Young Adult", "2,983 users", "Fiction", "2,018 users", "Realistic Fiction", "1,482 users", "Childrens", "Middle Grade", "1,174 users", "Contemporary", "1,162 users"]
}, {
    "book_description": ["“", "”", "My name is Kvothe.", "I have stolen princesses back from sleeping barrow kings. I burned down the town of Trebon. I have spent the night with Felurian and left with both my sanity and my life. I was expelled from the University at a younger age than most people are allowed in. I tread paths by moonlight that others fear to speak of during day. I have talked to Gods, loved women, and written songs that make the minstrels weep.", "You may have heard of me.", "So begins the tale of a hero told from his own point of view — a story unequaled in fantasy literature. Now in ", ", an escalating rivalry with a powerful member of the nobility forces Kvothe to leave the University and seek his fortune abroad. Adrift, penniless, and alone, he travels to Vintas, where he quickly becomes entangled in the politics of courtly society. While attempting to curry favor with a powerful noble, Kvothe uncovers an assassination attempt, comes into conflict with a rival arcanist, and leads a group of mercenaries into the wild, in an attempt to solve the mystery of who (or what) is waylaying travelers on the King's Road.", "All the while, Kvothe searches for answers, attempting to uncover the truth about the mysterious Amyr, the Chandrian, and the death of his parents. Along the way, Kvothe is put ﻿on trial by the legendary Adem mercenaries, is forced to reclaim the honor of the Edema Ruh, and travels into the Fae realm. There he meets Felurian, the faerie woman no man can resist, and who no man has ever survived...until Kvothe.", "In ", ", Kvothe takes his first steps on the path of the hero and learns how difficult life can be when a man becomes a legend in his own time."],
    "info": {
        "ISBN": "(ISBN13: 9780756404734)",
        "Series": "The Kingkiller Chronicle #2",
        "Literary Awards": ["David Gemmell Legend Award for Best Fantasy Novel (2012)", "Tähtifantasia Award Nominee (2016)", "Goodreads Choice Award Nominee for Best Fantasy (2011)", "Prix Elbakin.net for Meilleur roman fantasy traduit (2013)"],
        "Characters": ["Bast", "Denna", "Ambrose", "Kvothe", "Simmon", "...more", "Wilem", "The Chandrian", "Maer Alveron", "Felurian", "Devi", "Tempi", "Auri", "Fela", "Chronicler", "...less"],
        "Edition Language": "English",
        "Original Title": "The Wise Man's Fear"
    },
    "book_format_type": "Hardcover",
    "book_cover_url": "https://images.gr-assets.com/books/1452624392l/1215032.jpg",
    "author": "Patrick Rothfuss",
    "title": "\n      The Wise Man's Fear\n      ",
    "number_of_pages": "994 pages",
    "publish_info": ", ",
    "genres_info": ["Fantasy", "12,418 users", "Fiction", "1,505 users", "Fantasy", "Epic Fantasy", "708 users"]
}, {
    "book_description": ["It begins with a boy. Theo Decker, a thirteen-year-old New Yorker, miraculously survives an accident that kills his mother. Abandoned by his father, Theo is taken in by the family of a wealthy friend. Bewildered by his strange new home on Park Avenue, disturbed by schoolmates who don't know how to talk to him, and tormented above all by his unbearable longing for his mother, he clings to one thing that reminds him of her: a small, mysteriously captivating painting that ultimately draws Theo into the underworld of art.", "As an adult, Theo moves silkily between the drawing rooms of the rich and the dusty labyrinth of an antiques store where he works. He is alienated and in love-and at the center of a narrowing, ever more dangerous circle.", " combines vivid characters, mesmerizing language, and suspense, while plumbing with a philosopher's calm the deepest mysteries of love, identity, and art. It is an old-fashioned story of loss and obsession, survival and self-invention, and the ruthless machinations of fate."],
    "info": {
        "ISBN": "(ISBN13: 9780316055437)",
        "setting": ["Amsterdam", "Las Vegas, Nevada", "New York City, New York", "…more", "New York City's Upper East Side", "…less"],
        "Original Title": "The Goldfinch",
        "Characters": ["Boris Pavlikovsky (The Goldfinch)", "Theo Decker", "Pippa", "Hobie"],
        "Edition Language": "English",
        "Literary Awards": ["Pulitzer Prize for Fiction (2014)", "Audie Award for Literary Fiction (2014)", "National Book Critics Circle Award Nominee for Fiction (2013)", "Women's Prize for Fiction Nominee (2014)", "Andrew Carnegie Medal for Fiction (2014)", "...more", "Goodreads Choice Award Nominee for Fiction (2013)", "...less"]
    },
    "book_format_type": "Hardcover",
    "book_cover_url": "https://images.gr-assets.com/books/1451554970l/17333223.jpg",
    "author": "Donna Tartt",
    "title": "\n      The Goldfinch\n",
    "number_of_pages": "771 pages",
    "publish_info": ", ",
    "genres_info": ["Fiction", "5,393 users", "Contemporary", "967 users", "Literary Fiction", "616 users"]
}, {
    "book_description": ["Danger and betrayal, love and loss, secrets and enchantment are woven together in the breathtaking finale to the #1 New York Times bestselling Infernal Devices Trilogy, prequel to the internationally bestselling Mortal Instruments series.", "THE INFERNAL DEVICES WILL NEVER STOP COMING", "A net of shadows begins to tighten around the Shadowhunters of the London Institute. Mortmain plans to use his Infernal Devices, an army of pitiless automatons, to destroy the Shadowhunters. He needs only one last item to complete his plan: he needs Tessa Gray.", "Charlotte Branwell, head of the London Institute, is desperate to find Mortmain before he strikes. But when Mortmain abducts Tessa, the boys who lay equal claim to her heart, Jem and Will, will do anything to save her. For though Tessa and Jem are now engaged, Will is as much in love with her as ever.", "As those who love Tessa rally to rescue her from Mortmain’s clutches, Tessa realizes that the only person who can save her is herself. But can a single girl, even one who can command the power of angels, face down an entire army?", "Danger and betrayal, secrets and enchantment, and the tangled threads of love and loss intertwine as the Shadowhunters are pushed to the very brink of destruction in the breathtaking conclusion to the Infernal Devices trilogy."],
    "info": {
        "ISBN": "(ISBN13: 9781406321340)",
        "Series": "The Infernal Devices #3",
        "setting": ["London, England", "York, England", "London, England"],
        "Original Title": "Clockwork Princess",
        "Characters": ["Theresa Gray", "Magnus Bane", "William Herondale", "James Carstairs", "Henry Branwell", "...more", "Charlotte Branwell", "Gideon Lightwood", "Gabriel Lightwood", "Sophie Collins", "Cecily Herondale", "...less"],
        "Edition Language": "English"
    },
    "book_format_type": "Paperback",
    "book_cover_url": "https://images.gr-assets.com/books/1436788488l/18335634.jpg",
    "author": "Cassandra Clare",
    "title": "\n      Clockwork Princess\n      ",
    "number_of_pages": "567 pages",
    "publish_info": "\n            Published\n        September 5th 2013\n         by Walker Books Ltd\n\n            ",
    "genres_info": ["Fantasy", "4,716 users", "Young Adult", "3,630 users", "Romance", "1,717 users", "Fantasy", "Paranormal", "1,515 users"]
}, {
    "book_description": ["A mysterious island. An abandoned orphanage. A strange collection of curious photographs.", "A horrific family tragedy sets sixteen-year-old Jacob journeying to a remote island off the coast of Wales, where he discovers the crumbling ruins of Miss Peregrine’s Home for Peculiar Children. As Jacob explores its abandoned bedrooms and hallways, it becomes clear that the children were more than just peculiar. They may have been dangerous. They may have been quarantined on a deserted island for good reason. And somehow—impossible though it seems—they may still be alive.", "A spine-tingling fantasy illustrated with haunting vintage photography, ", " will delight adults, teens, and anyone who relishes an adventure in the shadows."],
    "info": {
        "ISBN": "(ISBN13: 9781594744761)",
        "Series": "Miss Peregrine’s Peculiar Children #1",
        "setting": ["Englewood, Florida", "Wales"],
        "Original Title": "Miss Peregrine’s Home for Peculiar Children",
        "Characters": ["Olive Abroholos Elephanta", "Fiona Waters", "Horace Somnusson", "Millard Nullings", "Jacob Portman", "...more", "Emma Bloom", "Alma Lefay Peregrine", "Abraham Portman", "Bronwyn Bruntley", "Enoch O'Connor", "Ferdinand Portman", "Hugh Apiston", "Claire Densmore", "Miss Avocet", "...less"],
        "Edition Language": "English",
        "Literary Awards": ["Grand Prix de l'Imaginaire for Roman jeunesse étranger (2015)", "Pennsylvania Young Readers' Choice Award for Young Adults (2014)", "The Kitschies Nominee for Golden Tentacle (Debut) (2011)"]
    },
    "book_format_type": "Hardcover",
    "book_cover_url": "https://images.gr-assets.com/books/1472782916l/9460487.jpg",
    "author": "Ransom Riggs",
    "title": "\n      Miss Peregrine’s Home for Peculiar Children\n      ",
    "number_of_pages": "352 pages",
    "publish_info": ", ",
    "genres_info": ["Fantasy", "9,354 users", "Young Adult", "7,665 users", "Fiction", "3,690 users", "Fantasy", "Paranormal", "2,248 users", "Mystery", "1,744 users"]
}, {
    "book_description": ["To five-year-old Jack, Room is the entire world. It is where he was born and grew up; it's where he lives with his Ma as they learn and read and eat and sleep and play. At night, his Ma shuts him safely in the wardrobe, where he is meant to be asleep when Old Nick visits.", "Room is home to Jack, but to Ma, it is the prison where Old Nick has held her captive for seven years. Through determination, ingenuity, and fierce motherly love, Ma has created a life for Jack. But she knows it's not enough...not for her or for him. She devises a bold escape plan, one that relies on her young son's bravery and a lot of luck. What she does not realize is just how unprepared she is for the plan to actually work.", "Told entirely in the language of the energetic, pragmatic five-year-old Jack, ", " is a celebration of resilience and the limitless bond between parent and child, a brilliantly executed novel about what it means to journey from one world to another."],
    "info": {
        "Edition Language": "English",
        "ISBN": "(ISBN13: 9780316098335)",
        "Original Title": "Room",
        "Characters": ["Jack Tenpenny", "Ma", "Old Nick"],
        "Literary Awards": ["Man Booker Prize Nominee (2010)", "Orange Prize Nominee for Fiction Shortlist (2011)", "Pennsylvania Young Readers' Choice Award Nominee for Young Adults (2013)", "ALA Alex Award (2011)", "Indies Choice Book Award for Fiction (2011)", "...more", "Bord Gáis Energy Irish Book Award for Hughes & Hughes Irish Novel of the Year (2010)", "Canadian Booksellers Association Libris Award for Fiction Book (2011)", "Lincoln Award Nominee (2014)", "Galaxy National Book Award for WHSmith Paperback of the Year (2011)", "Commonwealth Writers' Prize for Best Book in Caribbean and Canada (2011)", "Trillium Book Award Nominee for English-language (2011)", "UC Book of the Year (2014)", "Eason Novel of the Year (2010)", "Rogers Writers' Trust Fiction Prize (2010)", "OLA Evergreen Award (2011)", "Goodreads Choice Award for Fiction, Nominee for Favorite Heroine (2010)", "The International DUBLIN Literary Award Nominee (2012)", "...less"]
    },
    "book_format_type": "Hardcover",
    "book_cover_url": "https://images.gr-assets.com/books/1344265419l/7937843.jpg",
    "author": "Emma Donoghue",
    "title": "\n      Room\n",
    "number_of_pages": "321 pages",
    "publish_info": "\n            Published\n        September 13th 2010\n         by Little, Brown and Company\n\n      ",
    "genres_info": ["Fiction", "5,877 users", "Contemporary", "1,418 users", "Adult", "723 users", "Adult Fiction", "644 users"]
}, {
    "book_description": ["In the magical underworld of Victorian London, Tessa Gray has at last found safety with the Shadowhunters. But that safety proves fleeting when rogue forces in the Clave plot to see her protector, Charlotte, replaced as head of the Institute. If Charlotte loses her position, Tessa will be out on the street—and easy prey for the mysterious Magister, who wants to use Tessa’s powers for his own dark ends.", "With the help of the handsome, self-destructive Will and the fiercely devoted Jem, Tessa discovers that the Magister’s war on the Shadowhunters is deeply personal. He blames them for a long-ago tragedy that shattered his life. To unravel the secrets of the past, the trio journeys from mist-shrouded Yorkshire to a manor house that holds untold horrors, from the slums of London to an enchanted ballroom where Tessa discovers that the truth of her parentage is more sinister than she had imagined. When they encounter a clockwork demon bearing a warning for Will, they realize that the Magister himself knows their every move—and that one of their own has betrayed them.", "Tessa finds her heart drawn more and more to Jem, but her longing for Will, despite his dark moods, continues to unsettle her. But something is changing in Will—the wall he has built around himself is crumbling. Could finding the Magister free Will from his secrets and give Tessa the answers about who she is and what she was born to do?", "As their dangerous search for the Magister and the truth leads the friends into peril, Tessa learns that when love and lies are mixed, they can corrupt even the purest heart."],
    "info": {
        "ISBN": "(ISBN13: 9781416975885)",
        "Series": "The Infernal Devices #2",
        "setting": ["London, England"],
        "Original Title": "Clockwork Prince",
        "Characters": ["Theresa Gray", "Magnus Bane", "William Herondale", "James Carstairs", "Jessamine Lovelace", "...more", "Henry Branwell", "Charlotte Branwell", "Nathaniel Gray", "Gideon Lightwood", "Gabriel Lightwood", "Sophie Collins", "...less"],
        "Edition Language": "English",
        "Literary Awards": ["Teen Buckeye Book Award Nominee (2012)", "Children's Choice Book Award Nominee for Teen Choice Book of the Year (2012)"]
    },
    "book_format_type": "Hardcover",
    "book_cover_url": "https://images.gr-assets.com/books/1460477747l/10025305.jpg",
    "author": "Cassandra Clare",
    "title": "\n      Clockwork Prince\n      ",
    "number_of_pages": "502 pages",
    "publish_info": ", ",
    "genres_info": ["Fantasy", "5,213 users", "Young Adult", "4,168 users", "Fantasy", "Paranormal", "1,728 users", "Romance", "1,717 users", "Science Fiction", "Steampunk", "1,535 users"]
}, {
    "book_description": ["... Red hair, wrong clothes. Standing behind him until he turns his head. Lying beside him until he wakes up. Making everyone else seem drabber and flatter and never good enough...Eleanor.", "... He knows she'll love a song before he plays it for her. He laughs at her jokes before she ever gets to the punch line. There's a place on his chest, just below his throat, that makes her want to keep promises...Park.", "Set over the course of one school year, this is the story of two star-crossed sixteen-year-olds—smart enough to know that first love almost never lasts, but brave and desperate enough to try."],
    "info": {
        "ISBN": "(ISBN13: 9781250012579)",
        "setting": ["Omaha, Nebraska"],
        "Original Title": "Eleanor & Park",
        "Characters": ["Park Sheridan", "Eleanor Douglas"],
        "Edition Language": "English",
        "Literary Awards": ["Georgia Peach Book Award (2014)", "All About Romance (AAR) Annual Reader Poll for Best Young Adult Romance (2014)", "Michael L. Printz Award Nominee (2014)", "Pennsylvania Young Readers' Choice Award for Young Adults (2015)", "Milwaukee County Teen Book Award (2014)", "...more", "Michigan Library Association Thumbs Up! Award (2014)", "Deutscher Jugendliteraturpreis Nominee for Jugendbuch (2016)", "Amelia Elizabeth Walden Award (ALAN/NCTE) (2014)", "Boston Globe-Horn Book Award for Fiction (2013)", "Dioraphte Jongerenliteratuurprijs for vertaald boek (2015)", "Lincoln Award (2015)", "DABWAHA Romance Tournament Nominee for Best Young Adult Romance (2014)", "North Carolina Young Adult Book Award for High School (2016)", "Goodreads Choice Award for Best Young Adult Fiction (2013)", "Green Mountain Book Award Nominee (2015)", "The Magnolia Award for 9-12 (2015)", "Missouri Gateway Readers Award Nominee (2016)", "Premio El Templo de las Mil Puertas Nominee for Mejor novela extranjera independiente (2013)", "Odyssey Honor (2014)", "...less"]
    },
    "book_format_type": "Hardcover",
    "book_cover_url": "https://images.gr-assets.com/books/1341952742l/15745753.jpg",
    "author": "Rainbow Rowell",
    "title": "\n      Eleanor & Park\n",
    "number_of_pages": "328 pages",
    "publish_info": "\n            Published\n        February 26th 2013\n         by St. Martin's Press\n\n      ",
    "genres_info": ["Young Adult", "9,217 users", "Romance", "5,027 users", "Contemporary", "3,247 users", "Fiction", "2,895 users"]
}, {
    "book_description": ["In the aftermath of a colossal battle, the future of the Seven Kingdoms hangs in the balance—beset by newly emerging threats from every direction. In the east, Daenerys Targaryen, the last scion of House Targaryen, rules with her three dragons as queen of a city built on dust and death. But Daenerys has thousands of enemies, and many have set out to find her. As they gather, one young man embarks upon his own quest for the queen, with an entirely different goal in mind.", "Fleeing from Westeros with a price on his head, Tyrion Lannister, too, is making his way to Daenerys. But his newest allies in this quest are not the rag-tag band they seem, and at their heart lies one who could undo Daenerys’s claim to Westeros forever.", "Meanwhile, to the north lies the mammoth Wall of ice and stone—a structure only as strong as those guarding it. There, Jon Snow, 998th Lord Commander of the Night’s Watch, will face his greatest challenge. For he has powerful foes not only within the Watch but also beyond, in the land of the creatures of ice.", "From all corners, bitter conflicts reignite, intimate betrayals are perpetrated, and a grand cast of outlaws and priests, soldiers and skinchangers, nobles and slaves, will face seemingly insurmountable obstacles. Some will fail, others will grow in the strength of darkness. But in a time of rising restlessness, the tides of destiny and politics will lead inevitably to the greatest dance of all."],
    "info": {
        "Series": "A Song of Ice and Fire #5",
        "Edition Language": "English",
        "Original Title": "A Dance with Dragons",
        "Characters": ["Brandon Stark", "Tyrion Lannister", "Daenerys Targaryen", "Jon Snow", "Theon Greyjoy", "...more", "Arya Stark", "Cersei Lannister", "Stannis Baratheon", "Melisandre", "Davos Seaworth", "Sansa Stark", "Varys", "Brienne of Tarth", "...less"],
        "Literary Awards": ["Hugo Award Nominee for Best Novel (2012)", "Locus Award for Best Fantasy Novel (2012)", "World Fantasy Award Nominee for Best Novel (2012)", "SFX Award for Best Novel (2012)", "Goodreads Choice Award for Best Fantasy (2011)"]
    },
    "book_format_type": "Kindle Edition",
    "book_cover_url": "https://images.gr-assets.com/books/1327885335l/10664113.jpg",
    "author": "George R.R. Martin",
    "title": "\n      A Dance with Dragons\n      ",
    "number_of_pages": "1125 pages",
    "publish_info": "\n            Published\n        July 12th 2011\n         by Bantam\n\n      ",
    "genres_info": ["Fantasy", "18,296 users", "Fiction", "3,566 users", "Fantasy", "Epic Fantasy", "882 users", "Science Fiction Fantasy", "645 users", "Fantasy", "High Fantasy", "540 users", "Fantasy", "Dragons", "488 users", "Adult", "434 users", "Adventure", "422 users", "Epic", "383 users", "Audiobook", "288 users"]
}, {
    "book_description": ["After serving out a year of hard labor in the salt mines of Endovier for her crimes, 18-year-old assassin Celaena Sardothien is dragged before the Crown Prince. Prince Dorian offers her her freedom on one condition: she must act as his champion in a competition to find a new royal assassin.", "Her opponents are men-thieves and assassins and warriors from across the empire, each sponsored by a member of the king's council. If she beats her opponents in a series of eliminations, she'll serve the kingdom for four years and then be granted her freedom. Celaena finds her training sessions with the captain of the guard, Westfall, challenging and exhilarating. But she's bored stiff by court life. Things get a little more interesting when the prince starts to show interest in her ... but it's the gruff Captain Westfall who seems to understand her best.", "Then one of the other contestants turns up dead ... quickly followed by another. Can Celaena figure out who the killer is before she becomes a victim? As the young assassin investigates, her search leads her to discover a greater destiny than she could possibly have imagined."],
    "info": {
        "ISBN": "(ISBN13: 9781599906959)",
        "Series": "Throne of Glass #1",
        "setting": ["Rifthold, Adarlan"],
        "Original Title": "Throne of Glass",
        "Characters": ["Celaena Sardothien", "Chaol Westfall", "Prince Dorian Havilliard", "Princess Nehemia Ytger", "Kaltain Rompier"],
        "Edition Language": "English",
        "Literary Awards": ["Lincoln Award Nominee (2015)", "North Carolina Young Adult Book Award for High School (2015)"]
    },
    "book_format_type": "Hardcover",
    "book_cover_url": "https://images.gr-assets.com/books/1495278054l/7896527.jpg",
    "author": "Sarah J. Maas",
    "title": "\n      Throne of Glass\n      ",
    "number_of_pages": "404 pages",
    "publish_info": "\n            Published\n        August 7th 2012\n         by Bloomsbury USA Children's\n\n            ",
    "genres_info": ["Young Adult", "5,387 users", "Romance", "1,961 users", "Fantasy", "Magic", "1,208 users", "Fantasy", "High Fantasy", "758 users", "Young Adult", "Young Adult Fantasy", "667 users", "Adventure", "573 users", "Fantasy", "Paranormal", "433 users", "Mystery", "376 users", "Did Not Finish", "357 users", "Action", "285 users"]
}, {
    "book_description": ["Life can turn on a dime—or stumble into the extraordinary, as it does for Jake Epping, a high school English teacher in Lisbon Falls, Maine. While grading essays by his GED students, Jake reads a gruesome, enthralling piece penned by janitor Harry Dunning: fifty years ago, Harry somehow survived his father’s sledgehammer slaughter of his entire family. Jake is blown away...but an even more bizarre secret comes to light when Jake’s friend Al, owner of the local diner, enlists Jake to take over the mission that has become his obsession—to prevent the Kennedy assassination. How? By stepping through a portal in the diner’s storeroom, and into the era of Ike and Elvis, of big American cars, sock hops, and cigarette smoke... Finding himself in warmhearted Jodie, Texas, Jake begins a new life. But all turns in the road lead to a troubled loner named Lee Harvey Oswald. The course of history is about to be rewritten...and become heart-stoppingly suspenseful."],
    "info": {
        "ISBN": "(ISBN13: 9781451627282)",
        "setting": ["Maine", "Derry, Maine", "Jodie, Texas"],
        "Original Title": "11/22/63",
        "Characters": ["John F. Kennedy", "Lee Harvey Oswald", "Jake Epping", "Al Templeton", "Harry Dunning", "...more", "Marina Oswald", "Bill Titus", "Sadie Dunhill", "Yellow Card Man", "Deacon \"Deke\" Simmons", "Ellen Dockerty", "George de Mohrenschildt", "...less"],
        "Edition Language": "English",
        "Literary Awards": ["World Fantasy Award Nominee for Best Novel (2012)", "ITW Thriller Award for Best Hard Cover Novel (2012)", "Grand Prix de l'Imaginaire Nominee for Roman étranger (2014)", "このミステリーがすごい！ for Best Translated Mystery Novel of the Year in Japan (2014)", "本屋大賞 Nominee for Translated Fiction (2014)", "...more", "Goodreads Choice Award for Best Science Fiction (2011)", "...less"]
    },
    "book_format_type": "Hardcover",
    "book_cover_url": "https://images.gr-assets.com/books/1327876792l/10644930.jpg",
    "author": "Stephen King",
    "title": "\n      11/22/63\n",
    "number_of_pages": "849 pages",
    "publish_info": "\n            Published\n        November 8th 2011\n         by Scribner\n\n      ",
    "genres_info": ["Fiction", "3,520 users", "Historical", "2,460 users", "Science Fiction", "1,613 users", "Science Fiction", "Time Travel", "1,386 users", "Fantasy", "959 users"]
}]